[
{
    "model": "main.disease",
    "pk": 1,
    "fields": {
        "name": "Apple scab",
        "plant": 1,
        "symptoms": "Yellow or chlorotic spots on leaves, dark olive green spots on leaves and fruit, may be a velvety growth on spots on undersides of leaves, twisting of leaves, distorted leaves, severely infected leaves turn yellow and drop from tree.",
        "cause": "Fungus",
        "comments": "Fungus overwinters on dead foliage on ground, spores dispersed by wind, high moisture encourages fungal growth.",
        "management": "Remove all leaves dropped from tree in the fall and compost to prevent any diseases surviving in debris, application of zinc and fertilizer grade urea in the Fall may be necessary to speed leaf drop, lime should then be added to fallen leaves, fungicide application may be necessary in areas where leaves remain wet for periods in excess of 9 hours, fungicides such as copper soaps and Bordeaux mixture should be applied if there is a chance of wet period as soon as leaf tips emerge.",
        "image": "apple_scab.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 2,
    "fields": {
        "name": "Black rot",
        "plant": 1,
        "symptoms": "Purple flecks or circular lesions which are brown in the centre and purple at margin, red flecks, purple lesions and/or brown black rings on fruit.",
        "cause": "Fungus",
        "comments": "Spores can overwinter in twigs or fruit remaining on the tree and spread during rainfall.",
        "management": "Remove dead wood, mummified fruit and cankers from trees to reduce spread of disease, burn any prunings that have been made from the tree, disease can be controlled by applying fungicides from silver tip to harvest.",
        "image": "apple_black_rot.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 3,
    "fields": {
        "name": "Cedar apple rust",
        "plant": 1,
        "symptoms": "Bright orange or yellow patches on top side of leaves surrounded by a red band and small black spots in the center, by mid summer, cup like structures called aecia form on the leaf undersides, these become covered in tubular structures from which spores are released.",
        "cause": "Fungus",
        "comments": "Fungus requires two hosts to complete lifecycle, forms galls on Eastern red cedar and spores are carried by wind to apple, use caution when planting apple close to red cedar.",
        "management": "Plant resistant varieties where possible, remove nearby red cedar, if growing susceptible varieties in proximity to red cedar follow a fungicide program.",
        "image": "apple_cedar_rust.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 4,
    "fields": {
        "name": "Flyspeck",
        "plant": 1,
        "symptoms": "Shiny black fungal fruiting bodies appear as dots arranged in irregular to circular pattern on fruit surface.",
        "cause": "Fungus",
        "comments": "Outbreaks usually follow above average summer temperatures and frequent rainfall.",
        "management": "Prune trees to open canopy and promote drying of fruit surface, fungicides may be applied as a preventative measure.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 5,
    "fields": {
        "name": "Powdery mildew",
        "plant": 1,
        "symptoms": "White velvety patches on underside of leaves, chlorotic spots on top side of the leaves",
        "cause": "Fungus",
        "comments": "Fungal spores overwinter in buds, spread by wind",
        "management": "Prune out infected shoots while dormant in early spring, apply sprays at pink bud stage to reduce build up, organic treatments include application of lime and sulfur",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 6,
    "fields": {
        "name": "Sooty blotch and flyspeck",
        "plant": 1,
        "symptoms": "Sooty blotches with an indefinite margin on surface of fruit, blotches may coalesce to cover entire fruit, shiny black fungal fruiting bodies appear as dots arranged in irregular to circular pattern on fruit surface",
        "cause": "Fungi",
        "comments": "Infections occur mainly during periods of high rainfall and high humidity",
        "management": "Plant trees in area with good sunlight and air circulation, prune trees to an open center, blemishes superficial and can be washed off",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 7,
    "fields": {
        "name": "Fire blight",
        "plant": 1,
        "symptoms": "Plant appears as if it has been scorched by fire, watery exudate may be present on infected areas.",
        "cause": "Bacterium",
        "comments": "Bacterium overwinters in bark or cankers, spread by pollinating insects and by rain splash.",
        "management": "Cut out diseased wood, treat with Bordeaux mixture or approved fixed copper materials for organic production, streptomycin or copper application to blossoms may be necessary to prevent spread.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 8,
    "fields": {
        "name": "Phytophthora crown and root rot",
        "plant": 1,
        "symptoms": "Leaves wilting but remain attached to the tree, reduced growth, early senescence, cankers at soil level, dark discoloration of bark which is slimy when wet.",
        "cause": "Fungus",
        "comments": "Infection encouraged by poorly draining soil.",
        "management": "Practice good water management to prevent emergence of disease, do not over water trees or allow water to accumulate in soil, there is no treatment for Phytophthora infection once present, no apple varieties are resistant to all strains of the pathogen.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 9,
    "fields": {
        "name": "Aphids (Green apple aphid, Woolly apple aphid)",
        "plant": 1,
        "symptoms": "Small soft bodied insects on underside of leaves and/or stems of plant, usually green or yellow in color, woolly apple aphids are covered in masses of white, wool like material, green apple aphids are dark green when they forst hatch and change to yellow green with darker green spots as they mature, if aphid infestation is heavy it may cause leaves to yellow and/or distorted, necrotic spots on leaves and/or stunted shoots, aphids secrete a sticky, sugary substance called honeydew which encourages the growth of sooty mold on the plants.",
        "cause": "Insects",
        "comments": "Distinguishing features include the presence of cornicles (tubular structures) which project backwards from the body of the aphid, will generally not move very quickly when disturbed.",
        "management": "If aphid population is limited to just a few leaves or shoots then the infestation can be pruned out to provide control, check transplants for aphids before planting, use tolerant varieties if available, reflective mulches such as silver colored plastic can deter aphids from feeding on plants, sturdy plants can be sprayed with a strong jet of water to knock aphids from leaves, insecticides are generally only required to treat aphids if the infestation is very high   plants generally tolerate low and medium level infestation, insecticidal soaps or oils such as neem or canola oil are usually the best method of control, always check the labels of the products for specific usage guidelines prior to use.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 10,
    "fields": {
        "name": "Apple maggot",
        "plant": 1,
        "symptoms": "Misshapen, pitted and sunken areas on fruit surface, browning and rotting of apple flesh.",
        "cause": "Insect",
        "comments": "Surface damage caused to fruit by female laying her eggs, larvae damage flesh by burrowing and feeding.",
        "management": "Use red spherical sticky traps to trap adults, place one trap for every 100 apple fruits, bag apples by tying or stapling polythene bags around fruit to prevent adults laying eggs   cut corners from bags to ensure air supply to fruit, spray fruit with insecticide prior to eggs being laid.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 11,
    "fields": {
        "name": "Codling moth",
        "plant": 1,
        "symptoms": "Holes and burrows in fruit, holes may be blocked with crumbly brown frass (insect excrement), wounds may be shallow or may be deep burrows extending to the fruit---s core, adult insect is a dark brown moth, larvae are pink with a brown head and may be up to 1.3 cm (0.5 in) long.",
        "cause": "Insect",
        "comments": "Insect usually undergoes 2 4 generations per year.",
        "management": "Proper pruning methods help to open out tree canopy to ensure treatments penetrate interior of the tree and reach larvae, removal of any wild hosts or trees in abandoned orchards helps remove reservoirs of insect, organically acceptable control methods include application of Entrust and kaolin clay, small scale growers and home gardeners can remove infested fruit by hand before larvae leaves fruit to reduce insect population, successful reduction of insect population in large scale orchards is usually achieved by mating disruption by releasing pheromones over successive years.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 12,
    "fields": {
        "name": "Leafhoppers (White apple leafhopper, Rose leafhopper)",
        "plant": 1,
        "symptoms": "White stippling on foliage, may be a reduction in fruit size, black specks of frass on fruit, sticky exudate on fruit and leaves caused by excretion of honeydew by insect.",
        "cause": "Insect",
        "comments": "Damage resembles that of spider mites but is much more noticeable, insect usually reaches highest number close to or after harvest.",
        "management": "Control of leafhoppers is becoming problematic as they are developing resistance to organophosphate insecticides, sprays of appropriate insecticides are most effective at controlling the insect before the adults emerge, monitor trees for appearance of nymphs.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 13,
    "fields": {
        "name": "Leafrollers (Omnivorous leafroller, Redbanded leafroller, etc)",
        "plant": 1,
        "symptoms": "Leaves of plant rolled and tied together with silk webbing, feeding damage to rolled leaves, defoliation of plant, silk webbing may also be present on fruits and fruits may have substantial scarring from feeding damage, larvae wriggle vigorously when disturbed and may drop from plant on a silken thread.",
        "cause": "Insect",
        "comments": "Adult insect is a moth which can fly over several miles to find suitable hosts.",
        "management": "Monitor plants regularly for signs of infestation, remove weeds from plant bases as they can act as hosts for leafrollers,",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 14,
    "fields": {
        "name": "Roundheaded apple tree borer",
        "plant": 1,
        "symptoms": "The presence of bore holes at the base of tree which are covered by pigtail shaped frass and/or darkened areas in the bark due to sap flow are the proof of insect infestation. The young may kill by one or two larvae infestation. The older trees show drying and break off near the base.",
        "cause": "Insect",
        "comments": "The insect is quite common in US and Canada. The host range of this insect is apple, pear, quince, mountain ash, hawthorn and serviceberry.",
        "management": "Use of trunk wraps to avoid insect attack. Removing and killing of larvae from the tunnel if possible. Application of suitable insecticide.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 15,
    "fields": {
        "name": "Stinkbugs  (Various)",
        "plant": 1,
        "symptoms": "Dark colored pinpricks on fruit, depressed dimples on fruit surface with white, pithy area underneath, stink bugs often carry pathogens in their mouthparts which can cause secondary infections and decay of fruit, adult insect is shield shaped and brown or green in color, may have pink, red or yellow markings, eggs are drum shaped and laid in clusters on the leaves, larvae resemble the adults but are smaller, insect frass may be visible on the fruit is small, brown teardropped shaped deposits",
        "cause": "Insect",
        "comments": "Adult insects overwinter under leaves, on legumes, blackberries or on certain weeds such as mustard or Russian thistle",
        "management": "Remove weeds around crop which may act as overwintering sites for stink bugs and practice good weed management throughout the year, organically accepted control methods include the use of insecticidal soaps, kaolin clay and preservation of natural enemies",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 16,
    "fields": {
        "name": "Spider mites",
        "plant": 1,
        "symptoms": "Leaves stippled with yellow, leaves may appear bronzed, webbing covering leaves, mites may be visible as tiny moving dots on the webs or underside of leaves, best viewed using a hand lens, usually not spotted until there are visible symptoms on the plant, leaves turn yellow and may drop from plant",
        "cause": "Arachnid",
        "comments": "Spider mites thrive in dusty conditions, water stressed plants are more susceptible to attack",
        "management": "In the home garden, spraying plants with a strong jet of water can help reduce buildup of spider mite populations, if mites become problematic apply insecticidal soap to plants, certain chemical insecticides may actually increase mite populations by killing off natural enemies and promoting mite reproduction",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 17,
    "fields": {
        "name": "Healthy",
        "plant": 1,
        "symptoms": "Apple, Malus domestica, is a deciduous tree in the family Rosaceae which is grown for its fruits, known as apples. Apple fruits are one of the most widely cultivated fruits in the world, are round (pome) in shape and range in color from green to red. When planted from a seed, an apple tree can take six to ten years to mature and produce fruit of its own. Apple trees are small to medium sized trees reaching heights of 5-10 m (16.4-32.8 ft), with a central trunk which divides into several branches. The leaves of the tree are oval in shape and can reach up to 13 cm (5.1 in) in length and 7 cm (2.8 in) in width. Apple may also be referred to as mela or appel and the domestic tree is believed to have originated from Western Asia and the Mediterranean from several wild ancestors.",
        "cause": "Nil",
        "comments": "Nil",
        "management": "Nil",
        "image": "apple_healthy.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 18,
    "fields": {
        "name": "Healthy",
        "plant": 2,
        "symptoms": "Blueberry is a crown forming, woody, perennial shrub in the family Ericaceae grown for its fruits, or berries, of the same name. The blueberry plant possesses oval or elliptical leaves which grow alternately on the stems. The stems, or twigs, are yellow/green in color and turn reddish in winter. Flowers are bell shaped and can be either white or pink, occurring in clusters of 8 to 10 flowers. Berries are blue to black in color and 0.6-1.3 cm (0.25-0.5 in) in size. Lowbush blueberry plants (including Vaccinium angustifolium) are smaller in stature, reaching heights of 35 to 60 cm (13.8-23.6 in) and with proper management can produce fruit for between 40 and 50 years. Lowbush blueberries are also sometimes referred to as Maine, New Hampshire or wild blueberry and are native to eastern/central Canada and northeastern United States. Highbush blueberries (including Vaccinium corymbosum) are generally 2-3 m (6.6-9.8 ft) in height but can reach up to 5 m (16.4 ft) and may also be referred to as huckleberry or swamp blueberry. Highbush blueberry accounts for most of the commercial production of blueberry fruit and is also native only to North America. ",
        "cause": "",
        "comments": "",
        "management": "",
        "image": "blueberry_healthy.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 19,
    "fields": {
        "name": "Bacterial canker",
        "plant": 3,
        "symptoms": "Cankers on twigs at bases of flower and leaf buds, in pruning wounds or at the base of spurs which exude amber colored gum, cankers spread upwards and form sunken areas in winter, if pathogen enters dormant buds they may be killed or open normally in Spring before collapsing in early Summer, infected buds may be symptomless",
        "cause": "Bacterium",
        "comments": "Disease emergence favors high moisture and low temperatures in the spring, young trees particularly susceptible, trees grown in sandy soils that drain poorly are also susceptible",
        "management": "Ensure that a suitable cherry variety and rootstock is chosen based on geographic location and environmental conditions to prevent stress to tree which predisposes tree to canker disease, apply protective copper spray to trees before flowering, prune trees in early summer to decrease likelihood of infection",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 20,
    "fields": {
        "name": "Black knot",
        "plant": 3,
        "symptoms": "Elongated swellings (knots) on woody parts of tree which can reach up to 30 cm (12 in) long, knots are initially olive green in color with a corky texture but turn black in color and become hard and brittle, knots grow in length each year",
        "cause": "Fungus",
        "comments": "Infections occur on new shoots after rainfall and knots develop rapidly in second year",
        "management": "Prune knots on twigs and branches 8 10 cm (3 4 in) below the swelling and remove the pruned branches from the orchard, remove knots on older branches by removing the knot plus 2 cm (0.8 in) of surrounding tissue, removal of knots is most effective when done in midsummer, disease can be controlled by application of appropriate fungicides, if available, during shoot elongation",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 21,
    "fields": {
        "name": "Brown rot",
        "plant": 3,
        "symptoms": "Brown discoloration of fruit skin and inner tissue, fruit skin wrinkled, collapsed flowers exuding sap from their bases, tan cankers with dark edges on twigs, gray brown spore masses may be present on cankers",
        "cause": "Fungus",
        "comments": "Fungus survives in mummified fruit on the tree, blighted blossoms, cankers and infected twigs, blossom and twig blights are promoted by periods of wet weather",
        "management": "The currently most effective method of controlling brown rot is through the application of appropriate protective fungicides timed so that they are applied when the susceptible flower parts are exposed or after a wet period, avoiding sprinkler irrigation protects the leaves and flowers from wetness that promotes the disease. Cultural control methods include: removing mummified fruit from tree, pruning infected twigs and reducing plant stress by providing adequate levels of water and fertilizer",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 22,
    "fields": {
        "name": "Cherry leaf spot",
        "plant": 3,
        "symptoms": "Small, red purple spots on upper surfaces of leaves which turn brown and may coalesce, leaves may become chlorotic if there are a few lesions present, if tree becomes severely defoliated fruit may fail to develop properly and remain light in color and watery in texture",
        "cause": "Fungus",
        "comments": "Fungus overwinters on infected leaves on the ground, disease development is promoted by warm temperatures and high humidity",
        "management": "Disease can be controlled through applications of appropriate fungicides, Bordeaux mixture is also effective, no cherry varieties are resistant to leaf spot, plant less susceptible varieties if available",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 23,
    "fields": {
        "name": "Powdery mildew",
        "plant": 3,
        "symptoms": "Light colored circular lesions on leaves inside tree canopy which develop a powdery appearance, lesions may coalesce to cover leaf, if infection is severe, leaves may blister and infected shoots may be distorted and stunted, infected fruits may have slightly depressed areas on the surface containing fungal hyphae (filamentous fungal structures)",
        "cause": "Fungus",
        "comments": "Infection of fruit is more likely if there are rainfalls close to harvest",
        "management": "Management of powdery mildew in cherry is reliant on the application of appropriate fungicides and cultural practices which promote good air circulation around tree canopies to lower humidity",
        "image": "cherry_powdery_mildew.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 24,
    "fields": {
        "name": "Rust",
        "plant": 3,
        "symptoms": "Pale yellow green spots on both upper and lower leaf surfaces which are angular in shape and turn bright yellow in color, spots on lower leaf surface develop orange red spores",
        "cause": "Fungus",
        "comments": "Fungus overwinters in twigs or in leaves which remain attached to the tree",
        "management": "Rust can be prevented by spraying trees with protective fungicides, application is usually carried out one, two and three months before harvest in areas prone to early season outbreaks of the disease and after harvest in areas where disease is less problematic or emerges later in the season",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 25,
    "fields": {
        "name": "Silver leaf",
        "plant": 3,
        "symptoms": "Leaves have a silvery appearance, if infection is severe the leaves may curl upwards and become necrotic, death of individual limbs or entire tree may occur, fungal fruiting bodies appear on the surface of the dead bark",
        "cause": "Fungus",
        "comments": "Pathogen is spread via spores released after rainfall during periods of high humidity and can enter trees through pruning wounds, risk of infection is increased if tree is pruned during late winter or early spring, trees also susceptible when they are heavily pruned",
        "management": "Control of silver leaf disease is difficult and infection can be widespread after rainfall in areas where the disease is present, strategies to reduce the incidence of the disease include: removing all plant debris e.g. pruning waste, stumps, and logs, pruning tree during dry periods and treating large pruning wounds with fungicidal dressing",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 26,
    "fields": {
        "name": "Verticillium wilt",
        "plant": 3,
        "symptoms": "Withering of leaves on one or more spurs on 1 year old wood, leaves are dull and stunted, fruit small, older cherry trees do not recover from disease",
        "cause": "Fungus",
        "comments": "Disease is more severe in wet soils",
        "management": "Plant cherry in soil with no history of disease, keep trees adequately fertilized and watered",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 27,
    "fields": {
        "name": "Cherry rasp leaf",
        "plant": 3,
        "symptoms": "Leaf like growths (enations) on underside of leaves near center, symptoms spread from lower parts of tree upwards, defoliation of limbs, decline of tree",
        "cause": "Virus",
        "comments": "Distinguished from PNRSV by the leaves remaining green, virus is transmitted by nematodes and through grafting",
        "management": "Fumigants to control nematodes may control cherry rasp leaf",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 28,
    "fields": {
        "name": "Sour cherry yellows",
        "plant": 3,
        "symptoms": "Chlorotic rings or mottled pattern on newly expanded leaves of sour cherry which become necrotic and may drop out of leaves, giving them a shot hole appearance, leaves that expand after the initial symptoms have become visible display lesser and lesser symptoms, one or more years later leaves on infected trees become yellow with green mottle and drop from tree, fruit yield may be reduced by up to 50%, sweet cherry trees develop chlorotic spots or rings with some shot holes, fruiting spurs decrease in later years as the disease progresses, fruit on infected trees are generally firmer and larger than on uninfected",
        "cause": "Virus",
        "comments": "Virus can infect a wide range of",
        "management": "No control strategies are currently known, always purchase certified, disease free material",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 29,
    "fields": {
        "name": "Crown and root rot",
        "plant": 3,
        "symptoms": "Poor new growth, leaves chlorotic, small in size and sparse, fruit may be small, brightly colored and susceptible to sunburn, shoots may suffer from dieback and tree will often die within weeks or months of first signs of infection or decline gradually over several seasons, root crown may show signs of decay which develops into a canker, bark of infected crown tissue turns dark brown, cankers may occur on aerial parts of plant",
        "cause": "Oomycete",
        "comments": "Symptoms can be similar to those of bacterial infections or mechanical damage, severity of disease is linked to soil moisture content, water saturated soils promote development of disease",
        "management": "Management of phytophthora is reliant on good management of water: cherry trees should be planted in well draining soil to minimize the frequency and duration of water saturated soil, trees should be propagated from resistant rootstock and application of appropriate systemic fungicides may provide some protection from the disease",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 30,
    "fields": {
        "name": "Crown gall",
        "plant": 3,
        "symptoms": "Galls on root and/or crown of tree which can range in size from so small they are not visible to the naked eye up to 10 cm (4 in) in diameter, galls first become visible as white, fleshy swellings that grow rapidly and become tan to brown in color, galls typically develop at the site of a wound and new galls form adjacent to old ones the next year",
        "cause": "Bacterium",
        "comments": "Infection with crown gall begins at the site of plant wounds, disease emergence is favored by poorly drained, alkaline soils and previous feeding damage by nematodes",
        "management": "Chemical control of the disease is generally ineffective, an effective bacterial biological control is available for commercial production, cultural control methods include: planting only certified, disease free material, planting cherry in well draining soil, rotating infected fields with a non host before peach is planted and also using good sanitation practices",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 31,
    "fields": {
        "name": "X disease",
        "plant": 3,
        "symptoms": "Rapid or slow decline of tree depending on rootstock, in hypersensitive rootstocks such as",
        "cause": "Mycoplasma like organism",
        "comments": "Disease is transmitted by cherry leafhoppers",
        "management": "Most practical control method for X disease is to remove infected trees and other plant sources which act as a disease reservoir e.g. chokeberry",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 32,
    "fields": {
        "name": "Aphids (Black cherry aphid)",
        "plant": 3,
        "symptoms": "Small soft bodied insects on underside of leaves and/or stems of plant which are shiny and black in color, if aphid infestation is heavy it may cause leaves to yellow and/or distorted, necrotic spots on leaves and/or stunted shoots, aphids secrete a sticky, sugary substance called honeydew which encourages the growth of sooty mold on the plants",
        "cause": "Insect",
        "comments": "Aphids overwinter as eggs on trees and young nymphs hatch and feed at growing tips, winged aphids will migrate to plants in the mustard family during the summer months",
        "management": "Remove any mustard volunteers growing in proximity to cherry, sturdy plants can be sprayed with a strong jet of water to knock aphids from leaves, insecticides are generally only required to treat aphids if the infestation is very high   plants generally tolerate low and medium level infestation, insecticidal soaps or oils such as neem or canola oil are usually the best method of control, always check the labels of the products for specific usage guidelines prior to use, aphids are best treated when cherry is dormant and insect is at the egg stage, if population has not been controlled by the treatment during dormancy then it should be reapplied at petal fall",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 33,
    "fields": {
        "name": "Peach twig borer",
        "plant": 3,
        "symptoms": "Death of shoot tips, feeding damage to fruit, usually at stem end, larvae are dark brown and white with a black head, adult insect is a gray brown moth",
        "cause": "Insect",
        "comments": "Peach twig borers overwinter as larvae in a specialized cell known as a hibernaculum, overwintering sites are located in rough areas of bark on 1 to 4 year old wood in crotch of limbs",
        "management": "Most effective method of treatment is well timed applications of insecticide around time of bloom, organically acceptable insecticides include",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 34,
    "fields": {
        "name": "Western cherry fruit fly",
        "plant": 3,
        "symptoms": "Fruit mushy and contains a single white maggot, adult insect is a fly with a black body and white bands on the abdomen and a distinctive dark banded pattern on their wings",
        "cause": "Insect",
        "comments": "Western cherry fruit flies are a potentially damaging pest in all western statues of the US, high populations can result in a maggot being found in every single fruit",
        "management": "In commercial cherry plantations, western cherry fruit flies should be monitored using yellow sticky traps, the most effective being one with an ammonium carbonate lure, the insect is a quarantine pest and if a single fruit is found to be infested, treatment is warranted   even if no adults have been found on sticky traps, chemical treatments should be timed to target mature, egg laying females in your particular region, recommended chemicals include spinosad, carbaryl, malathion, and acetamiprid, home growers should also treat trees to help control this damaging pest",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 35,
    "fields": {
        "name": "Spider mites (e.g. Two spotted spider mite)",
        "plant": 3,
        "symptoms": "Leaves stippled with yellow, leaves may appear bronzed, webbing covering leaves, mites may be visible as tiny moving dots on the webs or underside of leaves, best viewed using a hand lens, usually not spotted until there are visible symptoms on the plant, leaves turn yellow and may drop from plant",
        "cause": "Arachnid",
        "comments": "Spider mites thrive in dusty conditions, water stressed plants are more susceptible to attack",
        "management": "In the home garden, spraying plants with a strong jet of water can help reduce buildup of spider mite populations, if mites become problematic apply insecticidal soap tor 1% horticultural oil to plants, certain chemical insecticides may actually increase mite populations by killing off natural enemies and promoting mite reproduction",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 36,
    "fields": {
        "name": "Healthy",
        "plant": 3,
        "symptoms": "The wild cherry tree, Prunus avium, is a perennial tree in the family Rosaceae grown for its fruit, the cherry. Cherry trees have alternating simple oval leaves which often have serrated margins and approximately eight pairs of veins, 5-13 cm (2-5 in) long. The flowers are white and appear in clusters of about 3-5. They appear in early spring and are about one inch long. The fruit is dark red, about half an inch to a full inch, matures in early to mid summer. The bark is gray brown, smooth and glossy and it often peels. Cherry trees can live up to 60 years, growing to a height of over 15 m (50 ft). Cherry may also be referred to as sweet cherry, gean, mazzard or wild cherry and originates from the Caspian Black Sea region and Asia. Sour cherry, Prunus cerasus, is closely related to Prunus avium but with fruit that is more acidic. The tree has twiggy branches with bright red to near black cherries. The tree reaches a height of 4-10 m (13.1-16.4 ft) and is believed to have originated as a natural hybrid of wild cherry (Prunus avium) and ground cherry (Prunus fruticosa) somewhere in the Caucasus Mountains, Turkey or Eastern Europe where the two species' geographic ranges overlap.",
        "cause": "Nil",
        "comments": "Nil",
        "management": "Nil",
        "image": "cherry_healthy.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 37,
    "fields": {
        "name": "Anthracnose",
        "plant": 4,
        "symptoms": "Anthracnose symptoms vary widely depending on numerous factors such as genotype, age of plant and environmental conditions, small oval or elongated water soaked spots which enlarge up to 15 mm long appear on leaves, lesions develop a tan center and red brown or orange border, lesions may coalesce to form large necrotic patches, severely infected leaves on susceptible hybrids may wither and die, fungal fruiting bodies develop on dead tissues and may produce pink or orange spore masses, the fungus may also cause top dieback and stalk rot.",
        "cause": "Fungus",
        "comments": "Fungus overwinters on crop debris, emergence of disease is favored by high temperatures and extended periods of wet and cloudy weather, seedlings and mature plants are most susceptible to the disease.",
        "management": "Plant hybrids resistant to anthracnose, rotating crops and plowing crop debris into soil may help reduce incidence of early season infections.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 38,
    "fields": {
        "name": "Cercospora leaf spot (Gray leaf spot)",
        "plant": 4,
        "symptoms": "Small necrotic spots with chlorotic halos on leaves which expand to rectangular lesions 1 6 cm in length and 2 4 mm wide, as the lesions mature they turn tan in color and finally gray, lesions have sharp, parallel edges and are opaque, disease can develop quickly causing complete blighting of leaves and plant death.\n1. Brown Spots with yellow rings throughout the leaf during the growing period of the Cassava\n2. Lesions that are 0.15 0.2 cm in diameter3. Serious cases can lead to holes throughout the lesions on the leaf",
        "cause": "Fungus",
        "comments": "Disease emergence is favored in areas where a corn crop is followed by more corn with no rotastion, severity and incidence of disease is likely die to continuous corn culture with minimum tillage and the use of susceptible hybrids in in the midwestern corn belt of the USA, prolonged periods of foggy or cloudy weather can cause severe Cercopora epidemics.",
        "management": "Plant corn hybrids with resistance to the disease, crop rotation and plowing debris into soil may reduce levels of inoculum in the soil but may not provide control in areas where the disease is prevalent, foliar fungicides may be economically viable for some high yeilding susceptible hybrids.",
        "image": "corn_gray_leaf_spot.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 39,
    "fields": {
        "name": "Charcoal rot",
        "plant": 4,
        "symptoms": "Symptoms are usually first apparent at the tasseling stage, plant stalks become shredded and pith is completely rotted with stringy strands of vascular tissue left intact, small, black fungal fruiting bodies are visible in the vascular strands and give the tissue a gray coloration, fungus grows into internodes of the stalk causing the plant to ripen early and causing the stalk to weaken, plant may break.",
        "cause": "Fungus",
        "comments": "Emergence of the disease is favored by warm soils with a low moisture content, fungus overwinters in the soil and can also survive on other host plants which include sorghum and soybean.",
        "management": "There are currently no available fungicides to treat the disease, avoid stressing plants by practicing good water management, rotating crops with small grains may help reduce disease incidence.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 40,
    "fields": {
        "name": "Common rust",
        "plant": 4,
        "symptoms": "Oval or elongated cinnamon brown pustules on upper and lower surfaces of leaves, pustules rupture and release powdery red spores, pustules turn dark brown black as they mature and release dark brown powdery spores, if infection is severe, pustules may appear on tassels and ears and leaves may begin to yellow, in partially resistant corn hybrids, symptoms appear as chlorotic or necrotic flecks on the leaves which release little or no spore.",
        "cause": "Fungus",
        "comments": "Disease is spread by wind borne spores, some of the most popularly grown sweet corn varieties have little or no resistance to the disease.",
        "management": "The most effective method of controlling the disease is to plant resistant hybrids, application of appropriate fungicides may provide some degree on control and reduce disease severity, fungicides are most effective when the amount of secondary inoculum is still low, generally when plants only have a few rust pustules per leaf.",
        "image": "corn_common_rust.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 41,
    "fields": {
        "name": "Common smut (Boil smut, Blister smut)",
        "plant": 4,
        "symptoms": "Tumor like galls on plant tissues which are initially green white or silvery white in color, interior of galls darken and turn into masses of powdery dark brown or black spores (with the exception of galls on leaves which remain greenish in color), galls may reach up to 15 cm in diameter and are common on ears, tassels, shoots or midrib of leaves, galls on leaves remain small and do not burst open.",
        "cause": "Fungus",
        "comments": "Fungus overwinters on crop debris or in the soil and can survive for several years, fungus usually enters the plant through wounds, application of nitrogen fertilizer increases incidence of disease, while application of phosphorous fertilizer decreases infection.",
        "management": "Although many practices may be recommended for the control of common smut, the only method that is completely effective is to grow resistant corn hybrids.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 42,
    "fields": {
        "name": "Downy Mildew disease",
        "plant": 4,
        "symptoms": "Symptoms of all maize downy mildew pathogens are similar although may vary depends on cultivar, age and climate. The disease appear as early from two weeks after sowing resulting in chlorosis and stunting. In older plants the leaves shows mottling, chlorotic streaking and lesions and white striped leaves. Usually the leaves are narrower and more erect when compare to healthy plants and are covered with a white, downy growth on both surfaces.",
        "cause": "Fungus",
        "comments": "The disease is both air and seed born. The pathogen have several alternative hosts.",
        "management": "Grow available resistant varieties and hybrids. Follow crop rotation with non host crops. Use suitable systemic fungicide for both seed treatment and foliar spray. Keep the fields free from weeds. Drying seeds before sowing reduces the disease incidence.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 43,
    "fields": {
        "name": "Giberrella stalk and ear rot",
        "plant": 4,
        "symptoms": "Plants wilting and leaves changing color from light to dull green, lower stalk turns straw yellow, internal stalk tissue breaks down, interior of stalk has a red discoloration, black fungal fruiting bodies may be visible on the stalk, often at internodes, and can be easily scraped off, if fungal infection affects the ears, it produces a red mold at the tips of the ear which spreads down, early infection may result in the ear being covered in pink mycelium which causes the corn husk to adhere to the ear.",
        "cause": "Fungus",
        "comments": "Fungus can enter through wounds to stalk or ear, ear rot is caused by the fungus infecting silks and moving down through the ear, fungus survives on corn debris in soil and on debris of other host plants such as wheat.",
        "management": "Stressed plants are more susceptible to Gibberella   providing adequate fertilization and irrigation can help reduce incidence of disease, control insects, especially stem and ear borers, hybrids differ in their susceptibility to the disease and further information is required in order to develop specific control measures.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 44,
    "fields": {
        "name": "Northern Leaf Blight",
        "plant": 4,
        "symptoms": "In the beginning we will notice elliptical gray green lesions on leaves. As the disease process this lesions become pale gray to tan color. Later stage the lesions looks dirty due to dark gray spores particularly under lower leaf surface. The disease can be easily identified in the field due to its long, narrow lesions which are unrestricted by veins.",
        "cause": "Fungus",
        "comments": "The disease mainly spread through rain splash and wind.",
        "management": "Follow proper tillage to reduce fungus inoculum from crop debris. Follow crop rotation with non host crop. Grow available resistant varieties. In severe case of disease incidence apply suitable fungicide.",
        "image": "corn_northern_leaf_blight.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 45,
    "fields": {
        "name": "Southern corn leaf blight",
        "plant": 4,
        "symptoms": "Foliar symptoms vary with hybrid and different fungal isolate, lesions on leaves may be tan and elongated and run between leaf veins, lesions may have a buff or brown colored margin, another race of the fungus causes tan, spindle shaped or elliptical lesions with a water soaked margin that turns into a yellow halo.",
        "cause": "Fungus",
        "comments": "Fungus overwinters in corn debris in soil, disease occurs worldwide but is emergence favors areas with a warm, damp climate.",
        "management": "The most effective method of controlling the disease is to plant resistant hybrids, cultural control methods include plowing crop debris into soil after harvest and rotating crops.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 46,
    "fields": {
        "name": "Bacterial leaf blight/stripe",
        "plant": 4,
        "symptoms": "Water soaked linear lesions on leaves as they emerge, lesions turn brown and may subsequently turn gray or white, lesions may have a red border, after the leaves are mature, lesions do not tend to extend any further, no new lesions tend to appear after tasseling, if corn variety is susceptible, mature leaves may shred after maturity.",
        "cause": "Bacterium",
        "comments": "Bacteria can also cause disease in oats, barley, wheat, some millets and sorghum.",
        "management": "Resistant hybrids should be planted in areas where the disease is prevalent, plowing crop debris into soil and rotating crop may not be effective at controlling the disease due to its extensive host range.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 47,
    "fields": {
        "name": "Bacterial Leaf Streak disease",
        "plant": 4,
        "symptoms": "The infected leaves initially shows narrow stripes between the veins. The initial symptoms are generally confused with gray leaf spot disease. But the lesions from bacteria appear brown, orange, and/or yellow when you infected leaves are back lit. Also in Bacterial Leaf Streak disease the lesions show slightly wavy edges when compared to the smooth, linear lesion margins of gray leaf spot.",
        "cause": "Bacterium",
        "comments": "The bacteria causes gumming disease on sugarcane in several part of the world. First reported on corn in South Africa. Currently this disease is reported in Nebraska (Aug. 26, 2016), Colorado, Illinois, Iowa, and Kansas on corn.",
        "management": "Use healthy and disease free seeds. Remove the infected plant debris and burn them. Follow crop rotation.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 48,
    "fields": {
        "name": "Bacterial stalk rot/soft rot",
        "plant": 4,
        "symptoms": "Plants suddenly beginning to lodge (bend to lie along the ground) midway through season, one or more internodes above soil line turning brown, water soaked, soft and slimy, tissue has foul odor and mushy appearance,",
        "cause": "Bacterium",
        "comments": "Disease is most commonly found in plantations which have overhead irrigation systems or in areas with high rainfall, disease emergence is favored by high temperatures and high humidity.",
        "management": "Plow all crop debris into soil in Fall, plant corn in well draining soil to prevent waterlogged plants.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 49,
    "fields": {
        "name": "Goss's bacterial blight",
        "plant": 4,
        "symptoms": "Gray or yellow stripes with irregular margins on leaf surfaces, stripes follow leaf veins and contain characteristic dark green to black water soaked spots, if infection occurs early then plant may become wilted or withered, it is common to find a crystalline residue on leaves caused by dried bacterial exudate.",
        "cause": "Bacteria",
        "comments": "Disease overwinters in diseased crop debris on, or close to, the soil surface, temperatures below 12--C (53.6--F) and above 40--C (104--F) bacterium grows more slowly and may even be killed off.",
        "management": "Plant resistant sweetcorn hybrids, rotate crop, plow crop debris into soil immediately after harvest.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 50,
    "fields": {
        "name": "Holcus spot",
        "plant": 4,
        "symptoms": "Circular or elliptical spots 2 10 mm across near the tips of lower leaves which are dark green and water soaked initially but become cream to tan before turning dry and brown, lesions may have red brown margins, large lesions may have a yellow halo.",
        "cause": "Bacterium",
        "comments": "Disease can occur anywhere where corn is grown but is not usually very damaging.",
        "management": "Disease is usually not severe but if it does become a problem crops should be rotated and any debris should be plowed into the soil after harvest.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 51,
    "fields": {
        "name": "Stewart---s wilt",
        "plant": 4,
        "symptoms": "The main symptoms are appearance of water soaked lesions initially. As the disease progress the lesions become long and turn pale yellow with irregular margins running in the length. The pathogen may infect the stem and causes stunting, wilting and death of plant.",
        "cause": "Bacterium",
        "comments": "The pathogen is mainly transmitted by maize flea beetles and to lesser extent by infected seeds.",
        "management": "Grow available resistant varieties. Use certified healthy seeds. Remove the crop debris and burn them. Use suitable insecticide to control flea beetle.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 52,
    "fields": {
        "name": "Maize dwarf mosaic",
        "plant": 4,
        "symptoms": "Chlorotic spots and streaks on leaves which develop into a mottled or mosaic pattern, susceptible plants may be stunted, ear formation and development cease, mosaic and mottling with no red discoloration are characteristic symptoms of the disease.",
        "cause": "Virus",
        "comments": "Virus is transmitted by more than 15 different species of aphid and is passed to the plant from the insect in seconds to minutes of feeding, sorghum is also a major host of the virus.",
        "management": "Many commercial corn hybrids are highly tolerant of the disease and no control is needed, control aphid populations on plants and remove any Johnson grass growing in the vicinity as it can act as a reservoir for the virus.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 53,
    "fields": {
        "name": "Maize Lethal Necrosis Disease (MLND) or Corn Lethal Necrosis (CLN)",
        "plant": 4,
        "symptoms": "The disease occurs at all stages of crop. The main symptoms includes appearance of chlorotic mottling on leaves which starts from base and extends upwards. Also the leaves shows necrosis at margins which later extends to mid rib and results in drying of entire leaf. The necrosis of young leaves in the whorl causes dead heart symptom. Other symptoms are premature plant death, shortened male inflorescences with few spikes, and/or shortened, malformed, partially filled ears.",
        "cause": "Virus",
        "comments": "The virus mainly spread by vectors (maize thrips, aphids, rootworms and leaf beetles) and infected seeds. The first report of this disease in Africa continent was in Kenya (2011). And later the disease spreads to other countries like Tanzania, Uganda and South Sudan.",
        "management": "Use healthy, disease free certified seeds. Keep the fields free from weeds. Remove the infected plants and burn them. Control vectors by treating seed and/ foliar spray with suitable insecticide. Follow crop rotation with non cereals at least for two seasons. Plant maize only in main rainy season instead of short rainy season. Grow available resistant varieties.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 54,
    "fields": {
        "name": "Pythium root rot",
        "plant": 4,
        "symptoms": "Above ground, plants may be yellow and stunted, roots have obvious lesions and roots are discolored, root cortex will come away when pulled gently, exposing the white stele, can also cause damping off of seedlings.",
        "cause": "Fungus",
        "comments": "Fungus overwinters in soil and crop debris, disease emergence is favored by high soil moisture and low temperatures leading to low soil oxygen levels.",
        "management": "Control of the disease relies on improving soil drainage or planting corn in areas where the soil is well draining, systemic fungicides can be used to treat seed prior to planting to protect seedlings from disease.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 55,
    "fields": {
        "name": "Slugs",
        "plant": 4,
        "symptoms": "Irregularly shaped holes in leaves and stems, leaves may be shredded, slime trails present on rocks, walkways, soil and plant foliage, several slug species are common garden and field pests, slugs are dark gray to black in color and can range in size from 2.5 to 10 cm (1 4 in).",
        "cause": "Mollusc",
        "comments": "Slugs prefer moist, shaded habitats and will shelter in weeds or organic trash, adults may deposit eggs in the soil throughout the season, damage to plants can be extensive.",
        "management": "Practice good garden sanitation by removing garden trash, weeds and plant debris to promote good air circulation and reduce moist habitat for slugs and snails, handpick slugs at night to decrease population, spread wood ashes or eggshells around plants, attract molluscs by leaving out organic matter such as lettuce or grapefruit skins, destroy any found feeding on lure, sink shallow dishes filled with beer into the soil to attract and drown the molluscs, chemical controls include ferrous phosphate for organic gardens and metaldehyde (e.g. Buggeta) and carbaryl (e.g Sevin bait) for non organic growers.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 56,
    "fields": {
        "name": "Aphids (Corn leaf aphid, Peach Aphid)",
        "plant": 4,
        "symptoms": "Heavy infestations can result in curled leaves and stunted plants, honeydew secretions promote growth of sooty mold, corn leaf aphids are blue green in color, peach aphids are green yellow in color, aphids may transmit viruses when feeding.",
        "cause": "Insects",
        "comments": "Grassy weeds also serve as hosts for corn leaf aphids, peach aphids have a wide host range.",
        "management": "It is rare for aphids to reach levels that are damaging to the plant and no control is generally warranted as insecticide sprays will not prevent transmission of viruses.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 57,
    "fields": {
        "name": "Corn earworm",
        "plant": 4,
        "symptoms": "Feeding damage to leaves, tassel and leaf whorls, preferred feeding site is the ear and insect produces extensive excrement at the tip of the ear, younger larvae feed on silks, severing them from the plant, young caterpillars are cream white in color with a black head and black hairs, older larvae may be yellow green to almost black in color with fine white lines along their body and black spots at the base of hairs, eggs are laid singly on both upper and lower leaf surfaces and are initially creamy white but develop a brown red ring after 24 hours and darken prior to hatching.",
        "cause": "Insect",
        "comments": "Adult insect is a pale green to tan, medium sized moth, can be a very damaging pests ofcorn, insect overwinters as pupae in the soil.",
        "management": "Corn earworms are most problematic on sweet corn varieties and treatment should be applied at egg hatch, monitor plants for eggs and young larvae and also natural enemies that could be damaged by chemicals, Bacillus thuringiensis or Entrust SC may be applied to control insects on organically grown plants, appropriate chemical treatment may be required for control in commercial plantations.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 58,
    "fields": {
        "name": "Cutworms (Black cutworm, Variegated cutworm)",
        "plant": 4,
        "symptoms": "Stems of young transplants or seedlings may be severed at soil line, if infection occurs later, irregular holes are eaten into the surface of fruits, larvae causing the damage are usually active at night and hide during the day in the soil at the base of the plants or in plant debris of toppled plant, larvae are 2.5---5.0 cm (1---2 in) in length, larvae may exhibit a variety of patterns and coloration but will usually curl up into a C shape when disturbed.",
        "cause": "Insects",
        "comments": "Cutworms have a wide host range and attack vegetables including asparagus, bean, cabbage and other crucifers, carrot, celery, corn, lettuce, pea, pepper, potato and tomato.",
        "management": "Remove all plant residue from soil after harvest or at least two weeks before planting, this is especially important if the previous crop was another host such as alfalfa, beans or a leguminous cover crop, plastic or foil collars fitted around plant stems to cover the bottom 3 inches above the soil line and extending a couple of inches into the soil can prevent larvae severing plants, hand pick larvae after dark, spread diatomaceous earth around the base of the plants (this creates a sharp barrier that will cut the insects if they try and crawl over it), apply appropriate insecticides to infested areas of garden or field if not growing organically.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 59,
    "fields": {
        "name": "Fall armyworm",
        "plant": 4,
        "symptoms": "Singular, or closely grouped circular to irregularly shaped holes in foliage, heavy feeding by young larvae leads to skeletonized leaves, shallow, dry wounds on fruit, egg clusters of 50 150 eggs may be present on the leaves, egg clusters are covered in a whitish scale which gives the cluster a cottony or fuzzy appearance, young larvae are pale green to yellow in color while older larvae are generally darker green with a dark and light line running along the side of their body and a pink or yellow underside.\n1. Leaf damage is usually characterized by ragged feeding, and moist sawdust like frass near the funnels and upper leaves of the plant.\n\n2. Leaf damage is usually scattered in rows across the leaf\n\n3. Younger larvae usually eat tissue from one side, leaving the other side in tact. This is what creates windows in the leaf\n\n4. Deep feeding may may destroy maize tassels.\n\n5. Caterpillars enter through the side of the ear and feed on developing kernels",
        "cause": "Insects",
        "comments": "Insect can go through 3---5 generations a year.",
        "management": "Organic methods of controlling the armyworm include biological control by natural enemies which parasitize the larvae and the application of Bacillus thuringiensis, there are chemicals available for commercial control but many that are available for the home garden do not provide adequate control of the larvae.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 60,
    "fields": {
        "name": "Flea beetles",
        "plant": 4,
        "symptoms": "Small holes or pits in leaves that give the foliage a characteristic ---shothole--- appearance, young plants and seedlings are particularly susceptible, plant growth may be reduced, if damage is severe the plant may be killed, the pest responsible for the damage is a small (1.5---3.0 mm) dark colored beetle which jumps when disturbed, the beetles are often shiny in appearance.",
        "cause": "Insects",
        "comments": "Flea beetles may overwinter on nearby weed species, in plant debris or in the soil, insects may go through a second or third generation in one year.",
        "management": "In areas where flea beetles are a problem, floating row covers may have to be used prior to the emergence of the beetles to provide a physical barrier to protect young plants, plant seeds early to allow establishment before the beetles become a problem   mature plants are less susceptible to damage, trap crops may provide a measure of control   cruciferous plants are best, application of a thick layer of mulch may help prevent beetles reaching surface, application on diamotecoeus earth or oils such as neem oil are effective control methods for organic growers, application of insecticides containing carbaryl, spinosad, bifenthrin and permethrin can provide adequate control of beetles for up to a week but will need reapplied.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 61,
    "fields": {
        "name": "Thrips (Various spp.)",
        "plant": 4,
        "symptoms": "If population is high leaves and may be distorted and curl upwards, edges of leaves may dry up and are speckled with black feces, insects are small (1.5 mm) and slender and best viewed using a hand lens, adult thrips are pale yellow to light brown and the nymphs are smaller and lighter in color.",
        "cause": "Insects",
        "comments": "May be found on corn at any time during the growing season.",
        "management": "Avoid planting next to onions, garlic where very large numbers of thrips can build up, use reflective mulches early in growing season to deter thrips, apply appropriate insecticide if thrips become problematic, young plants will recover from damage and treatment is not often necessary as the thrips are beneficial for controlling mites.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 62,
    "fields": {
        "name": "Root knot nematode",
        "plant": 4,
        "symptoms": "Below ground we can see galls on the roots due to female nematode feeding. Above ground the plants are stunted, yellow and patchy in growth. Severely infested plant may die before harvest.",
        "cause": "Nematode",
        "comments": "The galls are formed by female nematode feeding resulting in formation of giant cells.",
        "management": "Deep summer ploughing helps in reducing nematode population. Follow crop rotation with nematode antagonistic plants. Grow resistant varieties. In severely infected field follow soil fumigation with suitable nematicide.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 63,
    "fields": {
        "name": "Spider mites (Various spp.)",
        "plant": 4,
        "symptoms": "Leaves stippled with yellow, leaves may appear bronzed, webbing on underside of leaves, small kernel size, mites may be visible as tiny moving dots on the webs or underside of leaves, best viewed using a hand lens, usually not spotted until there are visible symptoms on the plant, leaves turn yellow and may drop from plant,",
        "cause": "Arachnid",
        "comments": "Spider mites thrive in dusty conditions, water stressed plants are more susceptible to attack.",
        "management": "In the home garden, spraying plants with a strong jet of water can help reduce buildup of spider mite populations, if mites become problematic apply insecticidal soap to plants, certain chemical insecticides may actually increase mite populations by killing off natural enemies and promoting mite reproduction.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 64,
    "fields": {
        "name": "Healthy",
        "plant": 4,
        "symptoms": "Corn, Zea mays, is an annual grass in the family Poaceae and is a staple food crop grown all over the world. The corn plant possesses a simple stem of nodes and internodes. A pair of large leaves extends off of each internode and the leaves total 8-21 per plant. The leaves are linear or lanceolate (lance like) with an obvious midrib and can grow from 30 to 100 cm (11.8-39.4 in) in length. The male and female inflorescences (flower bearing region of the plant) are positioned separately on the plant. The male inflorescence is known as the 'tassel' while the female inflorescence is the 'ear'. The ear of the corn is a modified spike and there may be 1-3 per plant. The corn grains, or 'kernels', are encased in husks and total 30-1000 per ear. The kernels can be white, yellow, red, purple or black in color. Corn is an annual plant, surviving for only one growing season prior to harvest and can reach 2-3 m (7-10 ft) in height. Corn may also be referred to as maize or Indian corn and is believed to originate from Mexico and Central America.",
        "cause": "Nil",
        "comments": "Nil",
        "management": "Nil",
        "image": "corn_healthy.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 65,
    "fields": {
        "name": "Anthracnose (Bird---s eye rot)",
        "plant": 5,
        "symptoms": "Dark red lesions on grapes, sunken gray lesions with a darker edge on grapes, lesions on the leaves causing leaf to curl, lesions on shoots may cause a ring of damage which will kill parts of the plant, lesions may also be present on tendrils, fruit stems, and leaf stems",
        "cause": "Fungus",
        "comments": "Disease favors warm weather",
        "management": "Plant less susceptible cultivars, application of Bordeaux mixture or other appropriate fungicide while vines are dormant may be necessary",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 66,
    "fields": {
        "name": "Armillaria root rot",
        "plant": 5,
        "symptoms": "Weak, short shoots, white fungal mats under the bark at the soil line, unproductive vines, rapid wilting",
        "cause": "Fungus",
        "comments": "No known Armillaria resistant grape varieties",
        "management": "Fumigation may be necessary in soils known or suspected to have carried the disease",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 67,
    "fields": {
        "name": "Botrytis bunch rot (Gray mold)",
        "plant": 5,
        "symptoms": "Brown lesions on the stem early in the season, grapes covered with a gray to tan powder, stems and grape clusters shrivel",
        "cause": "Fungus",
        "comments": "Disease favors high levels of moisture and high temperatures.",
        "management": "Plant less susceptible varieties, reduce amount of vegetative growth on vines, do not over fertilize, use suitable trellises to increase air circulation in canopy and expose grape clusters to sun, disease usually merits chemical control",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 68,
    "fields": {
        "name": "Dieback (Eutypa dieback.)",
        "plant": 5,
        "symptoms": "Stunted, withered leaves curled into a cup shape, dark cankers on wood, cross section of wood reveals wedge shaped discoloration",
        "cause": "Fungus",
        "comments": "Affects older vines that are five to six years old",
        "management": "No resistant varieties known, disease practically impossible to control without chemicals in areas where alternative hosts are available, use of an appropriate fungicide on pruning wounds can prevent the fungus from entering the plant, fungicide should be applied at time of pruning",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 69,
    "fields": {
        "name": "Esca (Black Measles or Spanish Measles)",
        "plant": 5,
        "symptoms": "Symptom appears on leaves, trunk, canes and berries. On leaves we will see intervenaial striping looks like tiger strips. White cultivars shows chlorotic and necrotic strips where as red cultivars shows red areas and necrotic strips.\n\nOn berries we will see superficial spots and later may coalesce making berries appear black. Trunk/arm/cordons shows dark brown black vascular streaking and oozes dark sap when we cut trunk. Some time this measles in associate with numerous secondary wood rotting fungi which decorate the vineyard completely.",
        "cause": "Fungus",
        "comments": "The leaf and berry symptoms may occur together in single cane or may show symptom on only one parts. The severe infestation of measles kill grapevine in a single year which is commonly called apoplexy. \n\nThe symptoms are common in 5 to 7 year old vineyard. The prune wounds helps in pathogen entrance and establishment.",
        "management": "Till date there is no effective method to control this disease. Remove the infected berries, leaves and trunk and destroy them. Protect the prune wounds to minimize fungal infection using wound sealant (5% boric acid in acrylic paint) or essential oil or suitable fungicides.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 70,
    "fields": {
        "name": "Leaf blight (Isariopsis Leaf Spot)",
        "plant": 5,
        "symptoms": "On leaf surface we will see lesions which are  irregularly shaped (2 to 25 mm in diameter). Initially lesions are dull red to brown in color turn black later. If disease is severe this lesions may coalesce.  On berries we can see symptom similar to black rot but the entire clusters will collapse.",
        "cause": "Fungus",
        "comments": "Common in tropical and subtropical grapes. The disease appear late in the season. Cynthiana and Cabernet Sauvignon are susceptible to this pathogen.",
        "management": "Fungicides sprayed for other diseases in the season may help to reduce this disease.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 71,
    "fields": {
        "name": "Leaf spot (Phomopsis cane)",
        "plant": 5,
        "symptoms": "Dark lesions with yellow edges on canes and leaves, canes appear bleached and may have dark discoloration, small distorted leaves, lesions in shoots cause cracking",
        "cause": "Fungus",
        "comments": "Disease emergence favorable with rain directly following budbreak",
        "management": "Use pathogens free planting material, if disease is present prune out dead and infected wood and plow under soil, apply an appropriate fungicide",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 72,
    "fields": {
        "name": "Powdery mildew",
        "plant": 5,
        "symptoms": "Red patches on canes, yellow patches on top surface of leaves, white powdery growth on leaves, white powdery growth on fruit",
        "cause": "Fungus",
        "comments": "Disease favors mild temperatures and high humidity",
        "management": "Plant vines in sites with good air circulation and sun exposure, use a training system that promotes air circulation through the canopy, apply sulfur or copper based fungicide",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 73,
    "fields": {
        "name": "Black rot",
        "plant": 5,
        "symptoms": "Brown lesions on the leaves that develop black dots (pycnidia), grapes have light spots that eventually form pycnidia, grapes harden and turn black, while still remaining on the vine",
        "cause": "Fungus",
        "comments": "Disease favors rainy weather, spores may ooze out during rain",
        "management": "Remove all mummified fruit from vines during dormant pruning, cultivate soil during bud break to bury mummies and reduce inoculant, application of appropriate fungicides can help control the disease",
        "image": "grape_black_rot.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 74,
    "fields": {
        "name": "Crown gall",
        "plant": 5,
        "symptoms": "Galls on vines, wilting and yellowing of canopy, drying grapes, collpsing plants",
        "cause": "Bacterium",
        "comments": "Bacteria enter via wounded areas, spread from infected rootstock",
        "management": "Sanitize all equipment regularly, avoid injuring plants, plant disease free stock, heat treatment of planting material can help eliminate pathogens prior to planting",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 75,
    "fields": {
        "name": "Pierce's disease",
        "plant": 5,
        "symptoms": "Yellow to red leaf edges, dry leaves with leaf death in concentric rings, leaves dropping but petiole remaining attached to vine, fruit dry and shriveled",
        "cause": "Bacteria",
        "comments": "Disease transmitted by sharpshooters and spittlebugs",
        "management": "Application of appropriate insecticide in areas adjacent to plantation can help reduce the number of sharpshooters reaching vines in spring, remove symptomatic vines while dormant, monitor vines with mild symptoms and remove when symptoms become pronounced",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 76,
    "fields": {
        "name": "Young vine decline",
        "plant": 5,
        "symptoms": "Small yellow spots between leaf veins, leaves dropping, round brown or purple lesions on fruit, dry cracked fruit",
        "cause": "Fungi",
        "comments": "Fungus can enter the plant through propagation wounds",
        "management": "Avoid stressing vines, provide adequate irrigation and do not over fertilize, do not harvest fruit until vines are at least 3 years old",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 77,
    "fields": {
        "name": "Black vine weevil",
        "plant": 5,
        "symptoms": "Feeding damage to stems, leaves, buds and/or flowers, loss of plant vigor",
        "cause": "Insect",
        "comments": "Larvae live in soil and feed on roots",
        "management": "Consider growing a cover crop such as red fescue",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 78,
    "fields": {
        "name": "Grape cane girdler",
        "plant": 5,
        "symptoms": "Holes encircling cane, punctures in cane",
        "cause": "Insect",
        "comments": "Greatest injury to vines during establishment",
        "management": "Prune out infested shoots below girdle before adult insects emerge in summer, spraying me be required to control adult populations",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 79,
    "fields": {
        "name": "Grape mealybug",
        "plant": 5,
        "symptoms": "Sooty mold growing on fruit",
        "cause": "Insect",
        "comments": "Sporadic pest, sugary secretions by the insect drop onto fruit and encourage growth of mold",
        "management": "Control ant populations to encourage populations of mealybug natural enemies, apply appropriate insecticide",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 80,
    "fields": {
        "name": "Japanese beetle",
        "plant": 5,
        "symptoms": "Leaves skeletonized (only veins remaining), flowers and buds damaged, plant damage may be extensive, adult insect is a metallic green bronze beetle with tufts of white hair protruding from under wing covers on each side of the body, adult beetles are approximately 13 mm in length, larvae are cream white grubs which develop in the soil",
        "cause": "Insect",
        "comments": "One beetle generation every 1 2 years, pheromone traps may actually attract more beetles to home gardens and should generally be avoided, beetle overwinters as larvae in soil, beetle has an extensive range of over 300 host plants",
        "management": "If beetles were a problem in the previous year, use floating row covers to protect plants or spray kaolin clay, adult beetles can be hand picked from plants and destroyed by placing in soapy water, parasitic nematodes can be applied to soil to reduce the number of overwintering grubs, insecticidal soaps or neem oil can help reduce beetle populations",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 81,
    "fields": {
        "name": "Healthy",
        "plant": 5,
        "symptoms": "The Common or European grapevine (Vitis vinifera) is a long stemmed, woody vine (liana) which produces high value berries, or grapes. The vines can reach lengths in excess of 30 m and can live for many years with proper management. The leaves of the grape vine are alternately arranged on the stem and are long and broad with 5-7 lobes, typically reaching sizes of 5-20 cm (2.0-7.9 in). Flowers are produced in clusters and fruit. The fruit is a berry known as a grape and grows in clusters from the vine. In wild species, the fruit is 6 mm (1/5 in) in diameter and ripens to dark purple to black with a pale wax bloom. In cultivated plants, the berry is usually much larger, up to 3 cm (1.2 in) long and can be green, red or purple. Vitis vinifera is native to the Mediterranean region, central Europe, and southwestern Asia but is cultivated on every continent except Antarctica. Most grape cultivation centers on the use of Vitis vinifera, however, in North America the related species Vitis labrusca, Vitis riparia and Vitis rotundifolia are also grown. Vitis amurensis is native to Asia and has been hybridized with Vitis vinifera to produce cold tolerant grapevine varieties. ",
        "cause": "Nil",
        "comments": "Nil",
        "management": "Nil",
        "image": "grape_healthy.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 82,
    "fields": {
        "name": "Anthracnose",
        "plant": 6,
        "symptoms": "Leaves dropping prematurely, leaves covered in dark fungal spores, red to green or black streaks on the mature fruits",
        "cause": "Fungus",
        "comments": "Disease common during wet Springs or long periods of wet weather late in season",
        "management": "If disease is damaging then appropriate fungicides should be applied to whole tree",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 83,
    "fields": {
        "name": "Armillaria root rot (Mushroom root rot)",
        "plant": 6,
        "symptoms": "Trees may wilt suddenly and collapse or decline slowly, leaves become chlorotic and drop from tree, if large parts of root are destroyed then whole canopy is affected, trunk may have area of rotting bark at the base, lesions on the trunk resemble Phytophthora gummosis, clusters of mushrooms may be present at the bottom of the tree and fan shaped mycelial mats are often present between the bark and the wood",
        "cause": "Fungus",
        "comments": "Healthy trees are usually infected by infected pieces of wood or tree stumps which have been left in the ground after an orchard is cleared",
        "management": "Disease is difficult to control once it becomes established in an orchard, affected trees showing signs of decline should be removed along with as much of the roots system as possible, area where infected tree was should not be replanted with health citrus for a period of at least one year, fumigating soil can help to reduce soil inoculum but is not always completely effective",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 84,
    "fields": {
        "name": "Black root rot",
        "plant": 6,
        "symptoms": "Small brown black lesions on roots which may coalesce and turn entire root black, root cortex may slough off to reveal the vascular tissue below, leaves of plant may be chlorotic",
        "cause": "Fungus",
        "comments": "Serious disease of glasshouse grown citrus trees, pathogen usually drops to non damaging levels after tree is transplanted to the field",
        "management": "Keep glasshouses well lit and warm during winter to encourage vigorous root growth, use good quality potting soil which provides goo aeration",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 85,
    "fields": {
        "name": "Blast",
        "plant": 6,
        "symptoms": "Water soaked or black lesions on leaf petioles,which rapidly expand along the leif midrib, cankers on twigs and branches, twigs may be girdles and die, leaves turning black and dying, black lesions may be present on fruit",
        "cause": "Bacterium",
        "comments": "Symptoms most severe on south facing side of tree exposed to winds",
        "management": "In areas where disease is severe, copper fungicides should be applied in Fall and WInter prior to the first rains",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 86,
    "fields": {
        "name": "Brown rot",
        "plant": 6,
        "symptoms": "Water soaked lesions on fruit close to maturation, leather tan to dark brown lesions on fruit, lesions with a pungent smell, leaves, twigs and flowers may be turning brown",
        "cause": "Oomycete",
        "comments": "Disease emergence favored by cool, wet conditions",
        "management": "Cultural control methods should focus on reducing leaf wetness e.g. mowing around trees to prevent grasses growing too long, proper irrigation management, pruning branches hanging low to the ground etc., if fruit become infected, harvest should be delayed to allow all infected fruit to drop to the ground and minimizing contamination in the harvest, applications of copper fungicides to foliage can help protect the trees",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 87,
    "fields": {
        "name": "Melanose",
        "plant": 6,
        "symptoms": "Small brown sunken spots which become raised and surrounded by a yellow halo, lesions eventually turn corky in texture, severe infections can cause newly emerging leaves to be crinkled and distorted, if infection of fruit occurs soon after petal fall, the pathogen causes large lesions on the fruit surface which may coalesce to produce large patches, late infection of fruit causes discrete pustules on the fruit",
        "cause": "Fungus",
        "comments": "Disease is spread short distance through splashing water or over longer distances by wind",
        "management": "If young trees become infected, it is possible to control the disease by pruning but this is not usually feasible for older trees, fungicides must be applied frequently in order to control the disease",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 88,
    "fields": {
        "name": "Citrus canker",
        "plant": 6,
        "symptoms": "Raised lesions on leaves, often at leaf margin or tip, lesions may also be present on twigs and fruits, young lesions are usually surrounded by yellow halo, depressed brown craters formed from collapse of lesions",
        "cause": "Bacterium",
        "comments": "Bacteria survive in lesions, the main method of spread is via wind driven rain, bacteria may enter through pruning wounds",
        "management": "If the disease is introduced to an area, all infected trees should be removed and destroyed, in areas where disease is endemic, windbreaks can help to reduce disease severity, cultural control of the disease should focus on controlling leaf miner populations, utilizing wind breaks and applications of copper sprays",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 89,
    "fields": {
        "name": "Huanglongbing (Citrus greening)",
        "plant": 6,
        "symptoms": "Leaf symptoms of citrus greening include yellowing of one limb or one area of canopy, yellowing of leaf veins, blotchy mottling and/or green islands (spots) surrounded by completely yellow leaf tissue, twig and limbs begin to die back, fruits may drop prematurely and are often mishappen and lopsided, fruit has a bitter, salty taste",
        "cause": "Bacteria",
        "comments": "History\nOrigins and spread\n\nHuanglongbing, or citrus greening, was first reported from Southern China in 1919 by American botanist Otto August Reinking who described a ---yellow shoot--- disease of citrus while evaluating diseases of economic plants in Southern China. A subsequent field survey conducted between 1941 and 1955 on citrus plants in the provinces of Guangdong, Fujian and Jiangx by Chinese plant pathologist Lin Kongxiang (Kung Hsiang) determined that that the disease likely originated in Chaozhou county in Guangdong as early as the 1870s. Lin adopted the name the local farmers had given to the disease of ---huang long bing---, which translates to ---yellow dragon disease---, a reference to the yellow coloration of new shoots on the infected trees. By 1936 Huanglongbing was considered a serious disease of citrus in China and it subsequently spread across Southeast Asia reaching Indonesia in 1948 and Taiwan in 1950 before spreading to the Philippines, Thailand and Malaysia in the 1950s, 60s and 70s respectively. The disease has been known by various names in different countries   ---greening--- in South Africa, ---mottle leaf--- in the Philippines, ---dieback--- in India and ---vein phloem degeneration--- in Indonesia   but in 1995 the disease was officially named Huanglongbing by the International Organization of Citrus Virologists (IOCV) and this name is now widely used to describe the disease in Africa, America and Asia. \n\n\n\nBiology and ecology\n\nThe organism that causes Huanglongbing is a Gram negative bacterium that is limited to the plant phloem   the plant system responsible for the delivery of sugars from the leaves to the growing parts of the plant. The bacteria involved have so far not been isolated and cultured but the disease is believed to be caused by bacteria belonging to the genus Candidatus Liberibacter. It is believed that there are at least two different forms of the disease, an African heat sensitive form, L. africanus which survives in cool areas with temperatures below 30 32 C, and an Asian heat tolerant form which occurs in areas where temperatures greatly exceed 30C. A third species, L. asiaticus, found in .A third species, L. americanus was detected in citrus trees in Sao Paulo, Brazil but there is presently little information on its climatic requirements. As this species is found in the same areas as L. asiaticus it seems likely that is has similar requirements. \n\n\n\nTransmission\n\nHuanglongbing can be transmitted by citrus psyllids or by grafting. The Asian citrus psyllid, Diaphorina citri is responsible for the spread of the disease in Asia and Oceania, Brazil and North America whereas the African citrus psyllid, Trioza erytreae is the main vector in Africa and Madagascar. Both psyllid species are present the Indian Ocean islands of Reunion and Mauritius,\n\n\n\nCitrus psyllids\n\nCitrus psyllids are tiny (3 4 mm) sap sucking insects that excrete a sticky, sugary substance called honeydew. Both the Asian and African citrus psyllids are mottled brown in color but the Asian citrus psyllid possesses a brown head and the African species has a black head. Adult citrus psyllids will jump and/or fly for a short distance when they are disturbed. They are usually found on the undersides of leaves, often in high numbers. When a psyllid feeds on an infected plant, it acquires the disease after 15 to 30 minutes and feeding and is able to transmit the disease to new hosts after a period of 21 days. In order to transmit the disease successfully, the psyllids need only feed on a new host for a period of 15 minutes in order for successful transmission to occur. It is hypothesized that the bacterium multiplies within the body of the psyllid prior to transmission but this theory requires validation through experiments. \n\n\n\nGrafting\n\nAlthough the primary method of spread of the Huanglongbing bacterium is via the movement of citrus psyllids, the disease can also be transmitted through grafting practices. The ability of Huanglongbing to be transmitted by grafting was first demonstrated by Lin Kongxiang through experimental work which was published in 1956. The disease in not transmitted at high rates through grafting as as not all buds on infected trees contain the bacterium.",
        "management": "Control\n(i) Cultural control\n\nOnce a tree becomes infected with HLB, it cannot be cured. Control is therefore reliant on preventing the disease occurring in the first place and this is achieved through strict quarantining to prevent the introduction of citrus psyllids to areas which are currently free of the pest. Areas which are subject to quarantine have restrictions placed on the movement of citrus plants, fruit, equipment and items made from citrus. \n\n\n\nInfected trees should be removed as quickly as possible from plantations and destroyed. Identification of infected trees should be achieved through several surveys to ensure that infected trees which are not yet showing symptoms are identified. In Florida, the recommendation is to scout groves at least 4 times a year for disease symptoms.\n\n\n\n(ii) Control of citrus psyllids\n\nCitrus psyllid populations can be controlled through the application of chemical sprays. Insecticides have proved very effective at controlling T. eryreae in South Africa where systemic insecticides are applied to the tree at the base of the trunk. In areas of the USA, Citrus health management areas (CHMAs) have been created to encourage neighbouring growers to work together to prevent the disease. Control strategies which have been implemented by the program include scouting, mapping and large scale spraying to control citrus psyllids.",
        "image": "orange_citrus_greening.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 90,
    "fields": {
        "name": "Stubborn disease",
        "plant": 6,
        "symptoms": "Stunted trees, leaves shorter and broader, cupped and upright, may be chlorotic or have a mottled appearance, stunted, malformed fruits and low yield",
        "cause": "Bacterium",
        "comments": "Transmitted by leafhoppers, can cause serious losses in hot, dry conditions",
        "management": "Plant only material from disease free budwood, if disease is endemic to the are then nursery trees should be grown in an enclosure to protect the trees from vectors, if a young orcahrd becomes infected, it should be removed and replanted with healthy material",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 91,
    "fields": {
        "name": "Phytophthora gummosis",
        "plant": 6,
        "symptoms": "Sap oozing from cracks in bark, bark cracking, drying and falling off, lesions girdling trunk, severely infected trees have pale green leaves with yellow veins",
        "cause": "Oomycete",
        "comments": "Disease can develop rapidly in moist, cool conditions, spread by water splash",
        "management": "Only plant disease free nursery stock, plant trees in well draining soil and avoid injuries to bark on trunk, trunk wraps can provide protection from freezing",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 92,
    "fields": {
        "name": "Tristeza disease",
        "plant": 6,
        "symptoms": "Light green foliage, poor new growth, leaves may be dropping from tree, young trees blooming early, severely infected trees are stunted and bushy in appearance with chlorotic leaves and brittle twigs, some strains of the virus cause elongated pits in the trunk and branches which give the wood a rope like appearance",
        "cause": "Virus",
        "comments": "Disease spread from infected grafting material or by aphids",
        "management": "Quarantine procedures are used to control tristeza and prevent the pathogen from entering areas which are currently free of the disease",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 93,
    "fields": {
        "name": "Aphids (Black citrus aphid)",
        "plant": 6,
        "symptoms": "Leaves curling, leaves and twigs covered in sticky substance which may be growing sooty mold, trees may show symptoms of tristeza (see entry), insects are small and soft bodied  and are black in color",
        "cause": "Insect",
        "comments": "Aphids transmit tristeza virus on citrus",
        "management": "Aphid numbers tend to naturally decline as leaves harden off but can be a problem on young trees or varieties which continually produce flushes of new growth, pesticides are not generally recommended due to resistance and trees can withstand a high degree of leaf curling",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 94,
    "fields": {
        "name": "Asian citrus psyllid",
        "plant": 6,
        "symptoms": "Tips of leaves in new growth flushes are twisted and affected leaves do not expand properly, trees may show symptoms of citrus greening (see disease entry), the insect is tiny (4 mm in length) and has a mottled brown appearance, it feeds by inserting its mouthpaarts into the plant and sucking plant sap and as well as injecting toxins into the plant, it also transmits the deadly citrus greening disease, the insect feeds at an angle to the plant which makes it resemble thorns on the plant leaves",
        "cause": "Insect",
        "comments": "The Asian citrus psyllid attacks all varieties of citrus",
        "management": "In the home garden, frequent applications of organic pesticides can be used to control the Asian citrus psyllid, applications must be frequent to be effective as these chemicals are usually very short lived in the environment, parasitic wasps have been released in California to control the psyllid in residential areas, in commercial orange production insecticides should be applied to control the insects as the spread of citrus greening has the potential to devastate commercial citrus production",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 95,
    "fields": {
        "name": "Healthy",
        "plant": 6,
        "symptoms": "Orange, Citrus sinensis, is an evergreen tree in the family Rutaceae grown for its edible fruit. The orange tree is branched with a rounded crown and possesses elliptical or oval leaves which are alternately arranged on the branches. The leaves have narrowly winged petioles, a feature that distinguishes it from bitter orange, which has broadly winged petioles. The tree produces white flowers singly or clustered on a raceme. The fruit is a spherical berry with a green yellow to orange skin covered in indented glands and a segmented pulpy flesh and several seeds. Orange trees can grow to a height of 6-15 m (16-49 ft) and can live for periods in excess of 100 years. Most plantations have an economic lifespan of around 30 years. Orange may also be referred to as sweet orange or navel orange and is believed to have originated from a wild ancestor in the border between Vietnam and China. ",
        "cause": "Nil",
        "comments": "Nil",
        "management": "Nil",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 96,
    "fields": {
        "name": "Bacterial canker",
        "plant": 7,
        "symptoms": "Cankers on twigs at bases of flower and leaf buds, in pruning wounds or at the base of spurs which exude amber colored gum, cankers spread upwards and form sunken areas in winter, if pathogen enters dormant buds they may be killed or open normally in Spring before collapsing in early Summer, infected buds may be symptomless",
        "cause": "Bacterium",
        "comments": "Disease emergence favors high moisture and low temperatures in the spring, young trees particularly susceptible, trees grown in sandy soils that drain poorly are also susceptible",
        "management": "Ensure that a suitable peach variety and rootstock is chosen based on geographic location and environmental conditions to prevent stress to tree which predisposes tree to canker disease, apply protective copper spray to trees before flowering, prune trees in early summer to decrease likelihood of infection",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 97,
    "fields": {
        "name": "Bacterial spot",
        "plant": 7,
        "symptoms": "Water soaked, angular gray lesions on the underside of the leaves which turn purple and necrotic in the center and cause a shot hole appearance if lesion center drops out, if lesions are present in high numbers on leaves they may become chlorotic and drop from tree, cankers develop on twigs either as raised blisters or as a dark area surrounding a bud that fails to open, in years of severe infection the entire fruit crop may be lost, lesions on fruit begin as small brown, water soaked lesions which may exude gum",
        "cause": "Bacterium",
        "comments": "Periods of frequent rainfall during late bloom and early petal drop increase likelihood of fruit and leaf infection, infection is rare during hot, dry weather",
        "management": "Avoid planting susceptible peach varieties in areas where disease is known, once disease is visible it can be difficult to control, protective copper applications in the Fall prior to leaf drop and/or application in early growing season may help prevent the disease, care should be taken as peach trees are very sensitive to copper",
        "image": "peach_bacterial_spot.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 98,
    "fields": {
        "name": "Crown gall",
        "plant": 7,
        "symptoms": "Galls on roots and/or crown of tree which can range in size from so small they are not visible to the naked eye up to 10 cm (4 in) in diameter, galls first become visible as white, fleshy swellings that grow rapidly and become tan to brown in color, galls typically develop at the site of a wound and new galls form adjacent to old ones the next year",
        "cause": "Bacterium",
        "comments": "Infection with crown gall begins at the site of plant wounds, disease emergence is favored by poorly drained, alkaline soils and previous feeding damage by nematodes",
        "management": "Chemical control of the disease is generally ineffective, an effective bacterial biological control is available for commercial production, cultural control methods include: planting only certified, disease free material, planting peach in well draining soil, rotating infected fields with a non host before peach is planted and also using good sanitation practices",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 99,
    "fields": {
        "name": "Scab",
        "plant": 7,
        "symptoms": "Small, green to olive circular spots on surface of fruit, usually close to stem end, which enlarge, darken and develop a green or yellow halo, lesions may coalesce and cause fruit surface to crack, lesions on infected green twigs are hardly visible to start off with but become brown with a raised border before turning purple or dark brown, infected leaves develop angular or circular lesions on the lower surface which are initially a similar color to the leaf but turn olive green as they mature, leaf lesions may coalesce to form chlorotic patches, defoliation may occur",
        "cause": "Fungus",
        "comments": "Fungus overwinters in in twig lesions or on bark surface",
        "management": "Control currently relies completely on the use of fungicides, pruning the tree canopy promotes good air circulation and allows light to penetrate which can help control scab",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 100,
    "fields": {
        "name": "Brown rot",
        "plant": 7,
        "symptoms": "Brown discoloration of fruit skin and inner tissue, fruit skin wrinkled, collapsed flowers exuding sap from their bases, tan cankers with dark edges on twigs, gray brown spore masses may be present on cankers",
        "cause": "Fungus",
        "comments": "Fungus survives in mummified fruit on the tree, blighted blossoms, cankers and infected twigs, blossom and twig blights are promoted by periods of wet weather",
        "management": "The currently most effective method of controlling brown rot is through the application of appropriate protective fungicides timed so that they are applied when the susceptible flower parts are exposed or after a wet period, avoiding sprinkler irrigation protects the leaves and flowers from wetness that promotes the disease. Cultural control methods include: removing mummified fruit from tree, pruning infected twigs and reducing plant stress by providing adequate levels of water and fertilizer",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 101,
    "fields": {
        "name": "Rust",
        "plant": 7,
        "symptoms": "Pale yellow green spots on both upper and lower leaf surfaces which are angular in shape and turn bright yellow in color, spots on lower leaf surface develop orange red spores",
        "cause": "Fungus",
        "comments": "Fungus overwinters in twigs or in leaves which remain attached to the tree",
        "management": "Rust can be prevented by spraying trees with protective fungicides, application is usually carried out one, two and three months before harvest in areas prone to early season outbreaks of the disease and after harvest in areas where disease is less problematic or emerges later in the season",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 102,
    "fields": {
        "name": "Shot hole disease",
        "plant": 7,
        "symptoms": "Brown lesions with purple edge on fruit, twigs and buds, holes in leaves due to lesions which have dried and dropped out, brown lumps developing in the center of lesion (visible with hand lens), buds turning brown or black and exuding sap, tan lesions with brown margins which exude sap on twigs",
        "cause": "Fungus",
        "comments": "Disease emergence favors wet, windy conditions",
        "management": "Application of Bordeaux mixture before rains in Fall are sufficient to protect dormant buds and twigs over winter",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 103,
    "fields": {
        "name": "Silver leaf disease",
        "plant": 7,
        "symptoms": "Leaves have a silvery appearance, if infection is severe the leaves may curl upwards and become necrotic, death of individual limbs or entire tree may occur, fungal fruiting bodies appear on the surface of the dead bark",
        "cause": "Fungus",
        "comments": "Pathogen is spread via spores released after rainfall during periods of high humidity and can enter trees through pruning wounds, risk of infection is increased if tree is pruned during late winter or early spring, trees also susceptible when they are heavily pruned",
        "management": "Control of silver leaf disease is difficult and infection can be widespread after rainfall in areas where the disease is present, strategies to reduce the incidence of the disease include: removing all plant debris e.g. pruning waste, stumps, and logs, pruning tree during dry periods and treating large pruning wounds with fungicidal dressing",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 104,
    "fields": {
        "name": "Leaf curl",
        "plant": 7,
        "symptoms": "Yellow to red patches on young leaves in Spring which thicken and pucker causing leaf to curl, puckered parts of leaf may develop white covering, infected leaves may drop from plant or remain attached and turn dark brown, infection of fruit is rare but causes irregular, raised and wrinkled red lesions",
        "cause": "Fungus",
        "comments": "Emergence of leaf curl is promoted by periods of cool, wet weather during the early stages of bud development",
        "management": "The primary method of controlling peach leaf curl is the application of appropriate fungicides and/or planting resistant peach varieties, no peach varieties are completely resistant to leaf curl",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 105,
    "fields": {
        "name": "Plum pox virus",
        "plant": 7,
        "symptoms": "First expanding leaves exhibit chlorotic veinclearing and veinbanding, lamina twisted and distorted, fruit show dark rings, lines and spots, symptoms on fruti may disappear on ripening, fruit may be deformed",
        "cause": "Virus",
        "comments": "Virus is transmitted by aphids but most common method of spread is diseased plant material",
        "management": "Plant certified healthy material, remove infected trees from orchard, chemical sprays to control aphids may prolong spread of virus",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 106,
    "fields": {
        "name": "Phytophthora root and crown rot",
        "plant": 7,
        "symptoms": "Poor new growth, leaves chlorotic, small in size and sparse, fruit may be small, brightly colored and susceptible to sunburn, shoots may suffer from dieback and tree will often die within weeks or months of first signs of infection or decline gradually over several seasons, root crown may show signs of decay which develops into a canker, bark of infected crown tissue turns dark brown, cankers may occur on aerial parts of plant",
        "cause": "Oomycete",
        "comments": "Severity of disease is linked to soil moisture content, water saturated soils promote development of fungus",
        "management": "Management of phytophthora is reliant on good management of water: peach trees should be planted in well draining soil to minimize the frequency and duration of water saturated soil, trees should be propagated from resistant rootstock and application of appropriate systemic fungicides may provide some protection from the disease",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 107,
    "fields": {
        "name": "Fruittree leafroller",
        "plant": 7,
        "symptoms": "Leaves of plant rolled and tied together with silk webbing, feeding damage to rolled leaves, defoliation of plant, silk webbing may also be present on fruits and fruits may have substantial scarring from feeding damage, larvae wriggle vigorously when disturbed and may drop from plant on a silken thread",
        "cause": "Insect",
        "comments": "Only one generation of insect per year",
        "management": "Monitor plants regularly for signs of infestation, remove weeds from plant bases as they can act as hosts for leafrollers, avoid planting pepper in areas where sugarbeet or alfalfa are grown nearby, Bacillus thuringiensis or Entrust SC may be applied to control insects on organically grown plants, apply sprays carefully to ensure that treatment reaches inside rolled leaves",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 108,
    "fields": {
        "name": "Oriental fruit moth",
        "plant": 7,
        "symptoms": "Wilting shoot tips (\"flagging\") caused by insect feeding, insect frass may be visible around entry holes burrows in fruit which cause the fruit to be soft, mushy and discolored, adult insect is a small gray moth, larvae are initially white with a black head but turn pink with a brown head as they mature",
        "cause": "Insect",
        "comments": "Orietal fruit moths overwinter as mature larvae inside protective cocoons in protected areas of trees or in leaf debris on the ground, insect may undergo six or more generations per year",
        "management": "Management of the oriental fruit moth usually involves the application of insecticides or the use of mating disruptants, commercial growers should monitor moth numbers using pheromone traps and apply insecticide if average number of moths exceeds 10 per trap, chemical sprays should not be applied within 14 days of harvest",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 109,
    "fields": {
        "name": "Scale insects (White peach scale, San Jose scale)",
        "plant": 7,
        "symptoms": "Scale insects cause damage by feeding on twigs, branches and fruit on peach trees, injecting toxins into the plant as they do so, if the infestation is heavy, gumming may occur on the bark and twigs or entire branches can be killed, insects are flattened discs, or \"scales\" with no visible legs, scales produce a white waxy coating which eventually turns black (black cap stage)",
        "cause": "Insect",
        "comments": "Scale insects overwinter in the black cap stage, winged adult males mate with females which retain their eggs inside the body until they hatch",
        "management": "Populations are often kept in check by natural enemies, including predacious beetles and some wasps    although broad spectrum insecticides may result in outbreaks of scale by killing off populations of beneficial insects, peach trees can be sprayed with horticultural oils when dormant which effectively kill scales without damaging natural enemies",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 110,
    "fields": {
        "name": "Healthy",
        "plant": 7,
        "symptoms": "Peach,-Prunus persica, is a deciduous tree or shrub in the family Rosaceae grown for its edible fruit of the same name. The peach tree is relatively short with slender and and supple branches. The leaves are alternately arranged, slender and pointed. The tree produces pink flowers which have five petals and emerge in January and February. The fruit is a velvety, soft, fleshy red to yellow orange fruit which is oval in shape and 3 8 cm in diameter. Peach trees can grow up to 8 m (19 ft) in height and produce fruit for 10 to 20 years. Peach may also be referred to as nectarine, the two fruits belonging to the same species, although nectarines have smooth skin, and are believed to have originated in China.",
        "cause": "Nil",
        "comments": "Nil",
        "management": "Nil",
        "image": "peach_healthy.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 111,
    "fields": {
        "name": "Anthracnose",
        "plant": 8,
        "symptoms": "Circular lesions on fruit which contain tan to orange to black concentric rings in the center, lesions usually  reach 3 cm (1.2 in) in diameter but may enlarge to cover most of the fruit surface, lesions may also occur on leaves and stems and appear as irregularly shaped gray spots with dark margins",
        "cause": "Fungi",
        "comments": "Anthracnose is found in all major vegetable growing areas worldwide and can cause large losses if left untreated",
        "management": "Always plant disease free seeds and transplants, seeds can be freed from infection by treating with hot water at 52--C (125.6--F) for 30 minutes, if disease is known to present, the field should be rotated with non susceptible crops for a period of 3 years, plowing crop residue deeply into the soil r removing crop debris can help to reduce inoculum in the soil",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 112,
    "fields": {
        "name": "Cercospora leaf spot (Frogeye leaf spot)",
        "plant": 8,
        "symptoms": "Initial symptoms of infection are the formation of small, circular, water soaked spots on leaves, stems, petioles and/or peduncles, the lesions mature to have white to brown centers surrounded by a brown to red or purple border, as the lesions expand, they may develop a water soaked outer edge and dark outer ring which gives the lesions a concentric appearance, mature lesions are brittle and cracked in the center, lesions may be between 0.3 and 1.3 cm (0.1---0.5 in) in diameter,",
        "cause": "Fungus",
        "comments": "Cercospora leaf spot is mainly a disease of tropical and subtropical countries and occurs mainly in Africa, South America, Asia and the West Indies. In the U.S. it is found mainly in the southestern states",
        "management": "Cercospora infections are usually minor in pepper and require no treatment, crop debris should be removed and destroyed after harvest or buried in the soil, application of an appropriate fungicide can help to reduce damage if applied early on in the infection, practicing crop rotation reduces the incidence of the disease",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 113,
    "fields": {
        "name": "Damping off",
        "plant": 8,
        "symptoms": "Seeds did not germinate, seedlings collapsing and dying, dark stems which are shriveled near the soil line, water soaked lesions on the stem, water soaked discolored roots",
        "cause": "Fungi",
        "comments": "Disease can be spread in infected soil and irrigation water, disease emergence favored by overcrowded plants and excessive nitrogen fertilization",
        "management": "Avoid planting in poorly draining, cool, wet soil, planting in raised beds will help with soil drainage, plant high quality seed that germinates quickly, treat seeds with fungicide prior to planting to eliminate fungal pathogens",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 114,
    "fields": {
        "name": "Fusarium wilt",
        "plant": 8,
        "symptoms": "Yellowing of foliage and wilting upper leaves, wilting spread to all parts of plant, leaves remain attached to plant and are dark green in color, red brown discoloration of vascular tissue, plant death",
        "cause": "Fungus",
        "comments": "Disease emergence favors high soil moisture content",
        "management": "Plant pepper in well draining soils and avoid waterlogging",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 115,
    "fields": {
        "name": "Gray leaf spot",
        "plant": 8,
        "symptoms": "Initial symptoms of disease appear as small, red brown spots on leaves measuring 1---2 mm in diameter, as disease progresses, lesions expand and turn lighter in the center, lesions expand to 3---5 mm in diameter and mature lesions have white or gray centers and red brown margins, high numbers of lesions may form on leaves causing them to turn yellow and drop from the plant",
        "cause": "Fungi",
        "comments": "Disease has worldwide distribution but is most common in peppers grown in the cool season in tropical and subtropical climates, pathogen also attacks tomatoes",
        "management": "As pepper nursery beds seem to be more susceptible to gray leaf spot infection, control relies on good management of the beds, beds should be well ventilated and all crop debris should be promptly removed, beds should not be planted next to pepper or tomato fields, if disease is present and spreading then application of appropriate fumigant fungicides should be effective at eradicating the pathogen, lesions on plants in an established field usually do not warrant treatment",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 116,
    "fields": {
        "name": "Powdery mildew",
        "plant": 8,
        "symptoms": "Patches of white, powdery fungal growth on the underside of the leaves, yellow to brown discoloration of the upper leaf, edges of leaves may curl upwards exposing the underside of the leaf, leaves may begin dropping from plant",
        "cause": "Fungus",
        "comments": "Disease can occur in both humid and dry conditions, disease spreads most rapidly in humid conditions, disease commonly affects older leaves",
        "management": "Apply appropriate fungicide if disease is severe",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 117,
    "fields": {
        "name": "Southern blight",
        "plant": 8,
        "symptoms": "Sudden wilting of leaves, yellowing foliage, browning stem above and below soil, browning branches, stem may be covered with fan like mycelial mat",
        "cause": "Fungus",
        "comments": "Fungus can survive in soil for long periods, disease emergence favored by high temperatures, high humidity and acidic soil, disease found mainly in tropical and subtropical regions, including the southern United States",
        "management": "Remove infected plants, avoid overcrowding plants to promote air circulation, rotate crops with less susceptible plants, plow crop debris deep into soil, provide a barrier to infection by wrapping lower stems of plant with aluminum foil covering below ground portion of stem and 2 3 in above soil line",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 118,
    "fields": {
        "name": "Verticillium wilt",
        "plant": 8,
        "symptoms": "Initial symptoms of the disease include plants becoming stunted and lower leaves turning yellow, as the infection progresses, more leaves turn yellow and begin dropping from the plant, plants wilt during the day and recover at night, wilting becomes permanent and plant death ensues.",
        "cause": "Fungi",
        "comments": "Disease is present in pepper grown in Europe,  Canada and the U.S., the severity of the disease when it emerges is dependent on many factors, including the strain of the pathogen, host susceptibility, soil type and prevailing climatic conditions",
        "management": "There are currently no effective control strategies for Verticillium wilt once it is present in the field, cultural control practices should be employed to lessen the chances of the disease emerging in the first place, management strategies include rotating the crop every 3---4 years away from pepper, soil fumigation and/or solarization can reduce the level of inoculant in the soil",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 119,
    "fields": {
        "name": "Bacterial canker",
        "plant": 8,
        "symptoms": "Small, raised, white lesions on leaves that grow larger, turn brown and necrotic and may have a yellow halo, raised white lesions on fruit which coalesce to form larger spots, often with white halo",
        "cause": "Bacterium",
        "comments": "Symptoms can be mistaken for bacterial spot, disease emergence favors high temperatures and high humidity, disease can be spread between peppers and tomatoes",
        "management": "Use only certified seed and disease free transplants, treat seeds with hot water prior to planting to kill bacteria, sanitize all equipment regularly, rotate crops with non solanaceous plants",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 120,
    "fields": {
        "name": "Bacterial spot",
        "plant": 8,
        "symptoms": "Water soaked lesions that dry out and turn brown forming on the underside of the leaves, raised brown cankers on stems, cracked brown lesions on fruit.",
        "cause": "Bacterium",
        "comments": "Disease emergence favored by warm, wet conditions, the pathogen can be enter a field on seed and transplants and can be spread within a field by wind driven rain, clipping plants and aerosols.",
        "management": "Use disease free planting material, remove and destroy all crop debris after harvest, or plow material deeply under soil.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 121,
    "fields": {
        "name": "Bacterial wilt",
        "plant": 8,
        "symptoms": "Upper leaves of plant wilt on hot days and recover in the evening and early morning, affected leaves remain green and attached to the plant, if conditions are favorable to the development of the disease then the entire plant may wilt, vascular tissue in lower stems is often discolored brown, severe infection may result in bacteria oozing from the stems, symptoms are often found associated with low lying areas of fields where water collects",
        "cause": "Bacteria",
        "comments": "Most major losses in pepper crop are incurred in tropical and subtropical growing regions, disease also affects tomato, potato, tobacco and eggplant crops, bacteria enter the plants through tiny wounds in roots",
        "management": "Bacterial wilt is very difficult to control once it is established in a field, cultural control methods include planting disease free seedlings and ensuring irrigation water is free of the pathogen, plants should not be irrigated excessively to prevent build up of water which favors the development of the disease, pepper should be rotated with non susceptible crops to prevent the build up of the pathogen in the soil",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 122,
    "fields": {
        "name": "Blossom end rot",
        "plant": 8,
        "symptoms": "Small water soaked area on end of fruit where the blossom was occurring or on the side of unripe fruit, lesion enlarges and turns sunken, tan brown and leathery in appearance",
        "cause": "Low calcium concentration in fruit",
        "comments": "Physiological disorder, low calcium may result from competition from other ions in soil e.g. potassium, can also be caused by drought stress, fluctuations in soil moisture or application of excessive amounts of nitrogen fertilizer which promotes rapid vegetative growth",
        "management": "Maintain soil pH at 6.5, lime soil to increase the concentration of calcium in soil and decrease competition with other ions, use mulch to reduce drought stress, avoid ammonium fertilizers as they may increase competition with calcium by increasing ammonium ions in soil, use nitrate instead, avoid over fertilizing",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 123,
    "fields": {
        "name": "Magnesium deficiency",
        "plant": 8,
        "symptoms": "Symptoms of magnesium deficiency appear on older leaves first, initial symptoms are interveinal chlorosis of the leaves and, occasionally, a purple tinge to the leaves, as the deficiency becomes more severe, leaves may appear white with green veins, severe deficiencies may lead to reduced fruit yield",
        "cause": "Nutritional disorder",
        "comments": "Magnesium deficiency is rare in field grown peppers but can arise in sandy soils when heavy rain causes leaching",
        "management": "Magnesium deficiency can be prevented by applying dolomite lime to the soil, if an increase in soil pH is required, or through applications of a fertilizer containing magnesium",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 124,
    "fields": {
        "name": "Nitrogen deficiency",
        "plant": 8,
        "symptoms": "Plants exhibit reduced growth and leaves are smaller than normal, leaves exhibit a general yellowing, fruit are reduced in size and pale in color, older leaves of the plant show symptoms first and the yellowing progresses to younger leaves",
        "cause": "Nutritional disorder",
        "comments": "Nitrogen deficiency usually arises in cmmercial plantations through inadequate fertilizer application, heavy rain can leach nitrogen from sandy soils",
        "management": "If detected early, symptoms of nitrogen deficiency can be treated by applying appropriate amounts of nitrogen fertilizer",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 125,
    "fields": {
        "name": "Mosaic",
        "plant": 8,
        "symptoms": "Alternating light and green areas or mosaic patterns on the leaves, leaves distorted and curled, slow plant growth",
        "cause": "Virus",
        "comments": "Transmitted by aphids, weeds can act as a source of inoculum, insecticides are not effective due to the speed with which aphids can transmit the virus",
        "management": "Remove weeds around crop, use reflective mulches to deter aphids from plants",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 126,
    "fields": {
        "name": "Tomato spotted wilt virus",
        "plant": 8,
        "symptoms": "Symptoms may vary widely depending on variety and environmental conditions, generally leaves become spotted and bronzed in appearance, plant may droop or wilt, fruit develop concentric rings which are light in color and become necrotic",
        "cause": "Virus",
        "comments": "Virus can infect a wide range of plants including crops, ornamentals and weeds, once acquired by the thrips vector, the insect is capable of transmitting the virus for the rest of its life",
        "management": "Management of the disease is aimed at control of the thrips vector (see Thrips)",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 127,
    "fields": {
        "name": "Phytophthora blight",
        "plant": 8,
        "symptoms": "Black lesions on stems, wilting plant, circular gray brown lesions on leaves, dark lesions on fruit which may be covered in white sporangia",
        "cause": "Oomycete",
        "comments": "Disease highly water dependent and spores can be spread by water splash, disease can move root to root to infect a row of plants",
        "management": "Plant disease free transplants, manage water carefully as pathogen depends on water for survival, rotate crops, apply appropriate fungicide",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 128,
    "fields": {
        "name": "Aphids",
        "plant": 8,
        "symptoms": "Small soft bodied insects on underside of leaves and/or stems of plant, usually green or yellow in color, but may be pink, brown, red or black depending on species and host plant, if aphid infestation is heavy it may cause leaves to yellow and/or distorted, necrotic spots on leaves and/or stunted shoots, aphids secrete a sticky, sugary substance called honeydew which encourages the growth of sooty mold on the plants",
        "cause": "Insect",
        "comments": "Distinguishing features include the presence of cornicles (tubular structures) which project backwards from the body of the aphid, will generally not move very quickly when disturbed",
        "management": "If aphid population is limited to just a few leaves or shoots then the infestation can be pruned out to provide control, check transplants for aphids before planting, use tolerant varieties if available, reflective mulches such as silver colored plastic can deter aphids from feeding on plants, sturdy plants can be sprayed with a strong jet of water to knock aphids from leaves, insecticides are generally only required to treat aphids if the infestation is very high   plants generally tolerate low and medium level infestation, insecticidal soaps or oils such as neem or canola oil are usually the best method of control, always check the labels of the products for specific usage guidelines prior to use",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 129,
    "fields": {
        "name": "Beet armyworm",
        "plant": 8,
        "symptoms": "Singular, or closely grouped circular to irregularly shaped holes in foliage, heavy feeding by young larvae leads to skeletonized leaves, shallow, dry wounds on fruit, egg clusters of 50 150 eggs may be present on the leaves, egg clusters are covered in a whitish scale which gives the cluster a cottony or fuzzy appearance, young larvae are pale green to yellow in color while older larvae are generally darker green with a dark and light line running along the side of their body and a pink or yellow underside",
        "cause": "Insect",
        "comments": "Insect can go through 3---5 generations a year",
        "management": "Organic methods of controlling the beet armyworm include biological control by natural enemies which parasitize the larvae and the application of Bacillus thuringiensis, there are chemicals available for commercial control but many that are available for the home garden do not provide adequate control of the larvae",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 130,
    "fields": {
        "name": "Colorado potato beetle",
        "plant": 8,
        "symptoms": "Feeding damage to foliage, if infestation is severe or if left untreated plants can be completely defoliated, adult insect is a black and yellow striped beetle, larvae are bright red with black heads when they first hatch and change color to pink, larvae have two rows of black spots",
        "cause": "Insect",
        "comments": "Adult beetles emerge in spring, female beetles lay eggs in batches of up to two dozen, eggs are orange yellow and are laid on undersides of leaves, a female can lay 500 or more eggs over a four to five week period",
        "management": "Control of Colorado potato beetle can be challenging as they have developed high levels of insecticide resistance, in the home garden planting early maturing varieties of potato allows the plants to escape from most damage, adults and larvae should be hand picked from plants and destroyed in soapy water, applications of Bacillus thuringiensis can be effective at controlling larvae but should be applied frequently, some insecticides, including spinosad, are still effective against adult beetles",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 131,
    "fields": {
        "name": "Flea beetles",
        "plant": 8,
        "symptoms": "Small holes or pits in leaves that give the foliage a characteristic ---shothole--- appearance, young plants and seedlings are particularly susceptible, plant growth may be reduced, if damage is severe the plant may be killed, the pest responsible for the damage is a small (1.5---3.0 mm) dark colored beetle which jumps when disturbed, the beetles are often shiny and metallic in appearance",
        "cause": "Insects",
        "comments": "Flea beetles may overwinter on nearby weed species, in plant debris or in the soil, insects may go through a second or third generation in one year",
        "management": "In areas where flea beetles are a problem, floating row covers may have to be used prior to the emergence of the beetles to provide a physical barrier to protect young plants, plant seeds early to allow establishment before the beetles become a problem   mature plants are less susceptible to damage, trap crops may provide a measure of control   cruciferous plants are best, application of a thick layer of mulch may help prevent beetles reaching surface, application on diamotecoeus earth or oils such as neem oil are effective control methods for organic growers, application of insecticides containing carbaryl, spinosad, bifenthrin and permethrin can provide adequate control of beetles for up to a week but will need reapplied",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 132,
    "fields": {
        "name": "Leafminers",
        "plant": 8,
        "symptoms": "Thin, white, winding trails on leaves, heavy mining can result in white blotches on leaves and leaves dropping from the plant prematurely, early infestation can cause fruit yield to be reduced, adult leafminer is a small black and yellow fly which lays its eggs in the leaf, larave hatch and feed on leaf interior",
        "cause": "Insects",
        "comments": "Mature larvae drop from leaves into soil to pupate, entire lifecycle can take as little as 2 weeks in warm weather, insect may go through 7 to 10 generations per year",
        "management": "Check  transplants for signs of leafminer damage prior to planting, remove plants from soil immediately after harvest, only use insecticides when leafminer damage has been identified as unnecessary spraying will also reduce populations of their natural enemies",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 133,
    "fields": {
        "name": "Leafroller  (Omnivorous leafroller)",
        "plant": 8,
        "symptoms": "Leaves of plant rolled and tied together with silk webbing, feeding damage to rolled leaves, defoliation of plant, silk webbing may also be present on fruits and fruits may have substantial scarring from feeding damage, larvae wriggle vigorously when disturbed and may drop from plant on a silken thread",
        "cause": "Insect",
        "comments": "Adult insect is a moth which can fly over several miles to find suitable hosts, alfalfa and sugar beet are good hosts",
        "management": "Monitor plants regularly for signs of infestation, remove weeds from plant bases as they can act as hosts for leafrollers, avoid planting pepper in areas where sugarbeet or alfalfa are grown nearby, Bacillus thuringiensis or Entrust SC may be applied to control insects on organically grown plants, apply sprays carefully to ensure that treatment reaches inside rolled leaves",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 134,
    "fields": {
        "name": "Pepper weevil",
        "plant": 8,
        "symptoms": "Feeding damage to foliage, buds and tender young fruit pods, larvae feed within buds and fruit, older fruit misshapen and discolored, buds and fruit may drop from plant, adult weevil is a small black beetle, larvae are small cream white grubs with brown heads which can reach 0.6 cm (0.25 in) in length when mature",
        "cause": "Insect",
        "comments": "Weevil will go through multiple generations per year, pepper preferred host but weevil will feed on other plants in the nightshade family also",
        "management": "Remove any nightshade plants growing in close proximity to pepper, immediately remove any dropped fruit from soil surface, if pepper weevil becomes problematic, rotate crop the following year, organically acceptable control methods include sprays of pyrethrin, destroy pepper crop residue immediately after harvest",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 135,
    "fields": {
        "name": "Thrips (Western flower thrips, Onion thrips, etc.)",
        "plant": 8,
        "symptoms": "If population is high leaves and buds may be distorted, leaves appear silvery and are speckled with black feces, insects will feed on and damage flowers, most damage occurs through the transmission of Tomato spotted wilt virus (TSWV), insect is small (1.5 mm) and slender and best viewed using a hand lens, adult thrips are pale yellow to light brown and the nymphs are smaller and lighter in color",
        "cause": "Insect",
        "comments": "Insect transmits Tomato spotted wilt virus (see disease entry), once acquired, the insect retains the ability to transmit the virus for the remainder of its life",
        "management": "Avoid planting next to onions, garlic or cereals where very large numbers of thrips can build up, use reflective mulches early in growing season to deter thrips, apply appropriate insecticide if thrips become problematic",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 136,
    "fields": {
        "name": "Tomato fruit worm (Corn earworm)",
        "plant": 8,
        "symptoms": "Larvae burrowing into fruit near stem end and feeding on fruit interior  causing decay, fruit turn red prematurely and fall from plant causing reduced yield, young caterpillars are cream white in color with a black head and black hairs, older larvae may be yellow green to almost black in color with fine white lines along their body and black spots at the base of hairs, eggs are laid singly on both upper and lower leaf surfaces and are initially creamy white but develop a brown red ring after 24 hours and darken prior to hatching",
        "cause": "Insect",
        "comments": "Adult insect is a pale green to tan, medium sized moth, can be one of the most damaging pests of tomato, insect overwinters as pupae in the soil, the insect is also a damaging pest of corn and is also referred to as the corn earworm",
        "management": "Early treatment of tomato fruitworms is necessary as once they enter the fruit they are protected from sprays, monitor plants for eggs and young larvae and also natural enemies that could be damaged by chemicals, Bacillus thuringiensis or Entrust SC may be applied to control insects on organically grown plants, appropriate chemical treatment may be required for control in commercial plantations",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 137,
    "fields": {
        "name": "Spider mites (Two spotted spider mite)",
        "plant": 8,
        "symptoms": "Leaves stippled with yellow, leaves may appear bronzed, webbing covering leaves, mites may be visible as tiny moving dots on the webs or underside of leaves, best viewed using a hand lens, usually not spotted until there are visible symptoms on the plant, leaves turn yellow and may drop from plant",
        "cause": "Arachnid",
        "comments": "Spider mites thrive in dusty conditions, water stressed plants are more susceptible to attack",
        "management": "In the home garden, spraying plants with a strong jet of water can help reduce buildup of spider mite populations, if mites become problematic apply insecticidal soap to plants, certain chemical insecticides may actually increase mite populations by killing off natural enemies and promoting mite reproduction",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 138,
    "fields": {
        "name": "Healthy",
        "plant": 8,
        "symptoms": "Bell peppers,-Capsicum annuum-are a cultivar group of annual or perennial plants in the family Solanaceae grown for their edible fruits. Bell pepper plants are short bushes with woody stems that grow brightly colored fruits. The alternating leaves are elliptical, smooth edged, and come to a distinct point. The plant produces white or purple bell shaped flowers which are 2.5 cm (1 in) in diameter. Red, yellow, purple, or brown fruit are produced each season about 3 6 weeks after flowering. Pepper plants can grow 1 m (3.3 ft) tall and are usually grown as annuals in temperate regions for only one growing season. Bell pepper may be referred to as red pepper, yellow pepper or green pepper and is believed to have originated in Central and South America.",
        "cause": "Nil",
        "comments": "Nil",
        "management": "Nil",
        "image": "bell_pepper_healthy.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 139,
    "fields": {
        "name": "Bacterial ring rot",
        "plant": 9,
        "symptoms": "Wilting stems and leaves, dying leaves, lower leaves wilting first, ring of creamy yellow to brown rot visible when tuber is cut crossways",
        "cause": "Bacterium",
        "comments": "Becterium is tuber borne, bacteria can enter tuber through cutting wounds, disease favored by wet, warm soils, bacteria overwinter in potato debris",
        "management": "Plant only certified seed potatoes   certified seed potatoes are grown in seed beds with zero tolerance of ring rot, remove all crop debris from soil after harvest, sanitize tools and equipment regularly",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 140,
    "fields": {
        "name": "Blackleg (Soft rot)",
        "plant": 9,
        "symptoms": "Small, water soaked lesions on base of stems originating from seed piece, lesions may enlarge to form a large extended lesion stretching from base of stem to canopy, tissue becomes soft and water soaked and can be lighty brown to inky black in color, wilted, curled leaves which have a soft and slimy texture when wet",
        "cause": "Bacterium",
        "comments": "Bacteria are carried on tubers and in wounds and can be spread to healthy tubers during handling and cutting of seed pieces, disease emergence favors high soil temperatures",
        "management": "Plant seed pieces which are the product of tissue culture, sanitize tools and equipment when cutting seed pieced to prevent bacterial contamination, avoid damaging tubers during harvest, reduce periods of leaf wetness by allowing enough time for leaves to dry throughout the day after watering",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 141,
    "fields": {
        "name": "Common scab",
        "plant": 9,
        "symptoms": "Raised brown lesions on tubers with corky texture, deep, pitted brown or black lesions on tuber with straw colored translucent tissue underneath",
        "cause": "Bacterium",
        "comments": "Disease is most severe during warm and dry conditions",
        "management": "Common scab can be very difficult to manage and prevention of the disease relies on combining several different methods. These include: avoiding planting infected tubers, using a 3 4 rotation away from potato, planting less susceptible potato varieties (none are immune), maintaining a high soil moisture content for 4 6 weeks after stolon tips begin to swell at the onset of tuber development, amending soil to lower pH and treating seed with appropriate fungicides when available",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 142,
    "fields": {
        "name": "Black dot",
        "plant": 9,
        "symptoms": "Small black dots (fungal fruiting bodies) on tubers, stolons and stems, roots may rot below ground, leaves may turn yellow and wilt, infection may cause defoliation",
        "cause": "Fungus",
        "comments": "Disease emergence favors poorly draining soil, poor aeration of soil and high temperatures, disease symptoms are most severe in coarse soils that are low in nitrogen",
        "management": "Stressed plants are more susceptible to black dot, rotate crops away from potato, do not plant infested tubers or seed pieces, fertilize and water plants adequately, protective fungicides can be applied where available",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 143,
    "fields": {
        "name": "Black scurf & Rhizoctonia canker",
        "plant": 9,
        "symptoms": "Flat, irregularly shaped black or dark brown fungal fruiting bodies on tuber surface, tubers may be mishapen, red brown to black sunken lesions on sprouts, lesions may girdle the main stem causing leaves to curl and turn yellow",
        "cause": "Fungus",
        "comments": "Fungus can be spread by infested soil or planting infected seed pieces and tubers, disease emergence favors cool, moist soil",
        "management": "No potato varieties are completely resistant to the disease, control relies on reducing the level of inoculum in both the soil and in tubers, methods include applying fungicide to seed pieces or soil, avoiding planting seeds too deeply in cold soils and rotating crop away from potato to reduce levels of soil inoculum",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 144,
    "fields": {
        "name": "Gray mold",
        "plant": 9,
        "symptoms": "Flowers covered in gray, fuzzy mold, wedge shaped tan lesions on leaves, a slimy brown rot may be present on stems, originating from the petiole, infected tubers have wrinkly skin and tissue underneath is soft and wet, tubers often develop a gray fuzzy growth",
        "cause": "Fungus",
        "comments": "Disease emergence favors excessive humidity, cool temperatures and shade",
        "management": "Cultural control is very important for managing the disease, provide plants with adequate fertilizer and water, application of appropriate protective fungicides where available can provide adequate control of disease but will not treat an established infection",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 145,
    "fields": {
        "name": "Pink rot",
        "plant": 9,
        "symptoms": "Stunted plant growth, wilting leaves, dying leaves, marked tuber decay, dark brown eyes on tuber, cut tuber turns pink after 20 30 min air exposure, then turns brown and finally black",
        "cause": "Oomycete",
        "comments": "Disease emergence favors high soil water saturation late in the season",
        "management": "Plant potato in well draining soils with no history of pink rot, avoid overwatering plants, avoid wounding during harvest",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 146,
    "fields": {
        "name": "Potato Early Blight",
        "plant": 9,
        "symptoms": "Dark lesions with yellow border which may form concentric rings of raised and sunken tissue on the leaves and stems, lesions initially circular but become angular, leaves become necrotic but remain attached to plant, dark, dry lesions on tubers with leathery or corky texture and watery yellow0green margins",
        "cause": "Fungus",
        "comments": "Disease emergence favors cycles of wet and dry conditions with periods of high humidity and leaf wetness",
        "management": "Application of appropriate protective fungicide can reduce severity of foliar symptoms, reduce stress to plants by fertilizing and watering adequately, plant late varieties which are less susceptible to disease, store tubers in cool environment",
        "image": "potato_early_blight.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 147,
    "fields": {
        "name": "Powdery scab",
        "plant": 9,
        "symptoms": "White to brown galls on the roots and stolon, raised pustules on tuber surrounded by potato skin, shallow depressions on tuber filled with brown spores",
        "cause": "Fungus",
        "comments": "Symptoms all occur below ground",
        "management": "Do not plant tubers showing symptoms of disease, avoid planting potato in poorly draining soils, if disease occurs rotate crop away from potato for a period of 3 10 years and avoid planting tomato",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 148,
    "fields": {
        "name": "Verticillium wilt",
        "plant": 9,
        "symptoms": "Early death of plants, leaflets dying on only one side of the petiole or branching stem, cut through the stem reveals a discoloration of the tissue, discoloration of tubers at stem end",
        "cause": "Fungi",
        "comments": "Disease emergence favors high temperature and moisture early in season followed by drought, disease can be spread to uninfected fields by wind or movement of infested soil particles",
        "management": "Planting resistant varieties of potato is the most common method of controlling the disease, cultural practices such as using furrow irrigation in place of sprinkler irrigation and avoiding overwatering plant can also reduce the severity of the disease should it occur",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 149,
    "fields": {
        "name": "Leak",
        "plant": 9,
        "symptoms": "Light tan, water soaked area around wound on tuber, internal rotting of tuber which results in internal tissue becomes spongy and possibly developing cavities, dark, watery fluid exudes from the tuber when squeezed",
        "cause": "Fungi",
        "comments": "Disease only affects tubers and fungus can only enter through wounds, all common potato cultivars are susceptible to leak, disease emergence is favored by relatively high temperatures",
        "management": "Rotating crops away from potato and destroying any infected tubers helps to control the disease, infection can be reduced by application of appropriate foliar fungicides, delaying harvest to allow the skin of the tuber to mature reduced the risk of injury to the tuber",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 150,
    "fields": {
        "name": "Potato Late Blight",
        "plant": 9,
        "symptoms": "Irregularly shaped spreading brown lesions on leaves with distinctive white fluffy sporulation at lesion margins on the underside of the leaf in wet conditions. In dry condition the lesions dry up and go dark brown with collapsed tissue, water soaked dark green to brown lesions on stems also with characteristic white sporulation, later in infection leaves and petioles completely rotted, severely affected plants may have an slightly sweet distinctive odor, red brown firm lesions on tubers extending several centimeters into tissue, lesions may be slightly sunken in appearance and often lead to secondary bacterial rots.",
        "cause": "Oomycete",
        "comments": "The pathogen can survive for several months to years in the soil, emergence of disease favored by moist, cool conditions, major cause of disease spread is infected tubers",
        "management": "Control depends on a multifaceted approach with importance of certain practices changing based on geographic location: destroy infected tubers, destroy any volunteer plants, application of appropriate fungicide to potato hills at emergence, time watering to reduce periods of leaf wetness e.g. water early to allow plant to dry off during the day, plant resistant varieties, apply appropriate protective fungicide if disease is forecast in area",
        "image": "potato_late_blight.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 151,
    "fields": {
        "name": "Potato leaf roll",
        "plant": 9,
        "symptoms": "Young leaves rolled and yellow or pink, lower leaves have leathery texture and roll upward, necrotic netting in vascular tissue of tuber may be present, plant exhibits an upright growth habit and growth may be stunted",
        "cause": "Virus",
        "comments": "Transmitted by several species of aphid, infected seed tubers and volunteer potato plants provide a source of inoculum for the virus",
        "management": "Grow plants produced clonally from PLRV free stock, harvest potato crop early in temperate regions to avoid aphid migrations late in season, remove and destroy infected plants and tubers, application of appropriate insecticides where available may help reduce spread",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 152,
    "fields": {
        "name": "Potato virus A",
        "plant": 9,
        "symptoms": "Mild mosaic pattern or mottling on leaves, severely infected plants may have alternating patches of yellow and dark green tissue, leaves may have a shiny appearance, stems bending outwards slightly",
        "cause": "Virus",
        "comments": "Virus is transmitted by several species of aphid and can be transmitted to the next potato generation by planting infected tubers, tubers show no visible symptoms",
        "management": "Plant material which is free of PVA, plant tolerant potato varieties in areas where virus is common, application of appropriate systemic insecticides helps to control aphid populations`",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 153,
    "fields": {
        "name": "Potato virus X",
        "plant": 9,
        "symptoms": "Mild mosaic pattern on leaves, severely infected plants may be dwarved with smaller leaves, necrosis of plant tops and tubers may occur",
        "cause": "Virus",
        "comments": "PVX can be transmitted by infected leaves coming into contact with healthy ones",
        "management": "Planting seed free of PVX is the most important method of controlling the virus",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 154,
    "fields": {
        "name": "Potato virus Y",
        "plant": 9,
        "symptoms": "Symptoms vary widely from mild mosaic of leaves to leaf necrosis and plant death depending on the variety of potato and the strain of the virus: leaves may turn yellow and drop from plant, symptoms may be present on only one shoot of the plant, plants with severe leaf necrosis may produce tubers with light brown rings on the skin",
        "cause": "Virus",
        "comments": "Virus is transmitted by more than 25 different species of aphid, virus can be transmitted over long distances by aphids, can be transmitted mechanically by contact with infected leaves or tubers",
        "management": "Plant only certified seed potatoes, application of appropriate systemic insecticides, where available, may control spread of virus within a single plantation but will not prevent spread caused by winged aphids, remove and destroy symptomatic plants, plant resistant varieties",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 155,
    "fields": {
        "name": "Aphids (Peach aphid, Potato aphid)",
        "plant": 9,
        "symptoms": "Small soft bodied insects on underside of leaves and/or stems of plant, usually green or yellow in color, but may be pink, brown, red or black depending on species and host plant, if aphid infestation is heavy it may cause leaves to yellow and/or distorted, necrotic spots on leaves and/or stunted shoots, aphids secrete a sticky, sugary substance called honeydew which encourages the growth of sooty mold on the plants",
        "cause": "Insects",
        "comments": "Aphids are most damaging to potato through the transmission of viruses such as Potato leafroll virus, distinguishing aphid features include the presence of cornicles (tubular structures) which project backwards from the body of the aphid, will generally not move very quickly when disturbed",
        "management": "If aphid population is limited to just a few leaves or shoots then the infestation can be pruned out to provide control, check transplants for aphids before planting, use tolerant varieties if available, reflective mulches such as silver colored plastic can deter aphids from feeding on plants, sturdy plants can be sprayed with a strong jet of water to knock aphids from leaves, insecticides are generally only required to treat aphids if the infestation is very high   plants generally tolerate low and medium level infestation, insecticidal soaps or oils such as neem or canola oil are usually the best method of control, always check the labels of the products for specific usage guidelines prior to use",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 156,
    "fields": {
        "name": "Colorado potato beetle",
        "plant": 9,
        "symptoms": "Feeding damage to foliage, if infestation is severe or if left untreated plants can be completely defoliated, adult insect is a black and yellow striped beetle, larvae are bright red with black heads when they first hatch and change color to pink, larvae have two rows of black spots",
        "cause": "Insect",
        "comments": "Adult beetles emerge in spring, female beetles lay eggs in batches of up to two dozen, eggs are orange yellow and are laid on undersides of leaves, a female can lay 500 or more eggs over a four to five week period",
        "management": "Control of Colorado potato beetle can be challenging as they have developed high levels of insecticide resistance, in the home garden planting early maturing varieties of potato allows the plants to escape from most damage, adults and larvae should be hand picked from plants and destroyed in soapy water, applications of Bacillus thuringiensis can be effective at controlling larvae but should be applied frequently, some insecticides, including spinosad, are still effective against adult beetles",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 157,
    "fields": {
        "name": "Cutworms",
        "plant": 9,
        "symptoms": "Stems of young transplants or seedlings may be severed  at soil line, if infection occurs later, irregular holes are eaten into the surface of fruits, larvae causing the damage are usually active at night and hide during the day in the soil at the base of the plants or in plant debris of toppled plant, larvae are 2.5---5.0 cm (1---2 in) in length, larvae may exhibit a variety of patterns and coloration but will usually curl up into a C shape when disturbed",
        "cause": "Insects",
        "comments": "Cutworms have a wide host range and attack vegetables including asparagus, bean, cabbage and other crucifers, carrot, celery, corn, lettuce, pea, pepper, potato and tomato",
        "management": "Remove all plant residue from soil after harvest or at least two weeks before planting, this is especially important if the previous crop was another host such as alfalfa, beans or a leguminous cover crop, plastic or foil collars fitted around plant stems to cover the bottom 3 inches above the soil line and extending a couple of inches into the soil can prevent larvae severing plants, hand pick larvae after dark, spread diatomaceous earth around the base of the plants (this creates a sharp barrier that will cut the insects if they try and crawl over it), apply appropriate insecticides to infested areas of garden or field if not growing organically",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 158,
    "fields": {
        "name": "Flea beetles",
        "plant": 9,
        "symptoms": "Small holes or pits in leaves that give the foliage a characteristic ---shothole--- appearance, young plants and seedlings are particularly susceptible, plant growth may be reduced, if damage is severe the plant may be killed, the pest responsible for the damage is a small (1.5---3.0 mm) dark colored beetle which jumps when disturbed, the beetles are often shiny in appearance",
        "cause": "Insects",
        "comments": "Younger plants are more susceptible to flea beetle damage than older ones, older plants can tolerate infestation, flea beetles may overwinter on nearby weed species, in plant debris or in the soil, insects may go through a second or third generation in one year",
        "management": "In areas where flea beetles are a problem, floating row covers may have to be used prior to the emergence of the beetles to provide a physical barrier to protect young plants, plant seeds early to allow establishment before the beetles become a problem   mature plants are less susceptible to damage, trap crops may provide a measure of control   cruciferous plants are best, application of a thick layer of mulch may help prevent beetles reaching surface, application on diamotecoeus earth or oils such as neem oil are effective control methods for organic growers, application of insecticides containing carbaryl, spinosad, bifenthrin and permethrin can provide adequate control of beetles for up to a week but will need reapplied",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 159,
    "fields": {
        "name": "Wireworms",
        "plant": 9,
        "symptoms": "Death of seedlings, reduced stand, girdled stems and white heads, wireworm larvae can be found in soil when dug round the stem, larvae are yellow brown, thin worms with shiny skin",
        "cause": "Insect",
        "comments": "Larval stage can last between 1 and 5 years depending on species",
        "management": "Chemical control impossible in a standing crop, must be applied at preplanting or as a seed treatment, if wireworms are known to be present in soil fallow field during summer and till frequently to reduce numbers, rotate to non host crop where possible, avoid planting susceptible crops after a wireworm infestation on cereals without either fallowing of applying appropriate pesticide",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 160,
    "fields": {
        "name": "Healthy",
        "plant": 9,
        "symptoms": "Potato, Solanum tuberosum, is an herbaceous perennial plant in the family Solanaceae which is grown for its edible tubers. The potato plant has a branched stem and alternately arranged leaves consisting of leaflets which are both of unequal size and shape. The leaflets can be oval to oblong in shape and the leaves can reach 10-30 cm (4-12 in) in length and 5-15 cm (2-6 in) wide. The potato plant produces white or blue flowers and yellow green berries. The potato tubers grow underground and generally located in the top 25 cm (10 in) of the soil. The tubers can range in color from yellow to red or purple depending on the variety. Potato plants can reach in excess of 1 m (3.3 ft) in height and are grown as annual plants, surviving only one growing season. Potato may also be referred to as, spud, Irish potato, white potato or Spanish potato and originates from South America.",
        "cause": "Nil",
        "comments": "Nil",
        "management": "Nil",
        "image": "potato_healthy.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 161,
    "fields": {
        "name": "Cane blight",
        "plant": 10,
        "symptoms": "Purple black cankers form at wounds on young canes, cankers enlarge to encircle cane and cause wilting and death of lateral shoots, infected canes are often cracked and brittle, breaking easily, black specks (fungal fruiting bodies) may become visible in the cankers.",
        "cause": "Fungus",
        "comments": "Spread by rain splash from infected to healthy canes.",
        "management": "Always plant raspberries in full sun and in an area with good drainage, plant only certified planting material, avoid over fertilizing plants, remove and destroy fruiting canes immediately after harvest, if pruning is necessary then make cuts during dry weather to allow wounds to heal before wet weather, control insect pests which may cause wounds to the canes such as crown borers and stem girdlers.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 162,
    "fields": {
        "name": "Gray mold",
        "plant": 10,
        "symptoms": "Blasting symptoms (browning and drying) of one, or a cluster, of blossoms, soft, light brown areas on fruits which enlarge rapidly, berries become mummified and is covered in a gray powdery substance,",
        "cause": "Fungus",
        "comments": "Disease emergence favors high moisture and slow drying areas.",
        "management": "Always plant raspberries in full sun and in an area with good drainage, plant only certified planting material, avoid over fertilizing plants, remove and destroy fruiting canes immediately after harvest, practice good weed management around the raspberry canes, harvest fruit frequently and during dry weather, remove and destroy diseased berries to reduce inoculum.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 163,
    "fields": {
        "name": "Raspberry leaf spot",
        "plant": 10,
        "symptoms": "The symptoms appear on young leaves as small dark green circular spots. As the disease progress the spots become light tan to gray color. Later the infected tissue may fall out. Severely infected leaves may fall off prematurely.",
        "cause": "Fungus",
        "comments": "Spores are spread by splashing water.",
        "management": "Remove infected crop debris and burn them. Provide proper air circulation around the plant. If the disease is severe, spray suitable fungicide.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 164,
    "fields": {
        "name": "Spur blight",
        "plant": 10,
        "symptoms": "Purple brown lesions on the stem just under the leaf or bud, lesions are usually on the lower portion of the stem, bark splitting on canes lengthways, brown triangular lesions may form on edges of leaves.",
        "cause": "Fungus",
        "comments": "Fungus is able to overwinter on diseased canes and disperse during rainfall and active wind.",
        "management": "Increase air circulation within the canopy by reducing the frequency of periods of leaf wetness (avoid overhead irrigation where possible) and thinning plants to reduce crowding, avoid excessive application of fertilizer, particularly nitrogen, practice good weed management, if disease is severe then an an application of appropriate fungicide may be merited.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 165,
    "fields": {
        "name": "Yellow rust",
        "plant": 10,
        "symptoms": "Yellow orange pustules on underside of leaves, premature death of leaves, increased cold weather injury.",
        "cause": "Fungus",
        "comments": "Pathogen is not systemic and will not spread within the plant, spores are transmitted by wind.",
        "management": "Improve air circulation around the plants by pruning, removal of entire floricane and the first flush of growth on the primocane can greatly reduce the amount of inoculum but is not alwasy economically feasible, growing raspberries in tunnels can greatly reduce incidence of disease if plants are protected before conditions are favorable to the rust pathogen.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 166,
    "fields": {
        "name": "Fire blight",
        "plant": 10,
        "symptoms": "The infected cane tip become blackened, bend over and die which resembles the ---shepherd---s crook--- appearance. The affected cane may ooze cream colored bacteria under high humid conditions. If the infection continues down the cane, the leaf veins and surrounding tissue of the midvein turn black. Later whole leaf may wither and die. The infected berries do not mature, become brown, dry up, become very hard and remain on pedicel. Generally the infection is restricted to young growth of the plant.",
        "cause": "Bacterium",
        "comments": "The pathogen is transmitted by wind, rain splash and insects.",
        "management": "Use healthy and disease free seed materials. Remove and burn the infected parts.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 167,
    "fields": {
        "name": "Healthy",
        "plant": 10,
        "symptoms": "Raspberry is the name given to two plant species in the genus Rubus, Rubus idaeus-(red raspberry) and-Rubus occidentalis-(black raspberry) grown for their edible fruit. Raspberry plants have perennial root systems and biennial stems which are known as canes. The canes are woody, erect and shrub like and generally undergo a period of growth one year and fruit production the next although primocane varieties exist that produce fruit in the first year. The canes may possess spines. Raspberry plants produce white or pink flowers with five petals which are surrounded by green sepals. After the plant has been pollinated, an aggregate berry is produced which consists of numerous druplets which are held together into the familiar raspberry fruit by tiny hairs. Raspberry canes can grow from 0.5 to in excess of 2 m (1.6-6.6 ft) in height and red raspberry will produce a commercial yield of fruit for 16-20 years, while black raspberry has a shorter lifespan and will produce for 4-8 years. Red raspberry may also be referred to as European raspberry, red garden raspberry or hindberry, while black raspberry may be referred to as blackcap raspberry and may have originated in the Ide mountains of Turkey.",
        "cause": "Nil",
        "comments": "Nil",
        "management": "Nil",
        "image": "raspberry_healthy.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 168,
    "fields": {
        "name": "Bacterial blight",
        "plant": 11,
        "symptoms": "Water soaked spots on leaves which enlarge and become necrotic, spots may be surrounded by a zone of yellow discoloration, lesions coalesce and give plant a burned appearance, leaves that die remain attached to plant, circular, sunken, red brown lesion may be present on pods, pod lesions may ooze during humid conditions",
        "cause": "Bacterium",
        "comments": "Disease can be introduced by contaminated seed, bacteria overwinters in crop debris, disease emergence favored by warm temperatures, spread is greatest during humid, wet weather conditions",
        "management": "Plant only certified seed, plant resistant varieties, treat seeds with an appropriate antibiotic prior to planting to kill off bacteria, spray plants with an appropriate protective copper based fungicide before appearance of symptoms",
        "image": "soybean_bacterial_blight.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 169,
    "fields": {
        "name": "Bacterial pustule",
        "plant": 11,
        "symptoms": "Tiny pale green spots with raised centers on both upper and lower leaf surfaces which develop raised pustules in lesion center, pustules usually form in lesions on lower leaf surface, mottled brown areas may develop on leaves if lesions coalesce, small red brown spots may develop on pods of some varieties",
        "cause": "Bacteria",
        "comments": "Disease is prevalent in soybean growing regions which experience warm temperatures and frequent rainfall during the growing season",
        "management": "Plant varieties of soybean that are resistant to bacterial pustule, spray plants with an appropriate protective copper based fungicide before appearance of symptoms",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 170,
    "fields": {
        "name": "Rhizoctonia stem rot",
        "plant": 11,
        "symptoms": "Damping off (pre  or post emergence death) of seedlings caused by red brown lesions which girdle the stem, lesions or cankers may be present on the stem of older plants and cause the death of the plant mid season",
        "cause": "Fungus",
        "comments": "Disease emergence favors warm, dry soil and subsequent rainfall",
        "management": "Treat seeds with an appropriate fungicide prior to planting, plant less susceptible varieties of soybean, plant  only in well draining soils",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 171,
    "fields": {
        "name": "Rust",
        "plant": 11,
        "symptoms": "Gray or red brown water soaked spots on leaves which turn are tan to dark reddish brown in color lesions may also be present on stems, petioles and pods, volcano shaped uredinia (spore producing structures) are present within the lesions, plants drop leaves and mature prematurely",
        "cause": "Fungus",
        "comments": "Rust development is favored by warm temperatures and periods of high humidity",
        "management": "Plant soybean varieties that are resistant to rust, applications of appropriate foliar fungicides can help to control the disease",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 172,
    "fields": {
        "name": "Sclerotinia stem rot",
        "plant": 11,
        "symptoms": "Upper leaves of plant become wilted and die, leaves turn a gray green color and dry out, water soaked lesions on stem nodes which change color from tan to white, lesions may girdle the stem and infection may spread to both side branches and pods, cottony white mycelial growth occurs on all infected plant parts",
        "cause": "Fungus",
        "comments": "Disease emergence favors cool, wet weather, pathogen is resistant to many fungicides",
        "management": "Do not plant soybeans in fields where common bean, sunflowers or other susceptible crops have been grown the previous season, space plants in narrow rows, avoid excessive irrigation after plants are no longer flowering, plant soybean varieties that are less susceptible to the disease",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 173,
    "fields": {
        "name": "Armyworms (Beet armyworm, Western striped armyworm)",
        "plant": 11,
        "symptoms": "Singular, or closely grouped circular to irregularly shaped holes in foliage, heavy feeding by young larvae leads to skeletonized leaves, shallow, dry wounds on fruit, egg clusters of 50 150 eggs may be present on the leaves, egg clusters are covered in a whitish scale which gives the cluster a cottony or fuzzy appearance, young larvae are pale green to yellow in color while older larvae are generally darker green with a dark and light line running along the side of their body and a pink or yellow underside",
        "cause": "Insect",
        "comments": "Insect can go through 3---5 generations a year",
        "management": "Organic methods of controlling armyworms include biological control by natural enemies which parasitize the larvae and the application of Bacillus thuringiensis, there are chemicals available for commercial control but many that are available for the home garden do not provide adequate control of the larvae",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 174,
    "fields": {
        "name": "Cucumber beetles (Western striped cucumber beetle, Western spotted cucumber beetle)",
        "plant": 11,
        "symptoms": "Stunted seedling, damaged leaves, stems and/or petioles, reduced plant stand, plants may exhibit symptoms of bacterial wilt, scars on fruit caused by beetle feeding damage, adult beetles are brightly colored with either a green yellow background and black spots or alternating black and yellow stripe",
        "cause": "Insect",
        "comments": "Beetles overwinter in soil and leaf litter and emerge from soil when temperatures begin to reach and exceed  12.7--C (55--F)",
        "management": "Monitor new planting regularly for signs of beetle, floating row covers can be used to protect the plants from damage but will need to be removed at bloom to allow bees to pollinate plants, applications of kaolin clay can be effective for management of small beetle populations, application of appropriate insecticides may be necessary",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 175,
    "fields": {
        "name": "Mexican bean beetle",
        "plant": 11,
        "symptoms": "Irregular patches of feeding damage on underside of leaves which causes the top surface of the leaf to dry out, giving the leaves a lacy appearance, insect will also damage flowers and small pods, pods may be damaged so badly that they drop from the plant, adult insect is an orange brown beetle with black spots, larvae are fat bodied grubs which taper at the end  and are in rows of conspicuous spines",
        "cause": "Insect",
        "comments": "Beetles can decimate bean crops, beetles overwinter as adults and undergo 2 3 generations per year",
        "management": "Some bean varieties may be less attractive hosts for the beetle, e.g. snapbeans are preferred hosts over lima beans, early varieties may escape damage form beetles  beetle populations can be reduced by remove overwintering sites such as brush and leaves on the ground, handpick larvae and adults, brush eggs from leaves and destroy, apply insecticidal soap to leaf undersides if infestation is heavy",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 176,
    "fields": {
        "name": "Brown spot",
        "plant": 11,
        "symptoms": "Upper leaves have light purple discoloration and a leathery appearance and bronzing of leaves may occur, red purple angular or irregularly shaped lesions develop on both the upper and lower leaf surfaces and may coalesce to form large necrotic patches, multiple infections can cause chlorosis and defoliation of the plants, on petioles and stems, sunken red purple lesions may develop and upper leaves appear blighted.",
        "cause": "Fungus",
        "comments": "Disease emergence favors warm, wet weather which promotes sporulation of the fungus, dry weather prevent the spread of the disease",
        "management": "Plow crop residue into soil after harvest, plant soybean varieties that are less suceptible to the disease, rotate crops to a non susceptible crop for at least one year, apply an appropriate foliar fungicide to protect plants from bloom to pod fill",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 177,
    "fields": {
        "name": "Cercospora leaf blight",
        "plant": 11,
        "symptoms": "Upper leaves turning yellow, purple red lesions are present on leaves and coalesce to give the leaves a bronzed appearance, leaves develop a leathery texture, severe infections give leaves a blighted appearance and cause them to drop from the plant",
        "cause": "Fungus",
        "comments": "Disease development id favored by warm temperatures and high humidity",
        "management": "No soybean varieties are immune to the disease but some have more resistance than others and can give some degree of control, crop debris should be plowed into soil following harvest to reduce build up of inoculum",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 178,
    "fields": {
        "name": "Charcoal rot",
        "plant": 11,
        "symptoms": "Discoloration of stem at soil line, cankers on stem may spread upwards, leaves may wilt and drop from plant, numerous small black sclerota (fungal fruiting bodies) develop in affected tissues and can be used to diagnose the disease",
        "cause": "Fungus",
        "comments": "Fungus had a wide host range and affects beans, tobacco, cowpea, pigeon pea and many other crops, disease is primarily spread via microsclerota in the soil",
        "management": "Organic soil amendments such as the addition of manure or neemcake can be used to reduce levels of inoculum in the soil",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 179,
    "fields": {
        "name": "Downy mildew",
        "plant": 11,
        "symptoms": "Yellow or pale green spots on upper surfaces of leaves which enlarge and coalesce to form yellow patches, lesions may turn gray brown to dark brown with a yellow margin, fuzzy tufts of gray purple mold develop on lesions on underside of leaves, infection of pods can cause seeds to be covered in masses of white mycelia with pods showing no external symptoms",
        "cause": "Fungus",
        "comments": "Disease emergence favors warm temperatures and periods of high humidity",
        "management": "Treat seeds with an appropriate fungicide prior to planting, plow soybean residue into soil after harvest, grow soybean varieties which are resistant to the disease where possible, rotate crop away from soybean for a one year period",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 180,
    "fields": {
        "name": "Frogeye leaf spot",
        "plant": 11,
        "symptoms": "Angular gray spots with purple to red brown edges on leaves, brown to black fungal structures developing in the center of the spot, circular or elongated lesions where inner membrane of pod contacts the seeds,",
        "cause": "Fungus",
        "comments": "Disease emergence favors warm and humid conditions",
        "management": "Plant high quality seed and use resistant varieties, rotate crop away from soybean for a period of 2 years, treat seeds with appropriate fungicide prior to planting, apply appropriate foliar fungicide",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 181,
    "fields": {
        "name": "Phytophthora rot",
        "plant": 11,
        "symptoms": "Susceptible varieties of soybean may have water soaked stems and yellowing leaves, yellowing occurs between leaf veins and along leaf margins, upper leaves of plant become chlorotic and wilted, tolerant soybean varieties may show stunted growth and slight yellowing",
        "cause": "Oomycete",
        "comments": "Disease emergence favors heavy, water saturated soil, flooded soil within 1 week of planting is most conducive to disease development",
        "management": "Plant soybean varieties that are resistant to the disease   ensure variety is resistant to all races of fungus present in the field, treat seeds with an appropriate fungicide prior to planting, plant soybean in soild with good drainage",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 182,
    "fields": {
        "name": "Healthy",
        "plant": 11,
        "symptoms": "Soybean, Glycine max, is an herbaceous annual plant in the family Fabaceae grown for its edible seeds. The soybean plant is usually an erect bush with woody stems and alternately arranged leaves. The leaves possess three individual leaflets which are oval or lance like in shape, growing to a length of 3-10 cm (1.2-4.0 in). The soybean plant produces small white or purple flowers and curved seed pods which are 3-15 cm (1.2-6 in) in length and can contain between 1 and 5 seeds. The seeds can be a variety of colors including yellow, green, brown, black or a mottled combination. Soybean is an annual plant, surviving only one growing season and can reach heights of 0.2-1.5 m (0.7-1.4 ft). Soybean may also be referred to as soyabean or soya and originates from Northeast China.",
        "cause": "Nil",
        "comments": "Nil",
        "management": "Nil",
        "image": "soybean_healthy.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 183,
    "fields": {
        "name": "Alternaria leaf blight",
        "plant": 12,
        "symptoms": "Small, yellow brown spots with a yellow or green halo which first appear on the oldest leaves, as the disease progresses, lesions expand and become large necrotic patches, often with concentric patternation, lesions coalesce, leaves begin to curl and eventually die.",
        "cause": "Fungus",
        "comments": "Disease is prevalent in growing areas where temperatures are high and rainfall is frequent.",
        "management": "Cucurbits should be rotated with another crop every 2 years to reduce levels of inoculum, crop debris should be removed from the field as quickly as possible after harvest or plowed deeply into the soil, applications of appropriate protective fungicides can help to slow the development of the disease, water plants from the base rather than from above to reduce periods of leaf wetness which are conducive to the development and spread of disease.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 184,
    "fields": {
        "name": "Alternaria leaf spot (Brown spot)",
        "plant": 12,
        "symptoms": "Initial symptoms appear as necrotic flecks on leaves with chlorotic halos, as the disease progresses, the flecks grow into spots which may join together into large, roughly circular lesions, if infestation is severe, leaves begin to turn yellow and die.",
        "cause": "Fungus",
        "comments": "Pathogen survives between growing season on crop debris.",
        "management": "Crops debris should be removed from the field or plowed deeply into the soil after harvest, applications of appropriate protective fungicides can hep reduce the incidence of the disease.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 185,
    "fields": {
        "name": "Cercospora leaf spot",
        "plant": 12,
        "symptoms": "Initial symptoms of disease occur on older leaves as small spots with light to tan brown centers, as the disease progresses, the lesions enlarge to cover large areas of the leaf surface, lesions may have a dark border and be surrounded by a chlorotic area, the centers of the lesions may become brittle and crack",
        "cause": "Fungus",
        "comments": "Fungus survives on plant debris, spread by wind and water splash, occurs mainly in tropical and subtropical growing regions",
        "management": "Any diseased plants should be removed and destroyed to prevent further spread, crop debris should be removed after harvest or plowed deeply into the soil to reduce inoculum",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 186,
    "fields": {
        "name": "Downy mildew",
        "plant": 12,
        "symptoms": "Small yellow areas on the upper leaf surface, brown lesions with irregular margins, gray mold on lower leaf surface.",
        "cause": "Fungus",
        "comments": "Disease emergence favored by moist conditions.",
        "management": "Do not overcrowd plants, avoid overhead irrigation, water plants from base, apply appropriate fungicide.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 187,
    "fields": {
        "name": "Fusarium crown and foot rot",
        "plant": 12,
        "symptoms": "Wilting of leaves progresses to wilting of entire plant and plant dies within a few days, distinctive necrotic rot of crown and upper taproot when plant is uprooted, plant breaks easily below soil line",
        "cause": "Fungus",
        "comments": "Fungus can survive in soil for 2 3 years",
        "management": "Plant fungicide treated seed, rotate crops on 4 year rotation",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 188,
    "fields": {
        "name": "Gummy stem blight",
        "plant": 12,
        "symptoms": "Brown or tan spots of various sizes on leaves, leaves covered with lesions, stems splitting and forming cankers, wounds exude a brown, gummy substance, wilting vines, death of stems",
        "cause": "Fungus",
        "comments": "Disease may be seed borne",
        "management": "Use disease free seed, treat seeds prior to planting, rotate crops every 2 years",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 189,
    "fields": {
        "name": "Powdery mildew",
        "plant": 12,
        "symptoms": "White powdery growth on the upper surfaces of leaves and stems, infected areas stunted and distorted.",
        "cause": "Fungi",
        "comments": "Disease emergence favored by dry weather and high relative humidity.",
        "management": "Plant in sites with good air circulation and sun exposure, do not overcrowd plants, sanitize equipment regularly.",
        "image": "squash_powdery_mildew.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 190,
    "fields": {
        "name": "Septoria leaf spot",
        "plant": 12,
        "symptoms": "Initial symptoms of disease are small dark water soaked spots on the leaves which turn beige to white in dry conditions, lesions develop thin brown borders and the centers may become brittle and crack, small white spots may erupt on the surface of infected butternut and acorn squash and pumpkin fruit",
        "cause": "Fungus",
        "comments": "Pathogen can survive on crop debris for periods in excess of 1 year",
        "management": "Scout plants during cool wet conditions for any sign of spots, early application of an appropriate protective fungicide can help limit the development of the disease if spots are found, cucurbits should be rotated with other crops every 2 years to prevent the build up of inoculum, crop debris should be removed and destroyed after harvest",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 191,
    "fields": {
        "name": "Verticillium wilt",
        "plant": 12,
        "symptoms": "Symptoms generally appear after fruit set, chlorotic leaves which develop necrotic areas, leaves collapsing, symptoms only on one side of vine, discoloration of vascular tissue in roots",
        "cause": "Fungus",
        "comments": "Fungus can survive in soil for many years, disease emergence favored by cool or mild weather in Spring",
        "management": "Do not plant in areas where other susceptible crops have been grown previously, delay planting until temperatures are warmer",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 192,
    "fields": {
        "name": "Angular leaf spot",
        "plant": 12,
        "symptoms": "Small water soaked lesions on leaves which expand between leaf veins and become angular in shape, in humid conditions, lesions exude a milky substance which dries to form a white crust on or beside lesions, as the disease progresses, lesions turn tan and may have yellow/green edges, the centers of the lesions dry and may drop out leaving a hole in the leaf",
        "cause": "Bacterium",
        "comments": "Spread through infected seed, splashing rain, insects and movement of people between plants, bacterium overwinters in crop debris and can survive for 2.5 years",
        "management": "Use disease free seed, do not grow plants in field where cucurbits have been grown in the previous 2 years, protective copper spray may help reduce incidence of disease in warm, humid climates, plant resistant varieties",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 193,
    "fields": {
        "name": "Bacterial leaf spot",
        "plant": 12,
        "symptoms": "Dark, angular lesions on leaves, leaf lesions may coalesce and cause severely blighted foliage, water soaked lesions  which enlarge and develop into tan scabs, or blisters, on the fruit, blisters eventually flatten as they reach their full size",
        "cause": "Bacterium",
        "comments": "Disease can spread rapidly in a field, disease can be introduced through contaminated seed",
        "management": "Avoid overhead irrigation, rotate crops away from cucurbit species to prevent disease building up, use new seed each planting as saved seed is more likely to carry bacteria, apply appropriate protective fungicides, copper containing fungicides generally provide good control",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 194,
    "fields": {
        "name": "Bacterial wilt",
        "plant": 12,
        "symptoms": "Severely wilted vines, leaves appear dark green, dark discoloration on leaves and stems, rapid plant death",
        "cause": "Bacterium",
        "comments": "Spread by striped or spotted cucumber beetles, disease can be confirmed by cutting the stem and slowly pulling the two ends apart   infected plants will ooze strings of bacterial exudate",
        "management": "Control cucumber beetle populations on plants, hand pick adult beetles and destroy, soil and foliar application of appropriate insecticides may help to control populations",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 195,
    "fields": {
        "name": "Aster yellows",
        "plant": 12,
        "symptoms": "Foliage turning yellow, secondary shoots begin growing prolifically, stems take on a rigid, upright growth habit, leaves are often small in size and distorted, may appear thickened, flowers are often disfigured and possess conspicuous leafy bracts, fruits are small and pale in color",
        "cause": "Phytoplasma",
        "comments": "Disease is transmitted by leafhoppers and can cause huge losses in cucurbit crops",
        "management": "Remove any infected plants from the field to reduce spread, control weeds in and around the field that may act as a reservoir for the phytoplasma, protect plants from leaf hopper vectors with row covers",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 196,
    "fields": {
        "name": "Blossom end rot",
        "plant": 12,
        "symptoms": "Symptoms first appear on immature fruits as small light brown spots close to the blossom end of the fruit, as fruit grow, the spots enlarge, resulting in dark leathery lesions sunken into the fruit",
        "cause": "Nutritional disorder",
        "comments": "",
        "management": "Blossom end rot is caused by a lack of calcium in the developing fruit and it occurs when the uptake of nutrients to the plant is disrupted, factors which disrupt nutrient uptake include drought, root damage or high soil salinity, application of excess nitrogen fertilizer may also contribute to the development of blossom end rot as it promotes vigorous growth of vegetative tissues and depletion of calcium in the soil, watering plants evenly and regularly reduces the incidence of blossom end rot",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 197,
    "fields": {
        "name": "Cucumber mosaic",
        "plant": 12,
        "symptoms": "Plants are severely stunted, foliage is covered in distinctive yellow mosaic, leaves of plant curl downwards and leaf size is smaller than normal, flowers on infected plants may be deformed with green petals, fruits become distorted and are small in size, fruit is often discolored.",
        "cause": "Virus",
        "comments": "Transmitted by aphids, virus has an extensive host range, can be mechanically transmitted via tools etc.",
        "management": "Control of the virus is largely dependant on the control of the aphid vectors, reflective mulches can deter aphid feeding, aphid outbreaks can be treated with mineral oils or insecticidal soap applications, some resistant varieties are available.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 198,
    "fields": {
        "name": "Cucurbit yellow stunting disorder virus",
        "plant": 12,
        "symptoms": "The symptoms generally appear on the older leaves first. Initially the symptom appears as chlorotic spotting which leads to intervenial chlorosis and followed by severe yellowing. The infected leaves may roll upward and become brittle. Also the infected plant may appear stunted.",
        "cause": "Virus",
        "comments": "The virus is mainly transmitted by whitefly Bemisia tabaci. The host range is restricted to the Cucurbitaceae (watermelon, melon, cucumber, squash, courgette etc.,).",
        "management": "Grow virus free and whiteflies free seed materials. During the growing season use yellow sticky traps to monitor and control whiteflies. Remove the infected plants and burn them. Keep the field free from weeds. In case severe infestation of whiteflies, use suitable insecticides. After a growing season remove the crop debris, volunteer plants and destroy them.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 199,
    "fields": {
        "name": "Squash mosaic",
        "plant": 12,
        "symptoms": "Symptoms vary with variety being grown but plants can show symptoms which include include green veinbanding, mottled leaves, blisters, ring spots or potruding veins at leaf margins, some squash varieties may develop leaf enations, infected plants are often stunted and fruits may be malformed with mottled skin",
        "cause": "Virus",
        "comments": "Virus can be transmitted through infected seed and spread by striped cucumber beetles",
        "management": "Use only certified disease free seed",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 200,
    "fields": {
        "name": "Watermelon mosaic",
        "plant": 12,
        "symptoms": "Symptoms vary widely depending on species, cultivar, virus strain and environmental conditions, symptoms on leaves may include green mosaic patternation, green vein banding, chlorotic rings and disfigured leaves, infected fruits may develop green spots   particularly if fruit is yellow",
        "cause": "Virus",
        "comments": "Virus is found in almost all Cucurbit growing regions in the world, virus is spread by over 20 aphid species",
        "management": "Use of resistant varieties can greatly reduce virus incidence, treatments that control populations of aphid vectors can also reduce the incidence of the virus, spraying plants with mineral oils or insecticidal soaps can help to reduce aphid numbers",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 201,
    "fields": {
        "name": "Zucchini yellow mosaic",
        "plant": 12,
        "symptoms": "Infected plants are severely stunted and leaves can exhibit a variety of symptoms including yellow mosaic patternation, severe deformation, blistering, reduced size and necrosis, fruits are deformed",
        "cause": "Virus",
        "comments": "DIsease can cause devastating epidemics when present",
        "management": "Use of resistant varieties, where available, is usually the most effective method of controlling the virus, control of aphid populations on the plants can be achieved through the use of mineral oils and insecticidal soaps but is rarely effective at controlling the virus",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 202,
    "fields": {
        "name": "Phytophthora crown and root rot",
        "plant": 12,
        "symptoms": "Sudden and permanent wilting of plant, leaves do not change color, plant death within a few days, roots and stem close to soil line discolored light to dark brown, plant easily removed from soil",
        "cause": "Oomycete",
        "comments": "Fungus can be spread through air, disease emergence favors high temperatures and water saturated soil",
        "management": "Efficient management of water to avoid saturated soil, avoid long periods of irrigation",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 203,
    "fields": {
        "name": "Aphids (Peach aphid, Melon aphid)",
        "plant": 12,
        "symptoms": "Small soft bodied insects on underside of leaves and/or stems of plant, usually green or yellow in color, but may be pink, brown, red or black depending on species and host plant, if aphid infestation is heavy it may cause leaves to yellow and/or distorted, necrotic spots on leaves and/or stunted shoots, aphids secrete a sticky, sugary substance called honeydew which encourages the growth of sooty mold on the plants",
        "cause": "Insects",
        "comments": "Distinguishing features include the presence of cornicles (tubular structures) which project backwards from the body of the aphid, will generally not move very quickly when disturbed",
        "management": "If aphid population is limited to just a few leaves or shoots then the infestation can be pruned out to provide control, check transplants for aphids before planting, use tolerant varieties if available, reflective mulches such as silver colored plastic can deter aphids from feeding on plants, sturdy plants can be sprayed with a strong jet of water to knock aphids from leaves, insecticides are generally only required to treat aphids if the infestation is very high   plants generally tolerate low and medium level infestation, insecticidal soaps or oils such as neem or canola oil are usually the best method of control, always check the labels of the products for specific usage guidelines prior to use",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 204,
    "fields": {
        "name": "Armyworms (Beet armyworm, Western striped armyworm)",
        "plant": 12,
        "symptoms": "Singular, or closely grouped circular to irregularly shaped holes in foliage, heavy feeding by young larvae leads to skeletonized leaves, shallow, dry wounds on fruit, egg clusters of 50 150 eggs may be present on the leaves, egg clusters are covered in a whitish scale which gives the cluster a cottony or fuzzy appearance, young larvae are pale green to yellow in color while older larvae are generally darker green with a dark and light line running along the side of their body and a pink or yellow underside",
        "cause": "Insect",
        "comments": "Insect can go through 3---5 generations a year",
        "management": "Organic methods of controlling armyworms include biological control by natural enemies which parasitize the larvae and the application of Bacillus thuringiensis, there are chemicals available for commercial control but many that are available for the home garden do not provide adequate control of the larvae",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 205,
    "fields": {
        "name": "Cabbage looper",
        "plant": 12,
        "symptoms": "Large or small holes in leaves, damage often extensive, caterpillars are pale green with a white lines running down either side of their body, caterpillars are easily distinguished by the way they arch their body when moving, eggs are laid singly, usually on the lower leaf surface close to the leaf margin, and are white or pale green in color",
        "cause": "Insect",
        "comments": "Insects overwinter as pupae in crop debris in soil, adult insect id a dark colored moth, caterpillars have a wide host range",
        "management": "Looper populations are usually held in check by natural enemies, if they do become problematic larvae can be hand picked from the plants, an organically acceptable control method is the application of Bacillus thuringiensis which effectively kills younger larvae, chemical sprays may damage populations of natural enemies and should and should be selected carefully",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 206,
    "fields": {
        "name": "Cucumber beetles (Western striped cucumber beetle, Western spotted cucumber beetle, Banded cucumber beetle)",
        "plant": 12,
        "symptoms": "Stunted seedling, damaged leaves, stems and/or petioles, reduced plant stand, plants may exhibit symptoms of bacterial wilt, scars on fruit caused by beetle feeding damage, adult beetles are brightly colored with either a green yellow background and black spots or alternating black and yellow stripes.",
        "cause": "Insect",
        "comments": "Beetles overwinter in soil and leaf litter and emerge from soil when temperatures begin to reach and exceed 12.7--C (55--F).",
        "management": "Monitor new planting regularly for signs of beetle, floating row covers can be used to protect the plants from damage but will need to be removed at bloom to allow bees to pollinate plants, applications of kaolin clay can be effective for management of small beetle populations, application of appropriate insecticides may be necessary.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 207,
    "fields": {
        "name": "Cutworms",
        "plant": 12,
        "symptoms": "Stems of young transplants or seedlings may be severed at soil line, if infection occurs later, irregular holes are eaten into the surface of fruits, larvae causing the damage are usually active at night and hide during the day in the soil at the base of the plants or in plant debris of toppled plant, larvae are 2.5---5.0 cm (1---2 in) in length, larvae may exhibit a variety of patterns and coloration but will usually curl up into a C shape when disturbed.",
        "cause": "Insects",
        "comments": "Cutworms have a wide host range and attack vegetables including asparagus, bean, cabbage and other crucifers, carrot, celery, corn, lettuce, pea, pepper, potato and tomato.",
        "management": "Remove all plant residue from soil after harvest or at least two weeks before planting, this is especially important if the previous crop was another host such as alfalfa, beans or a leguminous cover crop, plastic or foil collars fitted around plant stems to cover the bottom 3 inches above the soil line and extending a couple of inches into the soil can prevent larvae severing plants, hand pick larvae after dark, spread diatomaceous earth around the base of the plants (this creates a sharp barrier that will cut the insects if they try and crawl over it), apply appropriate insecticides to infested areas of garden or field if not growing organically.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 208,
    "fields": {
        "name": "Flea beetles",
        "plant": 12,
        "symptoms": "Small holes or pits in leaves that give the foliage a characteristic ---shothole--- appearance, young plants and seedlings are particularly susceptible, plant growth may be reduced, if damage is severe the plant may be killed, the pest responsible for the damage is a small (1.5---3.0 mm) dark colored beetle which jumps when disturbed, the beetles are often shiny in appearance.",
        "cause": "Insects",
        "comments": "Younger plants are more susceptible to flea beetle damage than older ones, older plants can tolerate infestation, flea beetles may overwinter on nearby weed species, in plant debris or in the soil, insects may go through a second or third generation in one year.",
        "management": "In areas where flea beetles are a problem, floating row covers may have to be used prior to the emergence of the beetles to provide a physical barrier to protect young plants, plant seeds early to allow establishment before the beetles become a problem   mature plants are less susceptible to damage, trap crops may provide a measure of control   cruciferous plants are best, application of a thick layer of mulch may help prevent beetles reaching surface, application on diamotecoeus earth or oils such as neem oil are effective control methods for organic growers, application of insecticides containing carbaryl, spinosad, bifenthrin and permethrin can provide adequate control of beetles for up to a week but will need reapplied.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 209,
    "fields": {
        "name": "Leaf miners",
        "plant": 12,
        "symptoms": "Thin, white, winding trails on leaves, heavy mining can result in white blotches on leaves and leaves dropping from the plant prematurely, early infestation can cause fruit yield to be reduced, adult leafminer is a small black and yellow fly which lays its eggs in the leaf, larave hatch and feed on leaf interior",
        "cause": "Insect",
        "comments": "Mature larvae drop from leaves into soil to pupate, entire lifecycle can take as little as 2 weeks in warm weather, insect may go through 7 to 10 generations per year",
        "management": "Check transplants for signs of leafminer damage prior to planting, remove plants from soil immediately after harvest, only use insecticides when leafminer damage has been identified as unnecessary spraying will also reduce populations of their natural enemies",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 210,
    "fields": {
        "name": "Squash bug",
        "plant": 12,
        "symptoms": "Speckled leaves which turn yellow and brown, wilting plants, dieback of runners, blemished fruit, fruit death, adult squash bugs are often misidentified as stink bugs, they are grey black in color with orange and black stripes on the edges of their abdomen, nymphs are greenish gray in color and often covered in white powder, female squash bugs lay conspicuous copper colored eggs on the undersides of the leaves",
        "cause": "Insect",
        "comments": "Squash bugs overwinter in crop debris or under rocks and stones",
        "management": "Destroy all crops residue as soon as possible after harvest or on plant death, apply row covers at planting, apply insecticidal soap or appropriate insecticide",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 211,
    "fields": {
        "name": "Squash vine borer",
        "plant": 12,
        "symptoms": "Wilting plants, holes in vines or at base of petioles, green frass (insect excrement) visible around holes",
        "cause": "Insect",
        "comments": "Insect overwinters in soil as larvae or pupae and adults emerge in spring, adults lay eggs on leaves and larvae burrow intro stems to feed",
        "management": "Apply appropriate insecticide if eggs are found on leaves, plow plants into soil after harvest",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 212,
    "fields": {
        "name": "Stinkbugs (Various)",
        "plant": 12,
        "symptoms": "Dark colored pinpricks on fruit surrounded by a lighter area that turns yellow or remains light green, stink bugs often carry pathogens in their mouthparts which can cause secondary infections and decay of fruit, adult insect is shield shaped and brown or green in color, may have pink, red or yellow markings, eggs are drum shaped and laid in clusters on the leaves, larvae resemble the adults but are smaller",
        "cause": "Insect",
        "comments": "Adult insects overwinter under leaves, on legumes, blackberries or on certain weeds such as mustard or Russian thistle",
        "management": "Remove weeds around crop which may act as overwintering sites for stink bugs and practice good weed management throughout the year, organically accepted control methods include the use of insecticidal soaps, kaolin clay and preservation of natural enemies, chemical treatments are not recommended for tomatoes that are to be processed for paste or canning unless secondary infections with other pathogens are a concern",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 213,
    "fields": {
        "name": "Thrips (Western flower thrips, etc.)",
        "plant": 12,
        "symptoms": "If population is high leaves may be distorted, leaves are covered in coarse stippling and may appear silvery, leaves speckled with black feces, insect is small (1.5 mm) and slender and best viewed using a hand lens, adult thrips are pale yellow to light brown and the nymphs are smaller and lighter in color",
        "cause": "Insect",
        "comments": "Transmit viruses such as Tomato spotted wilt virus, once acquired, the insect retains the ability to transmit the virus for the remainder of its life",
        "management": "Avoid planting next to onions, garlic or cereals where very large numbers of thrips can build up, use reflective mulches early in growing season to deter thrips, apply appropriate insecticide if thrips become problematic",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 214,
    "fields": {
        "name": "Healthy",
        "plant": 12,
        "symptoms": "Squash is the collective name given to several species of plant in the genus Cucurbita, including C. maxima, C. mixta , C. moschata and C. pepo, which are widely grown for their edible fruit. Squash plants are are herbaceous annual plants which are either trailing vines or bush like in morphology. Vines generally have large, lobed leaves and long vines which can climb by attaching to surfaces with their tendrils. Bushes generally take up less space than the sprawling vine types and may have prickly leaves. Squash plants produce yellow or orange flowers and green, white or yellow fruit in a variety of shapes and sizes with smooth or ridged skin. Vining squash varieties can reach several meters in length and, as annuals, survive only one growing season. Squash originate from North and Central America and are referred to by their cultivar name e.g. acorn squash, butternut squash, spaghetti squash, zucchini, banana squash, hubbard squash and buttercup squash. ",
        "cause": "Nil",
        "comments": "Nil",
        "management": "Nil",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 215,
    "fields": {
        "name": "Angular leaf spot",
        "plant": 13,
        "symptoms": "Very small water soaked lesions on lower surfaces of leaves which enlarge to form dark green or translucent angular spots which ooze bacteria, lesions may coalesce to form reddish spots with a chlorotic halo.",
        "cause": "Bacterium",
        "comments": "Bacterium survives in crop debris and overwintering plants, can survive for long periods on plant debris but can not live free in soil, bacteria can be spread by splashing water.",
        "management": "Use only certified planting stock, rotate crops and avoid overhead irrigation, chemical controls generally ineffective.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 216,
    "fields": {
        "name": "Leaf scorch",
        "plant": 13,
        "symptoms": "Irregular dark purple or brown blotches on upper leaf surface which may colaesce to produce large purplish brown patches, tissue between blotches may turn purple or red, lesions may also develop on flowers and fruits, affected petals may wither and drop from plant, lesions may girdle peduncles causing death of fruit.",
        "cause": "Fungus",
        "comments": "Disease emergence favored by wet foliage for extended periods of time.",
        "management": "Plant resistant varieties, regular renewal of plants, plant in an area with good air circulation and drainage in full sun, remove all foliage from plants at harvest, application of appropriate foliar fungicide may be required to provide control.",
        "image": "strawberry_leaf_scorch.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 217,
    "fields": {
        "name": "Anthracnose",
        "plant": 13,
        "symptoms": "Leaf spot\n\nRound black or light gray lesions on leaves, numerous spots may develop but leaves do not die.\n\n\n\nRunners and petioles\n\nDark brown or black sunken, circular lesions on stems, petioles and runners, plants may be stunted and yellow, plants may wilt and collapse, internal tissues discolored red.\n\n\n\nCrown rot\n\nYoungest plant leaves wilt during water stress in early afternoon and recover in the evening, wilting progresses to entire plant, plant death, reddish brown rot or streak visible when crown is cut lengthways.\n\n\n\nBud rot\n\nDamp, firm dark brown to black rot on buds, plants with single buds may die, plants with multiple crown may wilt as disease progresses .\n\n\n\nFlower blight\n\nDark lesion extending down pedicel which girdles the stem and kills the flower, flowers dry out and die, infection after pollination may result in small, hard, deformed fruit.\n\n\n\nFruit rot\n\nLight brown water soaked spots on ripening fruit which develop into firm dark brown or black round lesions.",
        "cause": "Fungi",
        "comments": "Plants that are planted in infected soil become infected by splashing water and soil, fungus survives in soil for up to 9 months.",
        "management": "Fumigating soil may help reduce soil inoculum, solarizing soil may destroy soil inoculum, rotate to non host crops if funigation or solarization is not possible, wash all soil from plant crowns prior to planting, weed around plants regularly, plant only disease free transplants, do not use excessive amounts of nitrogen fertilizer,",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 218,
    "fields": {
        "name": "Gray mold (Botrytis fruit rot, Blossom blight)",
        "plant": 13,
        "symptoms": "Blossoms turning brown and dying, misshapen fruit, patches of rot on fruit which enlarge and often affects entire fruit, masses of gray mycelium on surface of rotting tissue, no leakage of fluid from fruit, fruit becomes dried and mummified.",
        "cause": "Fungus",
        "comments": "Disease emergence favored by extended periods of high humidity or leaf wetness during flowering and moderate temperatures.",
        "management": "Remove and destroy all dead or infected material, remove decaying fruit, grow fruit under plastic, use plastic mulch to reduce fruit contact with soil, apply appropriate fungicides, plant in areas where wind will rapidly dry wet plants and fruit, plow crop debris into soil after harvest.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 219,
    "fields": {
        "name": "Leaf spot (Mycosphaerella leaf spot)",
        "plant": 13,
        "symptoms": "Small round or irregular deep purple lesions on upper surfaces of leaves which enlarge and develop a gray white center, lesions can grow large in susceptible varieties and the center of the lesion remains brown, lesions may also develop on fruit, petioles and stolons.",
        "cause": "Fungus",
        "comments": "Disease spread by splashing water.",
        "management": "Plant disease free stock, apply protective foliar fungicide.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 220,
    "fields": {
        "name": "Phomopsis leaf blight",
        "plant": 13,
        "symptoms": "One to five circular, red purple spots on leaflet, distinct zonal patterns on leaves with dark brown center surrounded by lighter brown and then purple, red or yellow, dark elongated and sunken lesions on petioles, stolons and fruit trusses.",
        "cause": "Fungus",
        "comments": "Disease occurs worldwide and can cause severe defoliation.",
        "management": "Specific control measures not developed, remove older leaves after harvest, application of foliar fungicides after harvest may help control disease.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 221,
    "fields": {
        "name": "Powdery mildew",
        "plant": 13,
        "symptoms": "Patches of fuzzy white fungal growth on lower leaf surface which enlarge and coalesce, leaf edges curling upwards, purple red blotches on lower leaf surface, deformed fruit may be produced if flowers become infected, severe infections may cause the plant to produce no fruit",
        "cause": "Fungus",
        "comments": "Fungus overwinters on leaves, spores spread by wind",
        "management": "Apply protective fungicide e.g. sulfur at first signs of disease, plant resistant varieties, avoid overhead irrigation, remove dead leaves at harvest to decrease overwintering mycelium",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 222,
    "fields": {
        "name": "Red stele (Red core)",
        "plant": 13,
        "symptoms": "Stunted plant growth, old leaves withered and may have red yellow or orange tinge, new leaves small, little or no fruit produced and few runners, reddish discoloration of root core which may extend into the crown.",
        "cause": "Oomycete",
        "comments": "Can survive in cuttings and spread to new plants, disease emergence favored by wet or moist soils and cool, wet weather conditions, younger plants generally show more damage to roots.",
        "management": "Plant only certified stock, avoid transferring soil and water contaminates sites, avoid planting in areas with a history of red stele, plant in raised beds to improve drainage, if disease is present apply appropriate fungicide.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 223,
    "fields": {
        "name": "Slugs",
        "plant": 13,
        "symptoms": "Irregularly shaped holes in leaves and stems,rough holes in ripe fruit, if infestation is severe, leaves may be shredded, slime trails present on rocks, walkways, soil and plant foliage, several slug and snail species are common garden pests, slugs are dark gray to black in color and can range in size from 2.5 to 10 cm (1 4 in).",
        "cause": "Mollusc",
        "comments": "Slugs prefer moist, shaded habitats and will shelter in weeds or organic trash, adults may deposit eggs in the soil throughout the season, damage to plants can be extensive.",
        "management": "Practice good garden sanitation by removing garden trash, weeds and plant debris to promote good air circulation and reduce moist habitat for slugs, handpick slugs at night to decrease population, spread wood ashes or eggshells around plants, attract molluscs by leaving out organic matter such as lettuce or grapefruit skins, destroy any found feeding on lure, sink shallow dishes filled with beer into the soil to attract and drown the molluscs, chemical controls include ferrous phosphate for organic gardens and metaldehyde (e.g. Buggeta) and carbaryl (e.g Sevin bait) for non organic growers.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 224,
    "fields": {
        "name": "Aphids (Peach aphid, Potato aphid, Melon aphid, Strawberry aphid)",
        "plant": 13,
        "symptoms": "Small soft bodied insects on underside of leaves and/or stems of plant, usually green or yellow in color, but may be pink, brown, red or black depending on species and host plant, if aphid infestation is heavy it may cause leaves to yellow and/or distorted, necrotic spots on leaves and/or stunted shoots, aphids secrete a sticky, sugary substance called honeydew which encourages the growth of sooty mold on the plants.",
        "cause": "Insects",
        "comments": "Aphids transmit several viruses which can be very damaging to strawberry, the insects rarely reach a high enough population to cause severe damage directly but the spread of viruses is a major concern in strawberry production.",
        "management": "If aphid population is limited to just a few leaves or shoots then the infestation can be pruned out to provide control, check transplants for aphids before planting, use tolerant varieties if available, reflective mulches such as silver colored plastic can deter aphids from feeding on plants, sturdy plants can be sprayed with a strong jet of water to knock aphids from leaves, insecticides are generally only required to treat aphids if the infestation is very high   plants generally tolerate low and medium level infestation, insecticidal soaps or oils such as neem or canola oil are usually the best method of control, always check the labels of the products for specific usage guidelines prior to use.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 225,
    "fields": {
        "name": "Armyworm (Beet army worm, southern armyworm)",
        "plant": 13,
        "symptoms": "Singular, or closely grouped circular to irregularly shaped holes in foliage, heavy feeding by young larvae leads to skeletonized leaves, shallow, dry wounds on fruit, egg clusters of 50 150 eggs may be present on the leaves, egg clusters are covered in a whitish scale which gives the cluster a cottony or fuzzy appearance, young larvae are pale green to yellow in color while older larvae are generally darker green with a dark and light line running along the side of their body and a pink or yellow underside.",
        "cause": "Insect",
        "comments": "Insect can go through 3---5 generations a year.",
        "management": "Organic methods of controlling armyworms include biological control by natural enemies which parasitize the larvae and the application of Bacillus thuringiensis, there are chemicals available for commercial control but many that are available for the home garden do not provide adequate control of the larvae.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 226,
    "fields": {
        "name": "Japanese beetle",
        "plant": 13,
        "symptoms": "Leaves skeletonized (only veins remaining), flowers and buds damaged, plant damage may be extensive, adult insect is a metallic green bronze beetle with tufts of white hair protruding from under wing covers on each side of the body, adult beetles are approximately 13 mm in length, larvae are cream white grubs which develop in the soil.",
        "cause": "Insect",
        "comments": "One beetle generation every 1 2 years, pheromone traps may actually attract more beetles to home gardens and should generally be avoided, beetle overwinters as larvae in soil, beetle has an extensive range of over 300 host plants.",
        "management": "If beetles were a problem in the previous year, use floating row covers to protect plants or spray kaolin clay, adult beetles can be hand picked from plants and destroyed by placing in soapy water, parasitic nematodes can be applied to soil to reduce the number of overwintering grubs, insecticidal soaps or neem oil can help reduce beetle populations.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 227,
    "fields": {
        "name": "Loopers (Cabbage looper)",
        "plant": 13,
        "symptoms": "Large or small holes in leaves, damage often extensive, caterpillars are pale green with a white lines running down either side of their body, caterpillars are easily distinguished by the way they arch their body when moving, eggs are laid singly, usually on the lower leaf surface close to the leaf margin, and are white or pale green in color.",
        "cause": "Insect",
        "comments": "Insects overwinter as pupae in crop debris in soil, adult insect id a dark colored moth, caterpillars have a wide host range.",
        "management": "Loopers populations are usually held in check by natural enemies, if they do become problematic larvae can be hand picked from the plants, an organically acceptable control method is the application of Bacillus thuringiensis which effectively kills younger larvae, chemical sprays may damage populations of natural enemies and should and should be selected carefully.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 228,
    "fields": {
        "name": "Thrips (Western flower thrips)",
        "plant": 13,
        "symptoms": "Damage to strawberry flowers, including browning of anthers and stigmas, insects may be numerous on fruit and may cause bronzing around the cap, insect is small (1.5 mm) and slender and best viewed using a hand lens, adult thrips are pale yellow to light brown and the nymphs are smaller and lighter in color.",
        "cause": "Insect",
        "comments": "Thrips population builds up in spring on weeds and a number of crops and migrate to strawberries when crops are harvested or when weeds dry up.",
        "management": "Avoid planting next to onions, garlic or cereals where very large numbers of thrips can build up, use reflective mulches early in growing season to deter thrips, apply appropriate insecticide if thrips become problematic.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 229,
    "fields": {
        "name": "Weevils (Strawberry root weevil, Rough strawberry root weevil, Black vine weevil)",
        "plant": 13,
        "symptoms": "Notches in leaves of plants, plants stunted and dark in color with closely bunched leaves, adult insect is a snot nosed beetle which can vary in color from dark to light brown depending on species, larvae are cream white colored grubs which feed on roots below ground.",
        "cause": "Insect",
        "comments": "Damage within a field usually affects a circle of plants, weevil attack is sporadic and can be very damaging.",
        "management": "Keep strawberry beds free of weeds and grass, avoid planting close to woodland or blackberry or elderberry which may harbor weevil populations, pesticide sprays or dusts which contain pyrethroids are effective at controlling strawberry weevils.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 230,
    "fields": {
        "name": "Spider mites (Strawberry spider mite)",
        "plant": 13,
        "symptoms": "Leaves stippled with yellow, leaves may appear bronzed, webbing covering leaves, mites may be visible as tiny moving dots on the webs or underside of leaves, best viewed using a hand lens, usually not spotted until there are visible symptoms on the plant, leaves turn yellow and may drop from plant.",
        "cause": "Arachnid",
        "comments": "Spider mites thrive in dusty conditions, water stressed plants are more susceptible to attack.",
        "management": "In the home garden, spraying plants with a strong jet of water can help reduce buildup of spider mite populations, if mites become problematic apply insecticidal soap to plants, certain chemical insecticides may actually increase mite populations by killing off natural enemies and promoting mite reproduction.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 231,
    "fields": {
        "name": "Healthy",
        "plant": 13,
        "symptoms": "Strawberry is the name given to several plant species in the genus-Fragaria, including-Fragaria vesca-(wild strawberry),-Fragaria grandiflora,-Fragaria magna,-Fragaria chiloensis-and-Fragaria ananassa-(or-Fragaria x ananassa) which are grown for their edible fruit. Strawberry is an herbaceous perennial in the family Rosaceae. The plant has a short stem and trifoliate leaves which form a crown. close to the ground. The leaves display a variety of characteristic depending on the species, some are evergreen whereas some have leaves that will die and fall off in winter. The plant produces flower stalks from the crown and the the flowers are white in color. The fruit of the plant is red and fleshy with small seeds on the outside. Strawberry can grow 20-25 cm (8-10 in) in height and has an economic life of 2-4 years before the plants are replaced. Strawberry may also be referred to as garden strawberry and the plant is grown in most northern temperate regions of the world. The first domestic hybrids were created in Europe.-",
        "cause": "Nil",
        "comments": "Nil",
        "management": "Nil",
        "image": "strawberry_healthy.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 232,
    "fields": {
        "name": "Anthracnose",
        "plant": 14,
        "symptoms": "Fruit symptoms are the most common although stem, leaves and roots can also be infected, disease causes characteristic sunken circular lesions on the fruit, the indentations on may have visible concentric brown and yellow rings, lesion centers turn tan in color as they mature and become dotted with small black fungal fruiting bodies (microsclerotia), lesions can grow very large",
        "cause": "Fungus",
        "comments": "Disease emergence favors warm weather, appears early in the spring",
        "management": "Avoid sprinkler irrigation when fruit is ripening, rotate crops with other non solanaceous plants",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 233,
    "fields": {
        "name": "Black mold",
        "plant": 14,
        "symptoms": "Disease causes the appearance of black or brown lesions on the surface of ripe fruit, lesions may be tiny flecks or may be large patches of decaying tissue, during periods of humid weather, the lesions may become covered in black, velvety spore masses.",
        "cause": "Fungus",
        "comments": "Disease is found wherever tomatoes are grown, ripe fruit become increasingly susceptible to the fungus the longer they stay on the vine after ripening.",
        "management": "Cultural control methods such as avoiding wetting the foliage when watering and harvesting fruits as soon as they are ripe can help to reduce the incidence of the disease, in areas where disease is a persistent problem, chemical control may be necessary with an appropriate fungicide, fungicide is usually applied 4 6 weeks prior to the first anticipated fruit harvest.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 234,
    "fields": {
        "name": "Early blight",
        "plant": 14,
        "symptoms": "Early blight symptoms start as oval shaped lesions with a yellow chlorotic region across the lesion, concentric leaf lesions may be seen on infected leaves, leaf tissue between veins is destroyed, severe infections can cause leaves to completely collapse, as the disease progresses leaves become severely blighted leading to reduced yield, tomato stems may become infected with the fungus leading to Alternaria stem canker, initial symptoms of of stem canker are the development of dark brown regions on the stem, stem cankers may enlarge to girdle the whole stem resulting in the death of the whole plant, brown streaks can be found in the vascular tissue above and below the canker region, fruit symptoms include small black v shaped lesions at the shoulders of the fruit (the disease is also known black shoulder), lesions may also appear on the fruit as dark flecks with concentric ring pattern, fruit lesions can seen in the field or may develop during fruit transit to the market, the lesions may have a velvety appearance caused by sporulation of the fungus",
        "cause": "Fungus",
        "comments": "Disease can spread rapidly after plants have set fruit, movement of air borne spores and contact with infested soil are causes for the spread of the disease",
        "management": "Apply appropriate fungicide at first sign of disease, destroy any volunteer solanaceous plants (tomato, potato, nightshade etc), practice crop rotation",
        "image": "tomato_early_blight.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 235,
    "fields": {
        "name": "Fusarium wilt",
        "plant": 14,
        "symptoms": "Symptoms of Fusarium wilt may first appear as yellowing and wilting of leaves on one side of the leaf midrib or plant, one sided symptoms are caused by a blockage in the vascular system supplying the symptomatic side of the plant, as the disease progresses, older leaves become necrotic and the plant begins to wilt, fruit on infected plants is smaller and yield is reduced, damage to leaves makes fruit susceptible to sunscald, stem symptoms may be mistaken for bacterial wilt but a bacterial ooze test will be negative, stem tissue becomes discolored brown",
        "cause": "Fungus",
        "comments": "Disease emergence favors warm, moist soil Fusarium wilt is not a major issue in tomato production, however, the disease can still cause minor losses",
        "management": "Plant resistant varieties, sanitize all equipment regularly, control root knot nematodes, rotate crops away from tomato for several years",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 236,
    "fields": {
        "name": "Gray mold (Botrytis blight)",
        "plant": 14,
        "symptoms": "Disease appears on tomato seedlings at or just below the soil line as a fuzzy gray brown lesion which often girdles the stem, if stem is girdled all parts of the plant above the lesion begin to wilt, infected flowers and calyxes become covered in gray spores, unripe fruit turns light brown or gray in color and rots, green fruit infected by airborne spores develop circular white rings called ---ghost spots---.",
        "cause": "Fungus",
        "comments": "Gray mold is usually associated with wounds on plants, can develop in relatively cool conditions.",
        "management": "Liming soil to increase calcium content can help to reduce plant susceptibility to gray mold, application of appropriate fungicide prior to formation of dense canopy.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 237,
    "fields": {
        "name": "Leaf Mold",
        "plant": 14,
        "symptoms": "The older leaves exhibit pale greenish to yellow spots (without distinguishable margins) on upper surface. Whereas the lower portion of this spots exhibit green to brown velvety fungal growth. As the disease progress the spots may coalesce and appear brown. The infected leaves become wither and die but stay attached to the plant. The fungus also infects flowers and fruits. The affected flowers become black and drop off. The affected fruit intially shows smooth black irregular area on the stem end but later it becomes sunken, leathery and dry.",
        "cause": "Fungus",
        "comments": "The disease is favored by high relative humidity. Also a common disease in green house tomato crop.",
        "management": "Grow available resistant varieties. Avoid leaf wetting and overhead application of water. Follow proper spacing to provide good air circulation around the plants. Remove the infected plant debris and burn them. If the disease is severe scary suitable fungicide.",
        "image": "tomato_leaf_mold.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 238,
    "fields": {
        "name": "Septoria leaf spot",
        "plant": 14,
        "symptoms": "Symptoms may occur at any stage of tomato development and begin as small, water soaked spots or circular grayish white spots on the underside of older leaves, spots have a grayish center and a dark margin and they may colasece, fungal fruiting bodies are visible as tiny black specks in the center of spot, spots may also appear on stems, fruit calyxes, and flowers.",
        "cause": "Fungus",
        "comments": "Spread by water splash, fungus overwinters in plant debris.",
        "management": "Ensure all tomato crop debris is removed and destroyed in Fall or plowed deep into soil, plant only disease free material, avoid overhead irrigation, stake plants to increase air circulation through the foliage, apply appropriate fungicide if necessary.",
        "image": "tomato_septoria_leaf_spot.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 239,
    "fields": {
        "name": "Target Spot",
        "plant": 14,
        "symptoms": "The fungus infects all parts of plant. Infected leaves shows small, pinpoint, water soaked spots initially. As the disease progress the spots enlarge to become necrotic lesions with conspicuous concentric circles, dark margins and light brown centers. Whereas the fruits exhibit brown, slightly sunken flecks in the beginning but later the lesions become large pitted appearance.",
        "cause": "Fungus",
        "comments": "The pathogen infects cucumber, pawpaw , ornamental plants, some weed species etc. The damaged fruits are susceptible for this disease.",
        "management": "Remove the plant debris and burn them. Avoid over application of nitrogen fertilizer. If the disease is severe spray suitable fungicides.",
        "image": "tomato_target_spot.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 240,
    "fields": {
        "name": "Verticillium wilt",
        "plant": 14,
        "symptoms": "Symptoms appear first on lower leaves and spread upwards, initial symptoms of the disease may be visible as yellow blotches on the lower leaves of the plant, a rapid yellowing of leaves follows as the disease progresses, leaf veins turn brown and brown dead spots appear on the leaves, leaves may wilt then die and drop from the plant, the disease progresses upwards through the stem causing the plant to be stunted, leaves at the top of the plant remain green, fruits develop yellow shoulders and yield is reduced, loss of leaves results in fruit being susceptible to sun scald.",
        "cause": "Fungi",
        "comments": "Fungi survive in crop debris in soil, disease emergence favors cool weather.",
        "management": "Plant resistant varieties, sanitize all equipment on a regular basis, rotate with non susceptible crops.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 241,
    "fields": {
        "name": "Bacterial canker",
        "plant": 14,
        "symptoms": "Bacterial canker can affect tomato plants of any age, seedlings may be killed quickly once they become infected, initial symptoms of bacterial canker is the unilateral wilting of plants and formation of light colored streaks up and down the outside of the leaf midrib, petiole and stem, streaks on stems may break open to form cankers,  mature leaves develop small necrotic spots on the upper leaf surfaces or small raised white spots on the leaves, white spots develop on fruit, usually while they are still green, spots on fruit develop a raised dark center and are known as \"bird's eye spots\"",
        "cause": "Bacterium",
        "comments": "Can cause serious crop losses",
        "management": "Plant only certified seed and transplants, hot water treatment of seed to remove bacteria, rotate crops with non host plants, turn crops into soil after harvest to promote decomposition",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 242,
    "fields": {
        "name": "Bacterial speck",
        "plant": 14,
        "symptoms": "Dark specks appear on the leaves, often associated with a yellow halo, foliar symptoms of bacterial speck are very difficult to distinguish from bacterial spot but can be differentiated by symptoms on the fruit, lesions on fruit are much smaller than those caused by bacterial spot, lesions on fruit are raised and scaly.",
        "cause": "Bacterium",
        "comments": "Disease emergence favors cool, moist weather.",
        "management": "Do not plant in same area in successive years, use only high quality, disease free seed and transplants, protective sprays of copper can help to reduce incidence of the disease.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 243,
    "fields": {
        "name": "Bacterial spot",
        "plant": 14,
        "symptoms": "Bacterial spot lesions starts out as small water soaked spots, lesions become more numerous and coalesce to form necrotic areas on the leaves giving them a blighted appearance, of leaves drop from the plant severe defoliation can occur leaving the fruit susceptible to sunscald, mature spots have a greasy appearance and may appear transparent when held up to light, centers of lesions dry up and fall out of the leaf, blighted leaves often remain attached to the plant and give it a blighted appearance, fruit infections start as a slightly raised blister, lesions may have a faint halo which eventually disappears, lesions on fruit may have a raised margin and sunken center which gives the fruit a scabby appearance.",
        "cause": "Bacterium",
        "comments": "Bacteria survive on crop debris, disease emergence favored by warm temperatures and wet weather, symptoms are very similar to other tomato diseases but only bacterial spot will cause a cut leaf to ooze bacterial exudate, the disease is spread by infected seed, wind driven rain, diseased transplants, or infested soil, bacteria enter the plant through any natural openings on the leaves or any openings caused by injury to the leaves.",
        "management": "Use only certified seed and healthy transplants, remove all crop debris from planting area, do not use sprinkler irrigation, instead water from base of plant, rotate crops.",
        "image": "tomato_bacterial_spot.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 244,
    "fields": {
        "name": "Bacterial wilt",
        "plant": 14,
        "symptoms": "Initial symptoms of the disease is the wilting of a few of the youngest leaves, the disease progresses rapidly in hot weather and the entire plant wilts suddenly and dies, in cooler conditions, wilting is less rapid and plant may produce roots on the stems, vascular tissue shows a brown discoloration and decaying roots, stems cut under water will ooze bacterial exudate and will confirm the symptoms are not caused by Fusarium wilt.",
        "cause": "Bacterium",
        "comments": "Bacterial wilt can cause complete destruction of the crop under conditions suitable for the spread of the soil borne bacterium, disease causes serious losses in tomatoes grown in tropical and subtropical regions.",
        "management": "Cultural practices may help to reduce incidence of the disease, rotate tomato with other, non susceptible crops, avoid over watering plants.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 245,
    "fields": {
        "name": "Blossom end rot",
        "plant": 14,
        "symptoms": "Blossom end rot is caused by a low concentration of calcium in the tomato fruit, symptoms initially appear as light tan, water soaked areas which can then enlarge and turn black and leathery in appearance, symptoms are most often seen at the blossom end of the fruit, but may also occur on the side of the fruit, blossom end rot may also occur internally with no visible symptoms on outside of fruit.",
        "cause": "Physiological disorder.",
        "comments": "Low calcium may result from competition from other ions in soil e.g. potassium, can also be caused by drought stress, fluctuations in soil moisture or application of excessive amounts of nitrogen fertilizer which promotes rapid vegetative growth, calcium cannot be translocated from the leaves to the fruit, foliar applications of Ca materials have not proven to reduce BER, since very little Ca is taken up by the fruit, in greenhouse production not cycling the irrigation system at night can increase BER, since night is an important period of Ca uptake.",
        "management": "Maintain soil pH at 6.5, lime soil to increase the concentration of calcium in soil and decrease competition with other ions, use mulch to reduce drought stress, avoid ammonium fertilizers as they may increase competition with calcium by increasing ammonium ions in soil, use nitrate instead, avoid over fertilizing.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 246,
    "fields": {
        "name": "Catface",
        "plant": 14,
        "symptoms": "Catface usually occurs on the blossom end, tomato fruits are usually misshapen with large holes or corky brown scars close to the blossom end of the fruit, fruits are often flattened and may be kidney shaped, holes on the fruit extend deep inside the fruit.",
        "cause": "Physiological disorder",
        "comments": "The catface deformity is possibly caused by internal or external changes that occurs during the formation of the flower resulting in the abnormal development of the fruit, the exact cause is unknown, there may be several factors in fruit deformation, cold weather is known to be a factor along with extreme fluctuations in temperatures between day and night, hormone based herbicides may also cause catfacing, varieties that produce large tomatoes are more prone to catfacing.",
        "management": "Avoid pruning tomato plants excessively, avoid excessive fertilization with nitrogen which promotes rapid vegetative growth, if growing tomatoes in a glasshouse, provide the plants with heat to prevent temperatures dropping to damaging levels, particularly at night.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 247,
    "fields": {
        "name": "Edema (Oedema)",
        "plant": 14,
        "symptoms": "Swellings and/or blisters or calluses on leaves caused by rupturing epidermal and inner leaf cells , deformed foliage which curls, leaf tissue may also tear as the leaf matures, symptoms are often mistaken for disease or insect damage",
        "cause": "Physiological disorder",
        "comments": "Edema occurs when water is absorbed from the soil faster than it can be transpired through the leaves and is caused by soil being warmer than the surrounding air",
        "management": "Tomato plants should always be planted in well draining soil or potting media, avoid overwatering tomato plants, particularly during periods of low light and  cool temperatures, if growing tomatoes in a glasshouse then anything that can be done to increase drainage and air circulation will be helpful in preventing edema, reduce humidity in the glasshouse in the morning by venting the house (heat may need to be turned up during this period depending on outdoor temperatures)",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 248,
    "fields": {
        "name": "Fertilizer burn",
        "plant": 14,
        "symptoms": "Symptoms may first appear as slowed growth and wilting, leaf tips and margins turn brown, plants have a scorched appearance.",
        "cause": "Excess nitrogen salts",
        "comments": "Fertilizer burn is usually caused by an excess of nitrogen salts in the soil which causes an osmotic stress on the plant tissues. The tissues dry out and die resulting in the characteristic scorched appearance of the leaves.",
        "management": "Apply appropriate dose of fertilizer for the particular soil in which the plants are growing   nutrient requirements can be ascertained with a soil test, if liquid fertilizer was used, symptoms may be reversed by watering the plants heavily to leach some of the salts from the soil.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 249,
    "fields": {
        "name": "Little leaf",
        "plant": 14,
        "symptoms": "Little leaf symptoms include interveinal chlorosis of young leaves, distortion and failure of leaves along the midrib to expand, radial cracks of fruits extending from the calyx to the blossom scar and failure of blooms to set, symptoms progress to increased leaflet distortion and more pronounced interveinal chlorosis.",
        "cause": "Physiological disorder",
        "comments": "Three conditions appear to pre dispose plants to little leaf. 1) high soil temperatures 2) high soil moisture and 3) presence of predisposing population of bacterial/fungal microorganisms in the soil.",
        "management": "Little leaf is usually associated with water logged areas of fields, subsequent drying out of affected areas usually resolves the problem and subsequent plant growth is normal, controlling the soil pH may also help the problem.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 250,
    "fields": {
        "name": "Magnesium deficiency",
        "plant": 14,
        "symptoms": "Symptoms of magnesium deficiency appear on older leaves first, initial symptoms are interveinal chlorosis of the leaves and, occasionally, a purple tinge to the leaves, as the deficiency becomes more severe, leaves may appear white with green veins, severe deficiencies may lead to reduced fruit yield.",
        "cause": "Nutritional disorder",
        "comments": "Magnesium deficiency is rare in field grown tomatoes but occurs more frequently in soilless tomato culture.",
        "management": "Magnesium deficiency can be prevented in tomato by applying dolomite lime to the soil, if an increase in soil pH is required, or through applications of a fertilizer containing magnesium.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 251,
    "fields": {
        "name": "Nitrogen deficiency",
        "plant": 14,
        "symptoms": "Affected plants are smaller in size and grow less vigorously than healthy plants, symptoms appear on older leaves first, tomato leaves exhibit a general yellowing occasionally accompanied by purple leaf veins, plants possess thinner stems and fruit is smaller than healthy plants, fruits may be misshapen with a lighter red color than healthy plants.",
        "cause": "Nutritional disorder",
        "comments": "Nitrogen deficiency usually arises in tomato plantations through inadequate fertilizer application, heavy rain can leach nitrogen from sandy soils.",
        "management": "If detected early, symptoms of nitrogen deficiency can be treated by applying appropriate amounts of nitrogen fertilizer.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 252,
    "fields": {
        "name": "Phosphorous deficiency",
        "plant": 14,
        "symptoms": "Growth of tomato seedlings is reduced compared with healthy plants, leaves appear darker green and may have a purple tinge, in older tomato plants, leaves grow upright and appear light green on the upper surface and purple on the lower surface, symptoms appear on older leaves first.",
        "cause": "Nutritional disorder",
        "comments": "Phosphorous deficiency is rare in soils that are already used for agricultural purposes, in field grown tomatoes phosphorous deficiency more commonly appears in newly cleared land which has never been used to grow crops, phosphorus deficiency may occur on soilless tomato cultures if applications of the nutrient are inadequate.",
        "management": "Soil levels of phosphorous should be measured prior to planting to determine the appropriate application for the particular site, phosphorous should be applied to the soil prior to planting if required as applications made after the onset of tomato growth are not usually successful in preventing symptoms.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 253,
    "fields": {
        "name": "Potassium deficiency",
        "plant": 14,
        "symptoms": "Affected plants are smaller than healhty plants with smaller fruits and reduced yields, tomato leaves exhibit \"bronzing\", older plant leaves turn tan and then brown at the margins, if deficiency is prolonged, leaves become necrotic at the margins and turn yellow between leaf veins.",
        "cause": "Nutritional disorder",
        "comments": "Potassium deficiency is usually caused by an inadequate fertilization, it is more common in sandy soils where the nutrient is easily leached from the soil by heavy rainfall.",
        "management": "Potassium deficiency can be corrected through applications of the nutrient as a side dressing and/or through an irrigation system.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 254,
    "fields": {
        "name": "Sunscald",
        "plant": 14,
        "symptoms": "Symptoms of sunscald are most common on green fruit, white or yellow necrotic patches develop on the sides of the fruit that are facing the sun, blisters may be white with a yellow halo, damaged areas may become flattened in appearance and papery in texture, damaged areas are often invaded by secondary pathogens and turn black.",
        "cause": "Physiological disorder",
        "comments": "Sunscald is common on plants which have been moved suddenly from a shaded location to full sun.",
        "management": "Healthy plants with full foliage are less susceptible to sunscald as the leaves provide fruits with shading, ensure plants are watered regularly and fertilized adequately, use shade cloth to protect the fruits from the sun, control diseases that develop to prevent defoliation which can lead to sunscald.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 255,
    "fields": {
        "name": "Water stress",
        "plant": 14,
        "symptoms": "Leaves are green but wilting, leaves roll downwards and eventually drop from the plant, fruits may develop symptoms of Blossom end rot (See entry).",
        "cause": "Physiological stress",
        "comments": "It is important to distinguish between plants that are temporarily wilted on hot days and those that are stressed due to lack of moisture in the soil, on very hot days tomato plants will wilt as the rate of transpiration exceeds the rate at which water can be taken up from the soil by the roots and the plants will usually recover in the evening when temperatures are cooler.",
        "management": "Tomato plants should be watered deeply and evenly to avoid water stress, aim to keep the soil moist but not wet, allow the top of the soil to dry before watering again.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 256,
    "fields": {
        "name": "Zippering",
        "plant": 14,
        "symptoms": "Thin brown scars extending longutudinally from the petiole to the blossom end of the fruit, each scar has smaller scars crossing it tranversely rendering it zipper like in appearance, holes may open on along the scarred area.",
        "cause": "Physiological disorder",
        "comments": "Zipper scars on tomato fruit are most prevalent in cool weather.",
        "management": "The most effective method of preventing zippering is to grow tolerant varieties, when growing tomatoes in the glasshouse, appropriate temperatures should be maintained.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 257,
    "fields": {
        "name": "Buckeye rot (Phytophthora root rot)",
        "plant": 14,
        "symptoms": "Buck eye rot of tomato initially appears as a brown spot on the fruit which enlarges over the fruit surface and forms concentric rings, the lesions may eventually cover up to half of the fruit and the flesh develops a soft rot underneath the skin, green or red fruits can be affected and disease often develops where fruit is in contact with the soil, white cottony growth may be visible in the centers of affected regions, spots enlarge and form large concentric ring shaped symptoms which are usually brown in color with sunken edges, the Phytophthora pathogen also causes root rot, young plants may exhibit a white cottony growth at crown of the plant and begin to wilt as the damage to the roots progresses, Phytophthora root rot can cause severe destruction of plant roots and cause the plants to wilt completely.",
        "cause": "Fungi",
        "comments": "Prolonged period of warm wet conditions favor disease occurrence, heavy soil saturation also favors disease development in soils where pathogen is present, disease can be spread by splashing water.",
        "management": "Cultural control methods such as mulching around the plants and practicing rotation away from tomato can help to reduce losses from the disease, fungicides applied for the control of late blight also help to control the development of buckeye rot, solarizing or fumigating soil can help to reduce levels of inoculum.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 258,
    "fields": {
        "name": "Late blight",
        "plant": 14,
        "symptoms": "Late blight affects all aerial parts of the tomato plant, initial symptoms of the disease appear as water soaked green to black areas on leaves which rapidly change to brown lesions, fluffy white fungal growth may appear on infected areas and leaf undersides during wet weather, as the disease progresses, foliage becomes becomes shriveled and brown and the entire plant may die, fruit lesions start as irregularly shaped water soaked regions and change to greasy spots, entire fruit may become infected and a white fuzzy growth may appear during wet weather.",
        "cause": "Oomycete",
        "comments": "Can devastate tomato plantings.",
        "management": "Plant resistant varieties, if signs of disease are present or if rainy conditions are likely or if using overhead irrigation appropriate fungicides should be applied.",
        "image": "tomato_late_blight.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 259,
    "fields": {
        "name": "Tomato mosaic virus",
        "plant": 14,
        "symptoms": "Symptoms can occur at any growth stage and any part of the plant can be affected, infected leaves generally exhibit a dark green mottling or mosaic, some strains of the virus can cause yellow mottling on the leaves, young leaves may be stunted or distorted, severely infected leaves may have raised green areas, fruit yields are reduced in infected plants, green fruit may have yellow blotches or necrotic spots, dark necrotic streaks may appear on the stems, petioles leaves and fruit.",
        "cause": "Virus",
        "comments": "ToMV is a closely related strain of Tobacco mosaic virus (TMV), it enters fields via infected weeds, peppers or potato plants, the virus may also be transmitted to tomato fields by grasshoppers, small mammals and birds.",
        "management": "Plant varieties that are resistant to the virus, heat treating seeds at 70--C (158--F) for 4 days or at 82---85--C (179.6---185--F) for 24 hours will help to eliminate any virus particles on the surface of the seeds, soaking seed for 15 min in 100 g/l of tri sodium phosphate solution (TSP) can also eliminate virus particles   seeds should be rinsed thoroughly and laid out to dry after this treatment, if the virus is confirmed in the field, infected plants should be removed and destroyed to limit further spread, plant tomato on a 2 year rotation, avoiding susceptible crops such as peppers, eggplant, cucurbits and tobacco, disinfect all equipment when moving from infected areas of the field.",
        "image": "tomato_mosaic_virus.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 260,
    "fields": {
        "name": "Tomato spotted wilt",
        "plant": 14,
        "symptoms": "Infected plants exhibit bronzing or purpling of the upper sides of young leaves and develop necrotic spots, leaf spots may resemble those caused by bacterial spot, but a bacterial ooze test will be negative, leaves may cup downwards, shoot tips may begin to die back, symptoms on ripe fruit appear as chlorotic spots and blotches, often with concentric rings, ring spot symptoms vary with different tomato cultivars, irregular ripening caused by TSWV can also show up when fruit are treated with ethylene gas, green fruit may exhibit slightly raised areas with faint concentric zonation.",
        "cause": "Virus",
        "comments": "TSWV infects numerous ornamentals, vegetables, field crops and weeds, virus is vectored by at least eight species of thrips, thrips, acquires the virus during the larval stages,and transmit the virus when they are adults.",
        "management": "Control populations of western flower thrips and onion thrips",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 261,
    "fields": {
        "name": "Tomato Yellow Leaf Curl disease",
        "plant": 14,
        "symptoms": "The infected leaves become reduced in size, curl upward, appear crumpled and show yellowing of veins and leaf margins. The internodes become shorter and whole plant appear stunted and bushy. The whole plant stand erect with only upright growth. The flowers may not develop and drop off.",
        "cause": "Virus",
        "comments": "The virus is transmitted by white flies and may cause 100 % yield loss if the plants infect at early stage of crop. The virus also infect other hosts like common bean, ornamental plants and several weed species.",
        "management": "Grow available resistant varieties. Transplant only disease and whiteflies free seedlings. Remove the infected plants and burn them. Keep the field free from weeds. Use yellow sticky traps to monitor and control whiteflies. If the insect infestation is severe spray suitable insecticides.",
        "image": "tomato_yellow_leaf_curl_virus.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 262,
    "fields": {
        "name": "Aphids (Peach aphid, Potato aphid)",
        "plant": 14,
        "symptoms": "Small soft bodied insects on underside of leaves and/or stems of plant, usually green or yellow in color, but may be pink, brown, red or black depending on species and host plant, if aphid infestation is heavy it may cause leaves to yellow and/or be distorted, necrotic spots on leaves and/or stunted shoots, aphids secrete a sticky, sugary substance called honeydew which encourages the growth of sooty mold on the plants.",
        "cause": "Insect",
        "comments": "Distinguishing features of aphids include the presence of cornicles (tubular structures) which project backwards from the insect's body, aphids will generally not move very quickly when disturbed, aphids may also transmit plant viruses to the plant when they feed.",
        "management": "If aphid population is limited to just a few leaves or shoots then the infestation can be pruned out to provide control, check transplants for aphids before planting, use tolerant varieties if available, reflective mulches such as silver colored plastic can deter aphids from feeding on plants, sturdy plants can be sprayed with a strong jet of water to knock aphids from leaves, insecticides are generally only required to treat aphids if the infestation is very high   plants generally tolerate low and medium level infestation, insecticidal soaps or oils such as neem or canola oil are usually the best method of control, always check the labels of the products for specific usage guidelines prior to use.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 263,
    "fields": {
        "name": "Beet armyworm",
        "plant": 14,
        "symptoms": "Singular, or closely grouped circular to irregularly shaped holes in foliage, heavy feeding by young larvae leads to skeletonized leaves, shallow, dry wounds on fruit, egg clusters of 50 150 eggs may be present on the leaves, egg clusters are covered in a whitish scale which gives the cluster a cottony or fuzzy appearance, young larvae are pale green to yellow in color while older larvae are generally darker green with a dark and light line running along the side of their body and a pink or yellow underside.",
        "cause": "Insect",
        "comments": "Insect can go through 3 5 generations a year.",
        "management": "Organic methods of controlling the beet armyworm include biological control by natural enemies which parasitize the larvae and the application of Bacillus thuringiensis, there are chemicals available for commercial control but many that are available for the home garden do not provide adequate control of the larvae.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 264,
    "fields": {
        "name": "Colorado potato beetle",
        "plant": 14,
        "symptoms": "Feeding damage to foliage, if infestation is severe or if left untreated plants can be completely defoliated, adult insect is a black and yellow striped beetle, larvae are bright red with black heads when they first hatch and change color to pink, larvae have two rows of black spots.",
        "cause": "Insect",
        "comments": "Adult beetles emerge in spring, female beetles lay eggs in batches of up to two dozen, eggs are orange yellow and are laid on undersides of leaves, a female can lay 500 or more eggs over a four to five week period.",
        "management": "Control of Colorado potato beetle can be challenging as they have developed high levels of insecticide resistance, adults and larvae should be hand picked from plants and destroyed in soapy water, applications of Bacillus thuringiensis can be effective at controlling larvae but should be applied frequently, some insecticides, including spinosad, are still effective against adult beetles.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 265,
    "fields": {
        "name": "Cutworms",
        "plant": 14,
        "symptoms": "Stems of young transplants or seedlings may be severed  at soil line, if infection occurs later, irregular holes are eaten into the surface of fruits, larvae causing the damage are usually active at night and hide during the day in the soil at the base of the plants or in plant debris of toppled plant, larvae are 2.5---5.0 cm (1---2 in) in length, larvae may exhibit a variety of patterns and coloration but are usually dirty gray or brown to black with dark spots or lines and will curl up into a characteristic C shape when disturbed",
        "cause": "Insect",
        "comments": "Cutworms have a wide host range and attack vegetables including asparagus, bean, cabbage and other crucifers, carrot, celery, corn, lettuce, pea, pepper, potato and tomato",
        "management": "Remove all plant residue from soil after harvest or at least two weeks before planting, this is especially important if the previous crop was another host such as alfalfa, beans or a leguminous cover crop, plastic or foil collars fitted around plant stems to cover the bottom 3 inches above the soil line and extending a couple of inches into the soil can prevent larvae severing plants, hand pick larvae after dark, spread diatomaceous earth around the base of the plants (this creates a sharp barrier that will cut the insects if they try and crawl over it), apply appropriate insecticides to infested areas of garden or field if not growing organically",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 266,
    "fields": {
        "name": "Flea beetles",
        "plant": 14,
        "symptoms": "Small holes or pits in leaves that give the foliage a characteristic ---shothole--- appearance, young plants and seedlings are particularly susceptible, plant growth may be reduced, if damage is severe the plant may be killed, feeding damage may also occur on the fruit, the pest responsible for the damage is a small (1.5---3.0 mm) dark colored beetle which jumps when disturbed, the beetles are often shiny in appearance.",
        "cause": "Insects",
        "comments": "Flea beetles may overwinter on nearby weed species, in plant debris or in the soil, insects may go through a second or third generation in one year.",
        "management": "In areas where flea beetles are a problem, floating row covers may have to be used prior to the emergence of the beetles to provide a physical barrier to protect young plants, plant seeds early to allow establishment before the beetles become a problem   mature plants are less susceptible to damage, trap crops may provide a measure of control   cruciferous plants are best, application of a thick layer of mulch may help prevent beetles reaching surface, application on diamotecoeus earth or oils such as neem oil are effective control methods for organic growers, application of insecticides containing carbaryl, spinosad, bifenthrin and permethrin can provide adequate control of beetles for up to a week but will need reapplied.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 267,
    "fields": {
        "name": "Hornworms (Tomato hornworm, Tobacco hornworm)",
        "plant": 14,
        "symptoms": "Feeding damage to leaves or leaves stripped from plant, heavy infestation may result in damage to fruit appearing as large open scars, large green caterpillars may be spotted on plant, caterpillars may reach in excess of 7.5 cm (3 in) in length and possess a spike at the end of their body, most common species have 7 diagonal stripes on sides or 8 v shaped markings on each side, single eggs may be present on leaves and measure approx 1.3 mm in diameter, eggs are in initially light green in color and turn white prior to hatching.",
        "cause": "Insect",
        "comments": "Insect overwinters as pupa in soil, typically undergoes 2 generations per year, heavy infestations are more common in warm areas.",
        "management": "Hand pick larvae from plants leaving any parasitized larvae behind to promote populations of natural enemies (these larvae can be distinguished by the presence of white, oblong shaped cocoons on their backs), sprays of Bacillus thuringiensis are organically acceptable and highly effective.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 268,
    "fields": {
        "name": "Leafminers",
        "plant": 14,
        "symptoms": "Thin, white, winding trails on leaves, heavy mining can result in white blotches on leaves and leaves dropping from the plant prematurely, early infestation can cause fruit yield to be reduced, adult leafminer is a small black and yellow moth which lays its eggs in the leaf, larvae hatch and feed on leaf interior.",
        "cause": "Insect",
        "comments": "Origin and distribution of Tuta absoluta: This species is originated in South American countries. Later the insect spread to Spain (2006), France, Italy, Greece, Malta, Morocco, Algeria, Libya and Turkey in following years. Further the insect has been identified in Syria, Lebanon, Jordan, Iraq, Iran, Saudi Arabia, Yemen, Oman and the rest of the Gulf states. In Africa it spreads from Egypt to Sudan, South Sudan, Ethiopia, Uganda, Kenya and Tanzania (in East) and to Senegal and Nigeria through the west. (It spread through infested fruits and packaging materials)\n\n\n\nLife cycle: Mature larvae drop from leaves into soil to pupate, entire lifecycle can take as little as 2 weeks in warm weather, insect may go through 7 to 12 generations per year.\n\n\n\nYield loss: If unchecked, insect will cause 100% yield loss. The larvae feeds on apical buds, tender new leaflets, flowers, and green fruits which make it a serious pest in tomato.\n\n\n\nHost Range: This insect also attacks other solanaceous crops like potato, eggplant, pepino and tobacco. It is also reported on many solanaceous weeds.",
        "management": "Leafminer natural enemies normally keep populations under control, check transplants for signs of leafminer damage prior to planting, remove plants from soil immediately after harvest if making new plantings in same place or close by, keep the field free from weeds especially Solanum, Datura, Nicotiana, use pheromone traps and white sticky traps to monitor and control insect,only use insecticides when leafminer damage has been identified as unnecessary spraying will also reduce populations of their natural enemies.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 269,
    "fields": {
        "name": "Loopers (Cabbage looper , Alfalfa looper)",
        "plant": 14,
        "symptoms": "Large or small holes in leaves, damage often extensive, caterpillars are pale green with a white lines running down either side of their body, caterpillars are easily distinguished by the way they arch their body when moving, eggs are laid singly, usually on the lower leaf surface close to the leaf margin, and are white or pale green in color.",
        "cause": "Insect",
        "comments": "Insects overwinter as pupae in crop debris in soil, adult insect id a dark colored moth, caterpillars have a wide host range.",
        "management": "Looper populations are usually held in check by natural enemies, if they do become problematic larvae can be hand picked from the plants, an organically acceptable control method is the application of Bacillus thuringiensis which effectively kills younger larvae, chemical sprays may also damage populations of natural enemies and should only be considered if sunburn of fruit is likely.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 270,
    "fields": {
        "name": "Stinkbugs  (Various)",
        "plant": 14,
        "symptoms": "Dark colored pinpricks on fruit surrounded by a lighter area that turns yellow or remains light green, stink bugs often carry pathogens in their mouthparts which can cause secondary infections and decay of fruit, adult insect is shield shaped and brown or green in color, may have pink, red or yellow markings, eggs are drum shaped and laid in clusters on the leaves, larvae resemble the adults but are smaller.",
        "cause": "Insect",
        "comments": "Several types of stink bug can cause damage to tomatoes, adult insects overwinter under leaves, on legumes, blackberries or on certain weeds such as mustard or Russian thistle.",
        "management": "Remove weeds around crop which may act as overwintering sites for stink bugs and practice good weed management throughout the year, organically accepted control methods include the use of insecticidal soaps, kaolin clay and preservation of natural enemies, chemical treatments are not recommended for tomatoes that are to be processed for paste or canning unless secondary infections with other pathogens are a concern.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 271,
    "fields": {
        "name": "Thrips (Western flower thrips, Onion thrips, etc.)",
        "plant": 14,
        "symptoms": "If population is high leaves and buds may be distorted, leaves appear silvery and are speckled with black feces, most damage occurs through the transmission of Tomato spotted wilt virus (TSWV), insect is small (1.5 mm) and slender and best viewed using a hand lens, adult thrips are pale yellow to light brown and the nymphs are smaller and lighter in color.",
        "cause": "Insect",
        "comments": "Transmit Tomato spotted wilt virus (see disease entry), once acquired, the insect retains the ability to transmit the virus for the remainder of its life.",
        "management": "Avoid planting next to onions, garlic or cereals where very large numbers of thrips can build up, use reflective mulches early in growing season to deter thrips, apply appropriate insecticide if thrips become problematic.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 272,
    "fields": {
        "name": "Tomato fruit worm (Corn earworm)",
        "plant": 14,
        "symptoms": "Holes in tomato fruit, including entry holes near stem end, feeding turns inside of tomato into a watery cavity filled with cast skins and frass (insect feces), damaged fruit ripens prematurely, young caterpillars are cream white in color with a black head and black hairs, older larvae may be yellow green to almost black in color with fine white lines along their body and black spots at the base of hairs, eggs are laid singly on both upper and lower leaf surfaces and are initially creamy white but develop a brown red ring after 24 hours and darken prior to hatching.",
        "cause": "Insect",
        "comments": "Adult insect is a pale green to tan, medium sized moth, can be one of the most damaging pests of tomato, insect overwinters as pupae in the soil, the insect is also a damaging pest of corn and is also referred to as the corn earworm.",
        "management": "Early treatment of tomato fruitworms is necessary as once they enter the fruit they are protected from sprays, monitor plants for eggs and young larvae and also natural enemies that could be damaged by chemicals, Bacillus thuringiensis or Entrust SC may be applied to control insects on organically grown plants, appropriate chemical treatment may be required for control in commercial plantations.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 273,
    "fields": {
        "name": "Curly top",
        "plant": 14,
        "symptoms": "Young plants are usually killed by the virus, older plants are stunted and turn yellow to bronze in color with purple tinged leaves, leave become thickened and roll upwards, leaf petioles roll downwards, green fruit turns red regardless of its age and becomes dull in color and wrinkled, plants do not recover form the disease and will not flower of produce fruit after infection.",
        "cause": "Virus",
        "comments": "Virus is transmitted by beet leafhoppers, insects transmit the disease between over 300 species of plant, including beets, tomato, squash, swiss chard, cucumber and melon.",
        "management": "There is no resistance to Beet curly top virus in tomato so control relies on the management of the leafhopper vector, dense stands of tomato may discourage leafhoppers from visiting the plants, chemical spraying programs to protect against beet leafhoppers have been implemented in some areas of the US state of California , in areas where the virus is a chronic problem, n areas where curly top is chronic, dense plant spacing, shading, row covers, and intercropping have been reported to reduce levels of infection.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 274,
    "fields": {
        "name": "Root knot nematode",
        "plant": 14,
        "symptoms": "The characteristic symptom of root knot nematodes is the presence of galls on roots which can be up to 3.3 cm (1 in) in diameter but are usually smaller, galls cause a reduction in plant vigor, if the galls on the roots are extensive then plants may yellow and wilt, particularly in hot weather.",
        "cause": "Nematode",
        "comments": "Galls can appear as quickly as a month prior to planting, nematodes prefer sandy soils and damage in areas of field or garden with this type of soil is most likely, disease can be a major problem if soils are infected with Meloidogyne sp. and resistant varieties are not used for production.",
        "management": "Plant resistant varieties if nematodes are known to be present in the soil ,check roots of plants mid season or sooner if symptoms indicate nematodes, solarizing soil can reduce nematode populations in the soil and levels of inoculum of many other pathogens.",
        "image": "none.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 275,
    "fields": {
        "name": "Spider mites (Two spotted spider mite)",
        "plant": 14,
        "symptoms": "Leaves stippled with yellow, leaves may appear bronzed, webbing covering leaves, mites may be visible as tiny moving dots on the webs or underside of leaves, best viewed using a hand lens, usually not spotted until there are visible symptoms on the plant, leaves turn yellow and may drop from plant.",
        "cause": "Arachnid",
        "comments": "Spider mites thrive in dusty conditions, water stressed plants are more susceptible to attack.",
        "management": "In the home garden, spraying plants with a strong jet of water can help reduce buildup of spider mite populations, if mites become problematic apply insecticidal soap to plants, certain chemical insecticides may actually increase mite populations by killing off natural enemies and promoting mite reproduction.",
        "image": "tomato_spider_mite.jpg"
    }
},
{
    "model": "main.disease",
    "pk": 276,
    "fields": {
        "name": "Healthy",
        "plant": 14,
        "symptoms": "Tomato, Lycopersicum esculentum (syn. Solanum lycopersicum and Lycopersicon lycopersicum) is an herbaceous annual in the family Solanaceae grown for its edible fruit. The plant can be erect with short stems or vine like with long, spreading stems. The stems are covered in coarse hairs and the leaves are arranged spirally. The tomato plant produces yellow flowers, which can develop into a cyme of 3-12, and usually a round fruit (berry) which is fleshy, smoothed skinned and can be red, pink, purple, brown, orange or yellow in color. The tomato plant can grow 0.7-2 m (2.3-6.6 ft) in height and as an annual, is harvested after only one growing season. Tomato may also be referred to as love apple and originates from South America. ",
        "cause": "Nil",
        "comments": "Nil",
        "management": "Nil",
        "image": "tomato_healthy.jpg"
    }
}
]
